{
  "Description": {
    "Id": "event_GhostsOfRetribution_GhostBearWatch_ColdOrders",
    "Name": "Cold Orders",
    "Details": "<color=#BFBFBF>The bridge holotable lights up with a fresh transmission—sealed under full encryption. The identifier reads: <b>Jorgensson, A</b>.\n\nThe image resolves slowly. Arelle stands at parade rest, her uniform pristine, her posture stiff. She doesn’t offer a greeting.</color>\n\n“Commander.\n\nBased on recent intelligence intercepts, we have isolated three key sites where the enemy is consolidating assets or infrastructure critical to their next phase of operations.\n\nYour unit is to proceed first to </i>Eagle Rest<i>. A hostile relay array has been embedded in legacy terraforming machinery and is suspected of coordinating encrypted off-world logistics.\n\nAfterward, you will be directed to </i>Butzfleth Majoris<i> and </i>Cygnus III<i>, in that order. Full details will be provided on arrival.\n\nMaintain strict operational silence. Continue to act under Watch directive. That is all.”\n\n<color=#BFBFBF>The feed cuts before anyone can speak. A beat of silence follows.\n\nDarius exhales slowly.</color> “Well. That wasn’t icy at all.”\n\n<color=#BFBFBF>Yang scratches behind his ear.</color> “She even blink during that?”\n\n<color=#BFBFBF>Sumire mutters,</color> “Three jumps. Three systems. Across half a quadrant. In a rustbucket held together by duct tape and Farah’s existential dread. Great.”\n\n<color=#BFBFBF>Farah doesn’t look up from her data slate.</color> “I’ll prep the systems. But she could at least pretend we’re not disposable.”\n\n<color=#BFBFBF>Darius glances at you.</color> “You want to press forward, Commander? This starts with Eagle Rest. Once we jump... we’re committed.”\n\n<color=#BFBFBF>You nod. The order's clear. The sentiment behind it? Less so. But the war moves on—and you're going with it.</color>",
    "Icon": "uixTxrSpot_ConferenceRoom"
  },
  "Scope": "Company",
  "Weight": 10,
  "Requirements": {
    "Scope": "Company",
    "RequirementTags": {
      "items": [
        "ShouldNeverTriggerProcedurally"
      ],
      "tagSetSourceFile": ""
    },
    "ExclusionTags": {
      "items": [],
      "tagSetSourceFile": "Tags/CompanyTags"
    },
    "RequirementComparisons": []
  },
  "AdditionalRequirements": [],
  "AdditionalObjects": [],
  "Options": [
    {
      "Description": {
        "Id": "outcome_0",
        "Name": "Prepare to leave for Eagle Rest",
        "Details": ""
      },
      "RequirementList": [
        {
          "Scope": "Company",
          "RequirementTags": {
            "items": [],
            "tagSetSourceFile": ""
          },
          "ExclusionTags": {
            "items": [],
            "tagSetSourceFile": ""
          }
        }
      ],
      "ResultSets": [
        {
          "Description": {
            "Id": "outcome_0_0",
            "Name": "Prepare to leave for Eagle Rest",
            "Details": "<color=#BFBFBF>As the <i>Argo</i> stabilizes for the next jump, you glance toward Farah’s station.</color>\n\n“Farah. What do we know about <i>Eagle Rest II</i>?”\n\n<color=#BFBFBF>She nods, taps a few commands, and a display panel flares to life with a rotating image of the planet.</color>\n\n“Small world. Shallow oceans, scattered forests. Used to be an [[DM.Factions[faction_SLDF],SLDF]] terraforming site—abandoned fast. Now it’s just overgrowth and rusted-out ruins.”\n\n<color=#BFBFBF>She flicks to another overlay.</color> “Some isolated villages still hang on. Primitive tech, combustion engines, salvage work. No real infrastructure. No oversight.”\n\n<color=#BFBFBF>Her eyes linger on a faint orbital ring.</color> “And that belt? Likely the remains of a shattered moon. No clue what broke it.”\n\n<color=#BFBFBF>She crosses her arms.</color> “In other words—quiet, forgotten, and perfect for whatever the Tribe doesn’t want found.”\n\n<b><color=#F79B25>[A new flashpoint has been created in the <i>Eagle Rest</i> system, head there for the contract]</color></b>"
          },
          "Weight": 100,
          "Results": [
            {
              "Scope": "Company",
              "AddedTags": {
                "items": [
                ],
                "tagSetSourceFile": "Tags/CompanyTags"
              },
              "RemovedTags": {
                "items": [],
                "tagSetSourceFile": ""
              },
              "Actions": [],
              "TemporaryResult": false
            }
          ]
        }
      ],
      "Requirements": {
        "Scope": "Company",
        "RequirementTags": {
          "items": [],
          "tagSetSourceFile": ""
        },
        "ExclusionTags": {
          "items": [],
          "tagSetSourceFile": ""
        }
      }
    }
  ],
  "PublishState": "PUBLISHED",
  "ValidationState": "UNTESTED",
  "EventType": "NORMAL",
  "OneTimeEvent": false,
  "Tags": {
    "items": [],
    "tagSetSourceFile": "tags/EventTags"
  }
}