{
  "Description": {
    "Id": "event_GhostsOfRetribution_MinnesotaTribe_TheKeyArrives",
    "Name": "The Key Arrives",
    "Details": "<color=#BFBFBF>The waiting stretches on—quiet, watchful. No new pings, no scheduled updates. Just long-range scans and standard monitoring protocols.\n\nThen, an identification signal appears. Not broadcast—buried. Encoded in a tight envelope using the same Tribe cipher Mizuki once shared, and routed through a degraded relay deep in McEvedy’s Folly’s orbital junkfield.\n\nFarah picks it up instantly.</color> “We’ve got something incoming. They identified using the same Tribe encryption as last time.”\n\n<color=#BFBFBF>Moments later, the proximity alert pings. A compact shuttle—no markings, no chatter—rises over the horizon and burns toward the Argo.\n\nNo weapons. No transponder. No instructions. It docks without asking.\n\nAirlock cycle: fast. A single figure boards—cloaked, helmeted, silent. They carry a sealed crate. No introduction, no ceremony. The figure places the crate just inside the corridor, gives a single nod, and vanishes back through the airlock before anyone speaks.\n\nSumire mutters from the upper deck.</color> “Friendly types, aren’t they.”\n\n<color=#BFBFBF>The crate is sealed but untrapped.  Inside: a dense, ruggedized encryption unit—low EM profile, thermally shielded, and covered in unfamiliar diagnostic ports. A slight humming can be heard from its insides.\n\nShe crouches beside the crate, tools in hand.</color> “This isn’t standard crypto gear. It’s layered. Already semi-active. Whatever protocol this is... it’s beyond anything I’ve seen. It’s not just secure—it’s engineered to keep everything else from even knowing it exists.”",
    "Icon": "uixTxrSpot_Crates"
  },
  "Scope": "Company",
  "Weight": 10,
  "Requirements": {
    "Scope": "Company",
    "RequirementTags": {
      "items": [
        "ShouldNeverTriggerProcedurally"
      ],
      "tagSetSourceFile": ""
    },
    "ExclusionTags": {
      "items": [      ],
      "tagSetSourceFile": "Tags/CompanyTags"
    },
    "RequirementComparisons": []
  },
  "AdditionalRequirements": [],
  "AdditionalObjects": [],
  "Options": [
    {
      "Description": {
        "Id": "outcome_0",
        "Name": "Bring the encryption device to the Conference Room",
        "Details": ""
      },
      "RequirementList": [
        {
          "Scope": "Company",
          "RequirementTags": {
            "items": [],
            "tagSetSourceFile": ""
          },
          "ExclusionTags": {
            "items": [],
            "tagSetSourceFile": ""
          }
        }
      ],
      "ResultSets": [
        {
          "Description": {
            "Id": "outcome_0_0",
            "Name": "Bring the encryption device to the Conference Room",
            "Details": "<color=#BFBFBF>As soon as Farah enters the Conference room she closes in on the hyperpulse transmission console with the device.\n\n“Here goes nothing...” she mutters as she starts attaching the device to the common interface of the console. The moment the device links to the Argo’s comms systems, the device initiates a remote handshake—no prompt, no warning. The comms relay locks into a precision-aligned link.\n\nA connection is forming.</color>"
          },
          "Weight": 100,
          "Results": [
            {
              "Scope": "Company",
              "AddedTags": {
                "items": [
                ],
                "tagSetSourceFile": "Tags/CompanyTags"
              },
              "RemovedTags": {
                "items": [],
                "tagSetSourceFile": ""
              },
              "Actions": [],
              "TemporaryResult": false
            }
          ]
        }
      ],
      "Requirements": {
        "Scope": "Company",
        "RequirementTags": {
          "items": [],
          "tagSetSourceFile": ""
        },
        "ExclusionTags": {
          "items": [],
          "tagSetSourceFile": ""
        }
      }
    }
  ],
  "PublishState": "PUBLISHED",
  "ValidationState": "UNTESTED",
  "EventType": "NORMAL",
  "OneTimeEvent": false,
  "Tags": {
    "items": [],
    "tagSetSourceFile": "tags/EventTags"
  }
}