{
    "notifications": [
        {
            "affectsVersion": "Treadnought 1.1.0.0",
            "allowBackout": false,
            "notification": "LAM Rework\n\nAll LAMS are now a unit class of their own, able to transform between Flight and Mech Mode\n\n!!WARNING!!\n\nOld LAM items will be completely deprecated and removed over time\n\nLAM's require to be stored and readied again to be updated to new defaults\n\nTo compensate, old lam items have received a buff to their value to recuperate costs \n\n-LAM have their own structure, engine and armor parts\n-LAM have access to unique weapons and equipment\n\nWhen in LAM Mode\n-Unaffected by Ground\n-Walk and Run speed count for Movement\n-LAM Turbines Add walk Speed in LAM Mode\n-LAM's can engage their Afterburner. Allowing extremely long range jumps at extreme heat costs\n-LAM's can Melee VTOL\n\nWhen in Mech Mode\n-They act like a normal BattleMech\n-No Massive Jump Distances\n-Turbines run slightly cooler then Standard JJ"
        },
        {
            "affectsVersion": "MechRiders 1.2.0.0",
            "allowBackout": false,
            "notification": "Major Battle Armor rework to bring them closer to TT values, you will need to store/ready all BAs for them to function properly. You also need to store/ready every vehicle you have that say it has BA bays in description.\n\n  Battle Armors now can mount friendly units and swarm enemies. Complete explanation can be read here https://github.com/ajkroeg/StrategicOperations \n  Use Mount ability targeting friendly unit to mount. To dismount use Mount ability targeting the unit BA is attached to. Any BA can mount vehicles with BA bays (this is noted in vehicle description). Most BA can mount Omnimechs. Some BA can mount any friendly unit except VTOLs and LAMs.\n Use Mount ability targeting enemy unit to swarm. If swarm is successful BA will attach to target and fire all its enabled weapons at absolute accuracy and with 20% damage bonus. On the following turn use \"Done\" button to continue swarming, or Mount ability targeting swarmed unit to dismount. VTOLs and LAMs can't be swarmed.\n BAs attached externally to a unit regardless friendly or hostile has 33% chance to be hit by shots hitting location BA is attached to.\n  You can use Swat and Roll (self knockdown) abilities to try to get rid of swarming BAs.\n  Battle Armors can no longer run (have run speed equal to walk speed) or perform DFA (DFA on BAs was always a proxy for swarm) \n AI units have a chance to spawn with BA attached to them. Chance and maximum number of BAs that can spawn is faction dependent and raise with difficulty."
        },
        {
            "affectsVersion": "Mechattan Project 1.0.0.0",
            "allowBackout": false,
            "notification": "This is SAVE BREAKING update. Read changelog for a full list of changes."
        },
        {
            "affectsVersion": "Mechattan Project 1.0.0.8",
            "allowBackout": true,
            "notification": "Warning: If you play on the Online Map (RTO), from now on most in-game difficulty settings will be permanently locked to whatever is currently set. To change these before they are locked in please hit 'Back Out', load your save and switch your modifiers in game and SAVE, BEFORE you apply this update."
        },
        {
            "affectsVersion": "Mechattan Project 1.0.4.3",
            "allowBackout": true,
            "notification": "Warning: You need to verify/reinstall BT before this update."
        },
        {
            "affectsVersion": "HHR 1.0.0.0",
            "allowBackout": false,
            "notification": "This is SAVE BREAKING update. Read changelog for a full list of changes."
        }
    ],
    "codeNames": [
        {
            "codeName": "Treadnought",
            "value": 1
        },
        {
            "codeName": "MechRiders",
            "value": 2
        },
        {
            "codeName": "Mechattan Project",
            "value": 3
        },
        {
            "codeName": "HHR",
            "value": 4
        }
    ]
}