{
    "Description" : {
        "Id" : "event_co_BearingDownAddahBearing_Fallback",
        "Name" : "More Jibba Jabba",
        "Details" : "You're halfway through reviewing drop logistics on your datapad when Darius pokes his head into your quarters, his expression somewhere between casual and guilty.\r\n\r\n \"Commander,\" he starts, drawing out the word like he's trying to soften a blow. \"You, uh… remember what's on your schedule today?\"\r\n\r\nYou look up from the screen. \"Should I?\"\r\n\r\nHe steps fully into the room, holding a crumpled copy of the operations calendar. \"Trial of Grievance. Bearing's. The one you promised you'd 'attend'?\"\r\n\r\nYou blink, then groan. \"Right. Clan Star Adder custom. I said I'd be there as his witness.\"\r\n\r\n\"Yup,\" Darius says, nodding. \"And it starts today. Figured I'd remind you before you got elbow-deep in engine diagnostics again or decided to pick a fight with the mess hall coffee maker.\"\r\n\r\nYou sigh, standing up and grabbing your jacket. \"He's earned the presence. I wasn't going to miss it.\"\r\n\r\n\"Yeah, well, you almost did,\" Darius says, trying to sound stern but grinning all the same. \"Yang's already got a couple of the crew heading down to the proving grounds. Apparently Bearing's been going full Clan mode — stoic, silent, terrifying. Should be a show.\"\r\n\r\nYou pull on the jacket and check your wrist chrono. \"Tell Sumire to keep a shuttle warm. If Bearing wins this Trial, we might need to reassign his bunk sooner than expected.\"\r\n\r\nDarius salutes with two fingers. \"Got it. And hey — don't forget to clap dramatically when it's over. Clan warriors love that stuff.\"\r\n\r\nYou shake your head as you pass him. \"Just keep my seat warm.\"\r\n\r\n\"Spectator's seat or commander's?\" he calls after you.\r\n\r\nYou don't answer. You're already walking out the door.\"",
        "Icon" : "uixTxrSpot_AddahBearing_Reunion.png"
    },
    "Scope" : "Company",
    "Weight" : 100000,
    "Requirements" : {
        "Scope" : "Company",
        "RequirementTags" : {
            "tagSetSourceFile" : "",
            "items" : [
                "event_BearingTrial_Contract",
                "event_AddahBearing"
            ]
        },
        "ExclusionTags" : {
            "tagSetSourceFile" : "Tags/CompanyTags",
            "items" : [
                "event_BearingDown_delay",
                "event_AddahBearing_Complete",
                "event_BearingDownUpgraded",
                "hasPilot_pilot_crew_roguebotI",
                "hasPilot_pilot_crew_roguebotII",
                "hasPilot_pilot_BABearing",
                "firedPilot_pilot_BABearing",
                "killedPilot_pilot_BABearing",
                "Contract_PositionalBearing_Complete",
                "Contract_Backup_Spawn"
            ]
        },
        "RequirementComparisons" : [
            {
                "obj" : "Travel",
                "op" : "Equal",
                "val" : 0,
                "valueConstant" : "0"
            },
            {
              "obj": "RosterCapacityRemaining",
              "op": "GreaterThan",
              "val": 0,
              "valueConstant": "0"
            }
        ]
    },
    "AdditionalRequirements" : [
        {
            "Scope" : "Commander",
            "RequirementTags" : {
                "tagSetSourceFile" : "",
                "items" : []
            },
            "ExclusionTags" : {
                "tagSetSourceFile" : "",
                "items" : []
            },
            "RequirementComparisons" : [
                {
                    "obj" : "Injuries",
                    "op" : "Equal",
                    "val" : 0,
                    "valueConstant" : "0"
                }
            ]
        },
        {
            "Scope" : "StarSystem",
            "RequirementTags" : {
                "tagSetSourceFile" : "Tags/PlanetTags",
                "items" : [
                    "planet_pop_small"
                ]
            },
            "ExclusionTags" : {
                "tagSetSourceFile" : "Tags/PlanetTags",
                "items" : [
                    "planet_pop_none",
                    "planet_other_empty",
                    "planet_JumpPoint",
                    "planet_climate_lunar"
                ]
            },
            "RequirementComparisons" : []
        }
    ],
    "AdditionalObjects" : [],
    "Options" : [
        {
            "Description" : {
                "Id" : "outcome_0",
                "Name" : "Attend the Trial of Grievance",
                "Details" : "Attend Bearing's Trial of Grievance",
                "Icon" : null
            },
            "RequirementList" : [],
            "ResultSets" : [
                {
                    "Description" : {
                        "Id" : "outcome_0_0",
                        "Name" : "Bearing it",
                        "Details" : "You stand on the paved surface of the trial grounds, the faint whine of distant power generators humming beneath the low wind. The skies are iron-gray above, mirroring the tension in the air. Bearing approaches from across the field in his battle armour, Clan insignia still gleaming despite the dust and wear of his armour.\r\n\r\n\"It has been... a journey,\" he says, eyes forward visible through the open visor, as if still walking the path in his mind. \"My time with Clan Star Adder has been one of discipline, challenge — and understanding.\"\r\n\r\nYou nod, listening, arms folded. \"And now your Trial of Grievance,\" you say, tone low and steady. \"To clear your honour and obtain your bloodname.\"\r\n\r\nBearing turns his gaze to you. \"Aff. My right to the Banacek name must be earned, witnessed, and honoured.\"\r\n\r\nYou step forward, the gravel shifting beneath your boots. \"Then I'll be there,\" you say, voice firm. \"If this is what it takes to bring you back into the company, I'll see it with my own eyes.\"\r\n\r\nFor a moment, the Clan warrior's façade cracks, just slightly — a flicker of gratitude in his usually impassive expression. \"Your presence strengthens me, Commander. I fight not just for myself, but to rejoin what I left behind.\"\r\n\r\nYou nod once, extending your hand. \"You're still one of us, Bearing. You always have been. And I don't doubt for a second that you'll prove it out there.\"\r\n\r\nHe carefully clasps your forearm in the old MechWarrior's grip — resolute. \"Then it shall be done.\"\r\n\r\nYou turn to find Darius already pacing nearby, datapad in hand, clearly trying to look inconspicuous.\r\n\r\n\"Darius,\" you call out, and he perks up like you just handed him a salvage report labeled <i>urgent.</i>\r\n\r\n\"Right! Trial logistics, transport, ceremonial attendance — on it,\" he says, already tapping away at his pad. \"I'll get us viewing seats, front row.\"\r\n\r\n\"Good,\" you say, turning back to Bearing. \"Let's make sure this Trial is one the Watchers of the Council will remember.\"\r\n\r\nBearing nods deeply, voice like steel. \"They will remember, Commander. Win or lose, they will <i>know<i> my name.\"\r\n\r\n<color=#FF0000>BATTLE CONTRACT: POSITIONAL BEARING, ADDED TO COMMAND CENTER</color>",
                        "Icon" : null
                    },
                    "Weight" : 100,
                    "Results" : [
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : [
                                    "event_AddahBearing",
                                    "event_BearingTrial_Contract"
                                ]
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "Stats" : null,
                            "Actions" : [
                                {
                                    "Type" : "System_AddContract",
                                    "value" : "ThreeWayBattle_PositionalBearing",
                                    "valueConstant" : null,
                                    "additionalValues" : [
                                        "ClanStarAdder",
                                        "ClanStarAdder",
                                        null,
                                        null,
                                        "mapGeneral_terracePlaza_uTech",
                                        null,
                                        "8"
                                    ]
                                }
                            ],
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        },
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : [
                                    "Contract_Backup_Spawn"
                                ]
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "Stats" : null,
                            "Actions" : null,
                            "ForceEvents" : null,
                            "TemporaryResult" : true,
                            "ResultDuration" : 60
                        }
                    ]
                }
            ],
            "Requirements" : {
                "Scope" : "Company",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        }
    ],
    "PublishState" : "PUBLISHED",
    "ValidationState" : "UNTESTED",
    "EventType" : "NORMAL",
    "OneTimeEvent" : false,
    "Tags" : {
        "tagSetSourceFile" : "tags/EventTags",
        "items" : []
    }
}