{
  "Description": {
    "Id": "event_co_BearingDownAddahBearing",
    "Name": "Jibba Jabba",
    "Details": "The neon lights of the remote bar flickered against the dimly lit surroundings, casting an otherworldly glow over its few patrons as you sit at the counter, nursing a drink. Darius, your ever-loyal but somewhat bumbling second-in-command, fumbled with a stack of intelligence reports at the far end of the bar, his brow furrowed in concentration.\r\n\r\nAs you glance around the room, your eyes fall upon a figure leaning against the far wall, clad in the unmistakable trappings of a MechWarrior. Bearing. It had been nearly a year since he left {COMPANY.CompanyName} to embark on his personal journey for Clan Star Adder, but now there he stands, a silent sentinel.\r\n\r\nWith a nod, you motion for Bearing to join you, and he strides across the room with the confident gait of a seasoned warrior. As he approaches, you could see the weariness etched into his features, a testament to the trials he had faced during his time away.\r\n\r\n\"Commander {COMMANDER.FirstName} {COMMANDER.LastName},\" he greets with a respectful nod, his voice low and gravelly from years of battle. \"It is good to see you again.\"\r\n\r\n\"And you, Bearing,\" you reply, offering the seat next to you. \"I did not expect to find you here on  <i>{TGT_SYSTEM.Name}</i> ?\"\r\n\r\nBearing's eyes flicker with a hint of determination, \"I have nearly completed my task with Clan Star Adder,\" he explains. \"But before I can rejoin your company, I must undertake a Trial of Grievance here.\"\r\n\r\nYour eyebrows rise in surprise. \"A Trial of Grievance? Here?\" you ask as you glance around the dingy bar with a mixture of amusement and disbelief. \"Well, I suppose stranger things have happened.\"\r\n\r\nDarius, oblivious to the weight of your conversation, makes his way over to join you both, a stack of reports clutched tightly in his hands.\r\n\r\n\"Commander, I've got the latest intelligence reports right here,\" he announces proudly, before stumbling over a chair and nearly sending the papers flying.\r\n\r\nYou sigh inwardly, exchanging a knowing glance with Bearing before mustering a smile as you turn back to Darius, \"Thank you, Darius, but I think we'll hold off on that for now. We've got more pressing matters to attend to.\"",
    "Icon": "uixTxrSpot_AddahBearing_Reunion.png"
  },
  "Scope": "Company",
  "Weight": 100,
  "Requirements": {
    "Scope": "Company",
    "RequirementTags": {
      "items": [
        "firedPilot_pilot_Bearing",
        "event_BearingDown"
      ],
      "tagSetSourceFile": ""
    },
    "ExclusionTags": {
      "items": [
        "event_AddahBearing",
        "event_BearingDown_delay",
        "event_AddahBearing_Complete",
        "hasPilot_pilot_crew_roguebotI",
        "hasPilot_pilot_crew_roguebotII"
      ],
      "tagSetSourceFile": "Tags/CompanyTags"
    },
    "RequirementComparisons": [
      {
        "obj": "Travel",
        "op": "Equal",
        "val": 0,
        "valueConstant": "0"
      },
      {
        "obj": "RosterCapacityRemaining",
        "op": "GreaterThan",
        "val": 0,
        "valueConstant": "0"
      }
    ]
  },
  "AdditionalRequirements": [
    {
      "Scope": "Commander",
      "RequirementTags": {
        "items": [],
        "tagSetSourceFile": ""
      },
      "ExclusionTags": {
        "items": [],
        "tagSetSourceFile": ""
      },
      "RequirementComparisons": [
        {
          "obj": "Injuries",
          "op": "Equal",
          "val": 0,
          "valueConstant": "0"
        }
      ]
    },
    {
      "Scope": "StarSystem",
      "RequirementTags": {
        "items": [
          "planet_pop_small"
        ],
        "tagSetSourceFile": "Tags/PlanetTags"
      },
      "ExclusionTags": {
        "items": [
          "planet_pop_none",
          "planet_other_empty",
          "planet_JumpPoint",
          "planet_climate_lunar"
        ],
        "tagSetSourceFile": "Tags/PlanetTags"
      }
    }
  ],
  "AdditionalObjects": [],
  "Options": [
    {
      "Description": {
        "Id": "outcome_0",
        "Name": "Attend the Trial of Grievance",
        "Details": "Attend Bearing's Trial of Grievance"
      },
      "RequirementList": [],
      "ResultSets": [
        {
          "Description": {
            "Id": "outcome_0_0",
            "Name": "Bearing it",
            "Details": "As Bearing tells you of his time away from {COMPANY.CompanyName} and the upcoming Trial of Grievance, you nod in understanding. \"I see,\" you say thoughtfully, tapping your fingers against the rim of your glass. \"Well, if this is what you need to do before rejoining us, then I'll be there to witness it.\"\r\n\r\nBearing's expression brightens with gratitude. \"Thank you, Commander {COMMANDER.FirstName} {COMMANDER.LastName},\" he says earnestly. \"Your support means a great deal to me.\"\r\n\r\nYou offer him a reassuring smile. \"Of course, Bearing. I still consider you a part of us, after all. And I have every confidence that you'll succeed.\"\r\n\r\nWith plans now set in motion, you turn to Darius. \"Darius, make arrangements for us to attend Bearing's Trial of Grievance,\" you instruct him. \"We'll leave as soon as possible.\"\r\n\r\nDarius nods, already reaching for his datapad to coordinate the logistics. \"Consider it done, Commander,\" he replies before scurrying off to make the necessary arrangements.\r\n\r\nTurning back to Bearing, you extend your hand in a gesture of camaraderie. \"Let's make sure this Trial is one they'll never forget,\" you say with determination.\r\n\r\nBearing clasps your hand firmly in his. \"Aff, {COMMANDER.FirstName} {COMMANDER.LastName},\" he says with a nod. \"I will not let you down.\"\r\n\r\n<color=#FF0000>BATTLE CONTRACT: POSITIONAL BEARING, ADDED TO COMMAND CENTER</color>"
          },
          "Weight": 100,
          "Results": [
            {
              "Scope": "Company",
              "AddedTags": {
                "items": [
                  "event_AddahBearing",
                  "event_BearingTrial_Contract"
                ],
                "tagSetSourceFile": ""
              },
              "RemovedTags": {
                "items": [],
                "tagSetSourceFile": ""
              },
              "Actions": [
                {
                  "Type": "System_AddContract",
                  "value": "ThreeWayBattle_PositionalBearing",
                  "valueConstant": null,
                  "additionalValues": [
                    "ClanStarAdder",
                    "ClanStarAdder",
                    null,
                    null,
                    "mapGeneral_terracePlaza_uTech",
                    null,
                    "8"
                  ]
                }
              ],
              "TemporaryResult": false,
              "ResultDuration": 0
            },
            {
              "Scope": "Company",
              "AddedTags": {
                "items": [
                  "Contract_Backup_Spawn"
                ],
                "tagSetSourceFile": ""
              },
              "RemovedTags": {
                "items": [],
                "tagSetSourceFile": ""
              },
              "TemporaryResult": true,
              "ResultDuration": 60
            }
          ]
        }
      ],
      "Requirements": {
        "Scope": "Company",
        "RequirementTags": {
          "items": [],
          "tagSetSourceFile": ""
        },
        "ExclusionTags": {
          "items": [],
          "tagSetSourceFile": ""
        }
      }
    },
    {
      "Description": {
        "Id": "outcome_1",
        "Name": "Dismiss Bearing",
        "Details": "Leave Bearing here"
      },
      "RequirementList": [],
      "ResultSets": [
        {
          "Description": {
            "Id": "outcome_1_0",
            "Name": "Not Bearing it...",
            "Details": "As Bearing tells you of his time away from {COMPANY.CompanyName} and the upcoming Trial of Grievance, a weight settles in your chest. \"Bearing,\"  you begin, choosing your words carefully, \"I appreciate your dedication to Clan Star Adder and what you had to do for your own betterment, but I'm afraid things have changed in your absence.\"\r\n\r\nBearing's expression shifts, his blunt interruption takes you back. \"You no longer want my services, quineg?\" he asks, his voice tinged with a hint of anger.\r\n\r\nYou take a deep breath, steeling yourself for the difficult conversation ahead. \"You've been away for a long time, and {COMPANY.CompanyName} has undergone extensive changes,\" you explain regretfully. \"I've had to make some tough decisions, and... well, I'm afraid there's no longer a position available for you.\"\r\n\r\nBearing's eyes narrow, his fists clench, but he just stares at you for what seems like an eternity, \"Understood, {COMMANDER.FirstName} {COMMANDER.LastName}.\"\r\n\r\nYou relax slightly when you realise he is not going to lash out at you. \"I wish things were different. But circumstances have forced my hand, and...\" \r\n\r\nBearing interrupts you as he stands up, turns and walks out of the bar.\r\n\r\nDarius turns to you, \"That was not an easy choice to make, Commander.\"\r\n\r\nYou ignore Darius for stating the obvious as your gaze is locked on the slowly closing bar door, as your thoughts whirl, <i>a part of you can't help but wonder if you've made the right decision. But for better or worse, the path forward is now set, and you can only hope that Bearing will find his own way in the trials to come.</i>"
          },
          "Weight": 100,
          "Results": [
            {
              "Scope": "Company",
              "AddedTags": {
                "items": [
                  "event_AddahBearing_Complete"
                ],
                "tagSetSourceFile": ""
              },
              "RemovedTags": {
                "items": [],
                "tagSetSourceFile": ""
              },
              "TemporaryResult": false,
              "ResultDuration": 0
            }
          ]
        }
      ],
      "Requirements": {
        "Scope": "Company",
        "RequirementTags": {
          "items": [],
          "tagSetSourceFile": ""
        },
        "ExclusionTags": {
          "items": [],
          "tagSetSourceFile": ""
        }
      }
    }
  ],
  "PublishState": "PUBLISHED",
  "ValidationState": "UNTESTED",
  "EventType": "NORMAL",
  "OneTimeEvent": false,
  "Tags": {
    "items": [],
    "tagSetSourceFile": "tags/EventTags"
  }
}
