{
  "Description": {
    "Id": "event_sh_gate1_assessment",
    "Name": "MRB Assessment",
    "Details": "<color=#A8A8A8>As you are going over the dull task of keep track of the company's finances at your desk, Sumire contacts you over the intercom.</color>\n\n\"Commander, the MRB Assessor is arriving. Everyone is ready, let's do our best to persuade them.\"\n\n<color=#A8A8A8>You hurriedly stand up and head towards the docking bay, and as soon as you arrive you can see a person with a very bored look waiting for you. As you approach them they speak up before you even have a chance to fully open your mouth to greet them.</color>\n\n\"You are Commander {COMMANDER.Name} I presume? Not that I see much command going on here judging by the look of this... rustbucket\", <color=#A8A8A8>they deliver in a condescending tone with a badly hid sneer at the end.\n\nYou can feel your crew bristling behind your back, but quickly motion them to stand down. If this is how they want to play it, then so be it. You are sure of your capabilities and that you will pass the assessment, so you stay silent and simply lead the way for the assessor as they start their inspection.\n\nAfter over five hours of continuous scrutiny of everything and everyone by the Assessor, all the while constantly delivering snide comments and showing snarky behavior, they finally prepare to leave the ship. Almost as an afterthought, the Assessor glances at you right before boarding their shuttle, sighing deeply, before dropping the terse comment</color> \"I guess it will do...\".\n\n<color=#A8A8A8>Once the Assessors ship has left the vicinity of the Argo, Darius steps up next to you.</color>\n\n\"Well, that was highly unpleasant. But at least we got the approval, let's go celebrate in the canteen.\" <color=#A8A8A8>You nod and follow him towards the canteen, hoping to never have to experience such a situation again.",
    "Icon": "uixTxrSpot_DariusTalking"
  },
  "Scope": "Company",
  "Weight": 1000000,
  "Requirements": {
    "Scope": "Company",
    "RequirementTags": {
      "items": [
        "mrb_authorization_epilson_assessment"
      ],
      "tagSetSourceFile": ""
    },
    "ExclusionTags": {
      "items": [],
      "tagSetSourceFile": ""
    },
    "RequirementComparisons": []
  },
  "AdditionalRequirements": [
    {
      "Scope": "Company",
      "RequirementTags": {
        "tagSetSourceFile": "",
        "items": []
      },
      "ExclusionTags": {
        "tagSetSourceFile": "Tags/CompanyTags",
        "items": []
      },
      "RequirementComparisons": [
        {
          "obj": "Travel",
          "op": "Equal",
          "val": 0,
          "valueConstant": "0"
        }
      ]
    }
  ],
  "AdditionalObjects": [],
  "Options": [
    {
      "Description": {
        "Id": "outcome_0",
        "Name": "Assessment Passed",
        "Details": "",
        "Icon": null
      },
      "RequirementList": [],
      "ResultSets": [
        {
          "Description": {
            "Id": "outcome_0_0",
            "Name": "Epsilon Authorization Unlocked",
            "Details": "<b><color=#35dde0>Information:</b> The Argo upgrade <b>MRB Epsilon Authorization Console</b> has been unlocked. Visit the Engineering view for more details.\n\nThis upgrade enables <b>Conflict</b> and <b>Challenge</b> Contracts, which are the lower tier of Superheavy Contracts. They can still be considerably harder than normal contracts due to the large amount of advanced and superheavy units. The difficulty of the opposing forces will however scale according to the Company's difficulty rating (skulls) as per normal.\n\nBefore attempting a Conflict contract, it is recommended to have a very capable drop force able to handle sustained fighting as Superheavy units usually are considerably more durable. To make the difficulty manageable the Conflict contracts will allow increased drop tonnage based on contract difficulty, up to 1020 tons.\n\nChallenge contracts are duels, but adapted for Superheavy units. Similar to Conflict contracts it is recommended to have units focused on sustained fighting rather than fast alpha strikes.\n\nFor more information see the dedicated page to <b>Superheavy Contracts</b> on the Roguetech wiki.</color>",
            "Icon": null
          },
          "Weight": 100,
          "Results": [
            {
              "Scope": "Company",
              "Requirements": null,
              "AddedTags": {
                "tagSetSourceFile": "Tags/CompanyTags",
                "items": [
                  "mrb_authorization_epsilon"
                ]
              },
              "RemovedTags": {
                "tagSetSourceFile": "",
                "items": []
              },
              "Stats": null,
              "Actions": null,
              "ForceEvents": null,
              "TemporaryResult": false
            },
            {
              "Scope": "Commander",
              "Requirements": null,
              "AddedTags": {
                "items": [
                  "pilot_morale_low"
                ],
                "tagSetSourceFile": "Tags/PilotTags"
              },
              "RemovedTags": {
                "items": [],
                "tagSetSourceFile": ""
              },
              "Stats": null,
              "Actions": null,
              "ForceEvents": null,
              "TemporaryResult": true,
              "ResultDuration": 7
            }
          ]
        }
      ],
      "Requirements": {
        "Scope": "Company",
        "RequirementTags": {
          "tagSetSourceFile": "",
          "items": []
        },
        "ExclusionTags": {
          "tagSetSourceFile": "",
          "items": []
        },
        "RequirementComparisons": []
      }
    }
  ],
  "PublishState": "PUBLISHED",
  "ValidationState": "UNTESTED",
  "EventType": "NORMAL"
}