{
    "Description" : {
        "Id" : "forceevent_co_LRMech_AARRasalhague",
        "Name" : "To the Victor go the Spoils",
        "Details" : "Spirits are high as you arrive at the briefing room.  You move to the head of the table as everyone present takes their seats, \"Okay folks, we got the job done.  Darius, have we heard from our contact at <i>Bergan Industires</i>?\"\r\n\r\nDarius responds, \"Aye Commander.  <i>Bergan Industries</i> is extremely grateful for the assist, to the extent that they want to know if there is anything else they can do to repay us.\"\r\n\r\nYou turn to St Burt, \"So what's our next move here, MechWarrior?\"\r\n\r\nSt Burt looks at you, \"All we need now is the base <i>Minsk MNK-102</i> chassis, some AsTechs and one of their manufacturing bays to fully assemble <i>Last Rites</i>.  My contact there, <i>Alys Poole</i> should be able to facilitate this.\"\r\n\r\nYou nod at Darius, \"Please politely inform <i>Bergan Industries</i> of our needs.  Hopefully they will be grateful enough to provide us the last few bits to finish this project.  Don't forget to mention our contact, Alys.\"\r\n\r\nDarius starts typing a message into his datapad, \"Sending the request now, Commander.\"",
        "Icon" : "uixTxrSpot_LRDailyBriefing.png"
    },
    "Scope" : "Company",
    "Weight" : 10,
    "Requirements" : {
        "Scope" : "Company",
        "RequirementTags" : {
            "tagSetSourceFile" : "",
            "items" : []
        },
        "ExclusionTags" : {
            "tagSetSourceFile" : "",
            "items" : []
        },
        "RequirementComparisons" : []
    },
    "AdditionalRequirements" : [],
    "AdditionalObjects" : [
        {
            "Scope" : "SecondaryMechWarrior",
            "Requirements" : {
                "Scope" : "SecondaryMechWarrior",
                "RequirementTags" : {
                    "tagSetSourceFile" : "Tags/CompanyTags",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "Tags/CompanyTags",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        }
    ],
    "Options" : [
        {
            "Description" : {
                "Id" : "outcome_0",
                "Name" : "Contact <i>Bergan Industries</i>",
                "Details" : "Contact <i>Bergan Industries</i>",
                "Icon" : null
            },
            "RequirementList" : [
                {
                    "Scope" : "Company",
                    "RequirementTags" : {
                        "tagSetSourceFile" : "",
                        "items" : []
                    },
                    "ExclusionTags" : {
                        "tagSetSourceFile" : "",
                        "items" : []
                    },
                    "RequirementComparisons" : []
                }
            ],
            "ResultSets" : [
                {
                    "Description" : {
                        "Id" : "outcome_0_0",
                        "Name" : "Contact",
                        "Details" : "An hour later, an alert <i>pings</i> on Darius' datapad, \"Commander, we have a response from <i>Bergan Industries</i>.  They have forwarded our request to their Liaison Office.\"\r\n\r\nYou look over at Darius, \"Nothing else?  Did they at least say how long their \"Office\" will take to get back to us?\"\r\n\r\nDarius shakes his head, \"Not exactly, Commander.  I may have embellished the response a bit.\"\r\n\r\nYou throw a steel-eyed look over at Darius, \"What was the actual response?\"\r\n\r\nDarius sighs before reading the complete message out loud, \"<i>Thank you for contacting Bergan Industries.  All of our agents are currently busy helping other customers.  Please remain in system and one of our specially trained sales agents will be with as soon as they are able.</i>\"\r\n\r\nYour eyes roll back into your head as the canned auto-reply sinks in, \"St. Burt, is there anywhere else we can build your mech?\"\r\n\r\nSt Burt shakes his head, \"Neg, Commander.  The facilities here are the only ones currently making the chassis we need and finding one out there as salvage or in a shop that is in good enough condition to work with would take forever.\"\r\n\r\nYou sigh audibly, \"Very well, looks like we're hanging out in [[TGT_SYSTEM,{TGT_SYSTEM.Name}]] until they contact us.  Darius, alert me the moment they get back to us... and keep trying, who knows, maybe you'll get to actually speak to a real person.\"",
                        "Icon" : null
                    },
                    "Weight" : 100,
                    "Results" : [
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : [
                                    "event_LastRites_Final"
                                ]
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "Stats" : null,
                            "Actions" : null,
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        }
                    ]
                }
            ],
            "Requirements" : {
                "Scope" : "Company",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        }
    ],
    "PublishState" : "PUBLISHED",
    "ValidationState" : "UNTESTED",
    "EventType" : "UNSELECTABLE",
    "OneTimeEvent" : false,
    "Tags" : {
        "tagSetSourceFile" : "tags/EventTags",
        "items" : []
    }
}