{
    "Description" : {
        "Id" : "forceevent_co_LRMech_LiveFire_AAR",
        "Name" : "Oh Yeah!",
        "Details" : "<i>Last Rites</i> performed admirably in the Live Fire Exercise.  St Burt piloted the mech like it was an extension of his own body and left the targets smoking ruins.\r\n\r\nYou watch as <i>Last Rites</i> lumbers over to the contol bunker, amazed at how quick the mech is for something weighing in at 70 tons.  The mech comes to a stop and the hatch pops, St Burt clambers out to descend the ladder and you can see his grin even from where you are standing.\r\n\r\nYou look over to Alys Poole, and notice her restraining the unprofessional urge to rush over and hug St Burt, instead opting for hand shake and a subtle smile on her face.\r\n\r\n\"Amazing performance out there,\" you say to St Burt.  \"How'd it feel to get back in the saddle again?\"\r\n\r\nSt Burt can't wipe the grin off his face, \"<i>Last Rites</i> runs just as smooth as the original mech.  <i>Bergan Industries</i> did an amazing job putting it together!\"\r\n\r\nYou smile, \"Good to hear!\"  You turn towards Alys, \"Thank you for your assistance in rebuilding <i>Last Rites</i>.  It's time for us to get back out there and start making some C-Bills to keep this company afloat.\"\r\n\r\nAlys nods and smiles, \"I should thank you, Commander {COMMANDER.LastName}.  This little project has allowed Burt and I to reminisce.  Before you leave, if you are interested in making some C-Bills, we have a small job that is right up your alley.\"\r\n\r\nDarius leans closer to you, \"Commander, couldn't hurt to do a local mission before leaving [[TGT_SYSTEM,{TGT_SYSTEM.Name}]].  Of course, the decision is yours.\"",
        "Icon" : "uixTxrSpot_LRMinsk.png"
    },
    "Scope" : "Company",
    "Weight" : 10,
    "Requirements" : {
        "Scope" : "Company",
        "RequirementTags" : {
            "tagSetSourceFile" : "",
            "items" : [
                "event_LRLiveFire_Complete"
            ]
        },
        "ExclusionTags" : {
            "tagSetSourceFile" : "",
            "items" : []
        },
        "RequirementComparisons" : []
    },
    "AdditionalRequirements" : [],
    "AdditionalObjects" : [],
    "Options" : [
        {
            "Description" : {
                "Id" : "outcome_0",
                "Name" : "Time to Go",
                "Details" : "Say Goodbye to Alys",
                "Icon" : null
            },
            "RequirementList" : [],
            "ResultSets" : [
                {
                    "Description" : {
                        "Id" : "outcome_0_0",
                        "Name" : "Collect pilot and Mech",
                        "Details" : "You contemplate the option before you for a moment, \"Thank you again, Ms Poole, but alas, I must decline.  We have other places we need to be and we do not have the time right now to linger here any longer.\"\r\n\r\nAlys nods at your response and then moves over to give St Burt a long hug.  She whispers something in his ear before stepping away and turning to you, \"May all your contracts be successful, Commander.\"\r\n\r\n\"C'mon, MechWarrior, we have work to do.  Thank you again, Ms Poole.\"",
                        "Icon" : null
                    },
                    "Weight" : 100,
                    "Results" : [
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : [
                                    "event_LRFinished"
                                ]
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : [
                                    "event_LRCollection",
                                    "event_LRLiveFire"
                                ]
                            },
                            "Stats" : null,
                            "Actions" : [
                                {
                                    "Type" : "Mech_AddRoster",
                                    "value" : "mechdef_minsk_MNK-LR",
                                    "valueConstant" : null,
                                    "additionalValues" : null
                                }
                            ],
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        }
                    ]
                }
            ],
            "Requirements" : {
                "Scope" : "Company",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        },
        {
            "Description" : {
                "Id" : "outcome_1",
                "Name" : "Tell me more",
                "Details" : "Do one more job for Alys",
                "Icon" : null
            },
            "RequirementList" : [],
            "ResultSets" : [
                {
                    "Description" : {
                        "Id" : "outcome_1_0",
                        "Name" : "Last Contract",
                        "Details" : "You contemplate the option before you for a moment, \"Well, seeing as we are here anyways, may as well make some profit off it.  What do you need done?\"\r\n\r\nAlys smiles, \"Thank you, Commander.  As you know, we were under seige when you first arrived and valiantly fought off the aggressors.  We have intel suggesting that they may have returned and are preparing for another assault or other vultures in the area are preparing to attack.  We need you to hit them first.\"\r\n\r\nYou nod thoughtfully, arms crossed, \"So you need us to preemptively hit them and drive them back?\"\r\n\r\n\"We want them utterly destroyed, Commander,\" Alys practically snarls.\r\n\r\nA grin creeps across your face, \"Well, Ms Poole, that we can certainly do for you.  Anything else we need to be aware of?\"\r\n\r\nAlys responds, \"The only other info we have is that there is a possible third party that may try to sweep in and steal any salvage left on the battlefield.  Be prepared to fight for your salvage rights, Commander.\"\r\n\r\nAs everyone else head towards the exit, Alys puts a hand on your shoulder, \"Commander, I understand the chances of you returning to {SYSTEM.SystemName} are slim, but will you do your best to keep St Burt safe for me?\"\r\n\r\nYou smile reassuringly at Alys, \"I know you two are closer than appears on the surface, so I will do what I can.  But you know as well as I, as much as he cares for you, his passion is riding into battle in his mech.\"\r\n\r\nAlys smiles and nods understandly as you leave to catch up to the others.\r\n\r\n<color=#FF0000>BERGAN INDUSTRIES CONTRACT: LAST RITES, ADDED TO COMMAND CENTER</color>",
                        "Icon" : null
                    },
                    "Weight" : 100,
                    "Results" : [
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : [
                                    "event_LRFinished"
                                ]
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : [
                                    "event_LRCollection",
                                    "event_LRLiveFire"
                                ]
                            },
                            "Stats" : null,
                            "Actions" : [
                                {
                                    "Type" : "System_AddContract",
                                    "value" : "ThreeWayBattle_LastRites",
                                    "valueConstant" : null,
                                    "additionalValues" : [
                                        null,
                                        "BerganIndustries",
                                        null,
                                        null,
                                        null,
                                        null,
                                        "8"
                                    ]
                                },
                                {
                                    "Type" : "Mech_AddRoster",
                                    "value" : "mechdef_minsk_MNK-LR",
                                    "valueConstant" : null,
                                    "additionalValues" : null
                                }
                            ],
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        }
                    ]
                }
            ],
            "Requirements" : {
                "Scope" : "Company",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        }
    ],
    "PublishState" : "PUBLISHED",
    "ValidationState" : "UNTESTED",
    "EventType" : "UNSELECTABLE",
    "OneTimeEvent" : false,
    "Tags" : {
        "tagSetSourceFile" : "tags/EventTags",
        "items" : []
    }
}