{
  "ID": "faction_MagistracyOfCanopus",
  "Name": "the Magistracy of Canopus",
  "ShortName": "the Magistracy",
  "Description": "The Magistracy of Canopus is a large Periphery state, located rimward and anti-spinward of Terra, just beyond the Free Worlds League. Founded explicitly as a matriarchy, the Magistracy is ruled by a Magestrix, a position open only to women, and usually held by a member of the founding Centrella family. Independent since the fall of the Star League, the Magistracy has remained mostly untouched by the Succession Wars, except by the overall collapse of trade and travel. The Magistracy is famed for its social and cultural freedom, with no consensual behavior forbidden by law or custom. The current ruler of the Magistracy is the Magestrix Kyalla Centrella, who harbors a deep grudge against the Inner Sphere, and the Free Worlds League in particular.",
  "Demonym": "Canopian",
  "Government": "Magistracy",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake"
  ],
  "Presence": 1.5,
  "ReputationStatements": [
    "I don't know why we bother with you, mercenary. Perhaps my superiors are desperate. Regardless, they've seen fit to offer you this contract against my better judgment. Accept it or don't, it doesn't matter to me.",
    "You may be a disgrace and a scoundrel, but you're one of the only mercenaries in the area. Apparently the Magistracy has seen fit to offer you this contract despite my protests. Don't make us regret this.",
    "Commander, there's a task we need handled. While your reputation is not as positive as it could be, you're convenient and the price is right. Do this, and we'll look favorably on you in the future.",
    "Commander, I hope you are in good health. This contract may interest you—it fits your skills and the strengths of your company. With any luck, we'll both get what we want out of this job.",
    "Greetings, Commander. The Magistracy of Canopus has a task that you are well suited to perform. Accomplish this, and I'll personally ensure my superiors know about your skills.",
    "I hope you're well, my friend. We in the Magistracy need your help once again. This contract may interest you—especially the bottom line. I think you'll find our conservation more than fair.",
    "I wouldn't entrust this contract to any lesser mercenaries, Commander. You and yours are the only ones I believe are capable of handling this task. As always, I'll ensure you are richly rewarded for your hard work."
  ],
  "MissionSuccessStatements": [
    "Your performance was exemplary, Commander. I'll ensure that the Magistracy high command hears about your skills."
  ],
  "GoodFaithFailureStatements": [
    "Despite your failure, I'll make sure that high command understands you fought as hard as you were able. There's always next time, Commander."
  ],
  "BadFaithFailureStatements": [
    "Understand that we hired you with an expectation of, if not success, at least decent effort. You've shown neither, and I'm going to ensure my superiors hear about it, Commander."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_MagistracyDefaultCommander",
  "DefaultRepresentativeCastDefId": "castDef_MagistracyRepDefault",
  "DataManager": null,
  "factionID": "MagistracyOfCanopus",
  "icon": "uixTxrLogo_MagistracyOfCanopus",
  "heraldryDefId": "heraldrydef_canopus",
  "storePanelImage": "uixTxrSpot_Store-Canopus",
  "factionStorePlanetTag": "planet_other_factionhq_magistracyofcanopus",
  "factionStoreColor": "rgba(17,27,41,1.0)",
  "factionMapColor": "rgba(69,255,240,1.0)",
  "StartingReputationValues": [
    5,
    -5,
    0
  ],
  "StartingReputationModes": [
    "KAMEA_CAMPAIGN",
    "CAREER",
    "NONE"
  ],
  "MissionSuccessStatement": "Your performance was exemplary, Commander. I'll ensure that the Magistracy high command hears about your skills.",
  "GoodFaithFailureStatement": "Despite your failure, I'll make sure that high command understands you fought as hard as you were able. There's always next time, Commander.",
  "BadFaithFailureStatement": "Understand that we hired you with an expectation of, if not success, at least decent effort. You've shown neither, and I'm going to ensure my superiors hear about it, Commander."
}