{
  "ID": "faction_AuriganRestoration",
  "Name": "the Aurigan Coalition",
  "ShortName": "the Coalition",
  "Description": "The Arano Restoration is the remnant of the former Aurigan Coalition, driven from power by the treachery of Santiago Espinosa. Those still loyal to the Arano family fled into the Rimward Frontier, the expanse of unsettled systems adjoining the Magistracy of Canopus. Many noble houses of the Aurigan Directorate harbor sympathies for the Restoration and its cause: returning the Arano monarchy to power.",
  "Demonym": "Coalition",
  "Government": "Coalition",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake"
  ],
  "Presence": 2,
  "ReputationStatements": [
    "Where did we go wrong? What turned you against us? Was it money? Power? We can offer those. As far as you've drifted from us, we still know your value as a mercenary. Please, accept this offer and aid us.",
    "I mourn our friendship of old, Commander. I don't know what led you away from us, but for the sake of our old allegiance, the Restoration offers you this contract. Please… come back to us.",
    "Comrade, the Restoration would like to call upon you again. You served adequately in the past, and we entrust you with this contract in the hope that you can show us some of that old fire you once had.",
    "I know you've already done so much for us, but we need your skills, Commander. With this, we gain a great advantage for the Restoration—and you gain a payday, like always.",
    "Commander, the Restoration's fortunes rest upon your shoulders. Should you aid us in this task, both of us will be enriched by the outcomes. I hope you have the time to help us, and are willing to do so.",
    "My friend, the time is here once again: House Arano needs help, and you're the best positioned to lend it to us. We appreciate everything you've done for us, and as such we are prepared to reward you generously for your service.",
    "We've come a long way together, old friend, but I fear I have yet another favor to ask of you. Our fortunes are married together—aid us, and we will aid you, as it's always been. We would not ask this of a lesser ally."
  ],
  "MissionSuccessStatements": [
    "Excellent work, Commander. I was right to put my faith in you. You're a critical part of the Restoration effort."
  ],
  "GoodFaithFailureStatements": [
    "It wasn't a total wash, but it sure wasn't a roaring success, either. I understand that not every mission is going to be a gold-star victory, but I hope this isn't an indication of future performance."
  ],
  "BadFaithFailureStatements": [
    "I'm sorry to learn your mission was a failure, Commander. I hope that occurrences like this will be rare. If they're not, you'll probably be out of 'Mechs before too long."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_KameaDefault",
  "DefaultRepresentativeCastDefId": "castDef_KameaDefault",
  "DataManager": null,
  "factionID": "AuriganRestoration",
  "icon": "uixTxrLogo_AuriganRestoration",
  "heraldryDefId": "heraldrydef_restoration",
  "storePanelImage": null,
  "factionStoreColor": null,
  "factionMapColor": "rgba(191,41,41,1.0)",
  "StartingReputationValues": [
    100,
    0,
    0
  ],
  "StartingReputationModes": [
    "KAMEA_CAMPAIGN",
    "CAREER",
    "NONE"
  ],
  "MissionSuccessStatement": "Excellent work, Commander. I was right to put my faith in you. You're a critical part of the Restoration effort.",
  "GoodFaithFailureStatement": "It wasn't a total wash, but it sure wasn't a roaring success, either. I understand that not every mission is going to be a gold-star victory, but I hope this isn't an indication of future performance.",
  "BadFaithFailureStatement": "I'm sorry to learn your mission was a failure, Commander. I hope that occurrences like this will be rare. If they're not, you'll probably be out of 'Mechs before too long."
}