{
    "ID": "faction_ClanNovaCat",
    "Name": "Clan Nova Cat",
    "ShortName": "Nova Cat",
    "Demonym": "Nova Cat",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanNovaCat",
    "DefaultRepresentativeCastDefId": "castDef_ClanNovaCat",
    "HeraldryDefId": "heraldrydef_ClanNovaCat",
    "ReputationStatements": [
        "Freeborn, you seek only money and have no higher spiritual calling.  As much as it goes against the visions of our Oathmaster, I find myself in need of assistance in a minor task, and offer you this batchall.",
        "Freeborn, your actions go against destiny, and if you continue you will be crushed.  Take up this batchall and return to the right side of the path pre-ordained for us, before it is too late.",
        "Freeborn, we have met in combat before, and you have proved yourself moderately competent.  The Nova Cats offer you this batchall to improve our relationship.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, the Nova Cats recognize your assistance and your strength, and we would like to continue this relationship.  Perhaps this batchall will be to your liking?",
        "Freeborn, you have proven yourself a valuable servant to the Nova Cats.  We have a task that we would normally not entrust to a freeborn, but it is yours if you wish.",
        "The Nova Cats appreciate your assistance, and you have served us as well as any freeborn could be expected to.  As a symbol of our trust in you, I offer you this batchall as an equal."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  You have achieved your objectives as well as could be expected, and we have transferred the agreed c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "The Oathmaster was right to warn us against the use of mercenaries.  Take this partial payment, for your partial success, and do better next time if you wish to serve us."
    ],
    "BadFaithFailureStatements": [
        "You have failed, and have proven that such as you are weak and useless.  You will receive nothing from us save our scorn and disgust."
    ],
    "Description": "A Clan marked by their own unique brand of mysticism, the Nova Cats are guided by visions and portents, and even its Khans first consulted with the Oathmaster before undertaking any action which could affect the Clan.",
    "factionID": "ClanNovaCat",
    "icon": "uixTxrLogo_ClanNovaCat",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,0,139,1.0)"
}