{
    "ID": "faction_JarnFolk",
    "Name": "JarnFolk",
    "ShortName": "JarnFolk",
    "Demonym": "JarnFolk",
    "Government": "Janfolk",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_JarnFolk",
    "DefaultRepresentativeCastDefId": "castDef_JarnFolk",
    "HeraldryDefId": "heraldrydef_JarnFolk",
    "ReputationStatements": [
        "The JarnFolk despise you, and I would shoot you myself if you stood before me.  If you want to improve this situation, start by performing this small task for us.",
        "You have sent many JarnFolk to Valhalla, including some of my own clan.  Let us end this blood feud; assist us in this task and we will pay you well.",
        "Commander, the JarnFolk acknowledge your strength in combat.  Let us turn that to our mutual profit shall we?",
        "Welcome Commander.  The JarnFolk are a peaceful agrarian people, however there is a task that someone with your skills could assist us with.",
        "Hello again Commander.  Our past dealings have been successful, so I have another contract for your consideration.",
        "Greetings my friend.  The blood of our enemies flows freely by your hand, and we have another target for you.",
        "Come, let us discuss the next target we wish you to go a viking against.  Odin will have a place at his table for you my friend!"
    ],
    "MissionSuccessStatements": [
        "You fight with the strength of Thor, Commander!  Well done, payment is being transferred as we speak."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we really required the primary objective to be completed, but I suppose I can provide a partial payment for what you did achieve."
    ],
    "BadFaithFailureStatements": [
        "What sort of whelp are you that runs from battle?  Do you not want to feast in Valhalla?  Begone, before I kill you myself."
    ],
    "Description": "The JarnFolk (literally 'Iron People') are a society of deep Periphery denizens residing approximately 250 light years spinward of Columbus.  They live a primarily agrarian lifestyle.",
    "factionID": "JarnFolk",
    "icon": "uixTxrLogo_JarnFolk",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,204,51,1.0)"
}