{
    "ID": "faction_ClanCoyote",
    "Name": "Clan Coyote",
    "ShortName": "Coyote",
    "Demonym": "Coyote",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "factionID": "ClanCoyote",
    "icon": "uixTxrLogo_ClanCoyote",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(160,82,45,1.0)",
    "DefaultCombatLeaderCastDefId": "castDef_ClanCoyote",
    "DefaultRepresentativeCastDefId": "castDef_ClanCoyote",
    "HeraldryDefId": "heraldrydef_ClanCoyote",
    "ReputationStatements": [
        "Freeborn, you seek only money and have no morality.  If all in the Inner Sphere are like you, then perhaps our spirit guides were wrong to ask us to protect those Kerensky left behind.  Take this batchall, and show us that you treasure the gifts of your ancestors.",
        "Freeborn, the spirits of the Coyote Clan are displeased with you.  Take up this batchall if you do not wish to anger us further.",
        "Freeborn, we have met in combat before, and you have proved yourself moderately competent.  The Coyote Clan offers you this batchall to appease the spirits of those who have fallen, and to improve our relationship.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, The Coyote recognizes your assistance and your strength, and we would like to continue this relationship.  Perhaps this batchall will be to your liking?",
        "Warrior, you have proven yourself a valuable servant to the Coyote Clan.  We have a task that we would normally not entrust to a freeborn, but it is yours if you wish.",
        "The Coyote hunts with you, and you have served us as well as any freeborn could be expected to.  As a symbol of our trust in you, I offer you this batchall as an equal."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  You have achieved your objectives as well as any of my pack, and we have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "The Coyote Clan expects more from those who serve it, however we should not have expected you to be able to hunt as we do.  Take this partial payment, and may the spirit of the Coyote help you to perform better next time."
    ],
    "BadFaithFailureStatements": [
        "You have failed, and have proven even our sibko can hunt better than a freeborn.  You will receive nothing from us save our scorn and disgust."
    ],
    "Description": "The Coyote Clan was responsible for the invention of the OmniMech and is one of the strongest of the Warden Clans. The Coyotes were also known for their mystical beliefs, based on native American religious practices."
}