{
    "ID": "faction_ClanCloudCobra",
    "Name": "Clan Cloud Cobra",
    "ShortName": "Cloud Cobra",
    "Demonym": "Cloud Cobra",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "factionID": "ClanCloudCobra",
    "icon": "uixTxrLogo_ClanCloudCobra",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(123,104,238,1.0)",
    "DefaultCombatLeaderCastDefId": "castDef_ClanCloudCobra",
    "DefaultRepresentativeCastDefId": "castDef_ClanCloudCobra",
    "HeraldryDefId": "heraldrydef_ClanCloudCobra",
    "ReputationStatements": [
        "Freeborn heathen, you lack both faith and honour, however we have a task that is beneath even our solahma units that you might bid on if you wish to redeem yourself.",
        "Freeborn heathen, we know you only worship money as the Dark Caste do.  This is not The Way, but we have a task for you that will allow you to obtain the credits you so desperately seek.",
        "Freeborn, we have met in combat before, and you have proven yourself moderately competent, if faithless.  Return to The Way, and take up this batchall against our foes",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, we have seen that you respect The Way, and we would like to continue this relationship.  Perhaps this batchall will be to your liking?",
        "You do God's work, and have shown yourself to be a capable warrior.  We have a task that we would normally not entrust to a freeborn, but it is yours if you wish.",
        "The Way has brought you back to us, dear friend.  In different times I might suggest you undergo The Blooding so that you might become one with us, but for now, I offer you this batchall as an equal."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  You have achieved your objectives as well as any Warrior-Priest, and we have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "The Way teaches us that we should not expect others to be as proficient in battle as we are.  Take this partial payment, and pray to God that you might perform better next time."
    ],
    "BadFaithFailureStatements": [
        "You have failed.  You do not follow The Way, you have no honour, and God has averted his eyes from you.  I suggest you meditate on your failures and pray for forgiveness before you contact us again."
    ],
    "Description": "The only Clan defined by its incorporation of organized religions, Clan Cloud Cobra's warrior-priests are organized into Cloisters and dedicated themselves to an overarching concept known as The Way.  Clan Cloud Cobra are one of the Warden Clans, who seek to preserve the inner sphere."
}