{
    "ID": "faction_Hanse",
    "Name": "Hanseatic League",
    "ShortName": "Hanse",
    "Demonym": "Hansian",
    "Government": "League",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Hanse",
    "DefaultRepresentativeCastDefId": "castDef_Hanse",
    "HeraldryDefId": "heraldrydef_Hanse",
    "ReputationStatements": [
        "Commander, you have constantly been a thorn in the side of the Hanseatic League's desire for mutually profitable trade.  However, if you desire C-Bills so badly, we do have this contract you can undertake.",
        "Commander, your attacks against the Hanseatic League have done little to engender trust between us; perhaps we can reverse this trend with this contract?",
        "Commander, the Hanseatic League is a mercantile alliance; we are traders.  Rather than attack us, let us work together for mutual benefit.",
        "Greetings Commander.  The Hanseatic League has a task requiring a lance of mercenaries such as yours, shall we negotiate on a payment for your services?",
        "Greetings again Commander.  The Hanseatic League once again have a small matter you can assist with, if you would care to negotiate a mutually agreeable payment?",
        "Hello again, friend of the Hanseatic League.  I have kept this profitable contract aside in hopes of meeting with you, shall we discuss it further?",
        "Greetings my trusted friend.  We have both profited greatly from our past dealings, so much so that I have this one task that I will pay you handsomely if you can complete for me."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this contract will benefit us greatly, and we have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "You are aware that a fulfilling a contract requires you to complete the primary objective?  In the spirit of good faith, we will provide a partial payment this time, please don't let it happen again."
    ],
    "BadFaithFailureStatements": [
        "Do you have any idea how much your failure will cost the Hanseatic League, and myself personally?  Leave, and don't return until you are capable of completing a contract!"
    ],
    "Description": "The Hanseatic League is a mercantile faction located in the Deep Periphery.  Mercenaries are welcome, and the overall technological level of their defence forces is equal to any faction in the Inner Sphere.",
    "factionID": "Hanse",
    "icon": "uixTxrLogo_Hanse",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,242,13,1.0)"
}