{
    "ID": "faction_ClanSmokeJaguar",
    "Name": "Clan Smoke Jaguar",
    "ShortName": "Smoke Jaguar",
    "Demonym": "Smoke Jaguar",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanSmokeJaguar",
    "DefaultRepresentativeCastDefId": "castDef_ClanSmokeJaguar",
    "HeraldryDefId": "heraldrydef_ClanSmokeJaguar",
    "ReputationStatements": [
        "I presume you wish to try and make amends for your past actions before I kill you.  Very well, here is a task I would normally give to a Star of sibkos, do not fail.",
        "Freeborn scum, I needn't remind you that you have fought the Smoke Jaguars before.  If you wish to begin to right the wrongs of the past, take this batchall before I assign it to a solahma unit.",
        "Freeborn mercenary, the Smoke Jaguars have faced you in battle before.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Smoke Jaguars in the past.  Continue to be useful by taking up this batchall and we might continue this relationship.",
        "Freeborn, I must admit I am warming to you, as you have proven yourself to be useful to the Smoke Jaguars.  We offer you this batchall in recognition of your service.",
        "Greetings freeborn.  You have helped the Smoke Jaguars greatly, and in recognition of your service, I offer you this batchall I had reserved for our own warriors."
    ],
    "MissionSuccessStatements": [
        "You have succeeded Commander.  The completion of this batchall pleases me, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "I should never have entrusted such a trivial task to an incompetent freeborn mercenary!  It is only my honour that compels me to provide this partial payment for failing to complete all the tasks asked."
    ],
    "BadFaithFailureStatements": [
        "Your cowardice is as much as I expect from a Freeborn. Your lack of honour deserves far more than a lack of payment."
    ],
    "Description": "Clan Smoke Jaguar was among the most aggressive and warlike of the Clans, even at the expense of more peaceful endeavors, and were early supporters of the Crusader philosophy.  They are noted for repressing anyone but their own Warrior Caste.",
    "factionID": "ClanSmokeJaguar",
    "icon": "uixTxrLogo_ClanSmokeJaguar",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(128,0,0,1.0)"
}