{
    "ID": "faction_ClansGeneric",
    "Name": "Clans",
    "ShortName": "Clans",
    "Demonym": "Clan",
    "Government": "Clans",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClansGeneric",
    "DefaultRepresentativeCastDefId": "castDef_ClansGeneric",
    "HeraldryDefId": "heraldrydef_ClansGeneric",
    "ReputationStatements": [
        "Mercenary, we understand that you have found fighting against the Clans profitable in the past, and would like to change your thoughts with this batchall.",
        "Mercenary, you have fought well against the Clans in the past.  We would like to employ your skills in a task that furthers the Clans goals, and so we offer you this batchall.",
        "Commander, the Clans have faced you in battle before, and you have proven yourself competent.  Take up this batchall and let us work together in a mutually beneficial way.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Commander, you have assisted the the Clans adequately in the past.  Before we take this relationship further, we need you to perform a task for the Clans.",
        "Commander, you have served us admirably in the past.  I offer you this batchall knowing you will perform as well as any of our commanders.",
        "Commander, the Clans regard you as one of their own. I have kept this task for you, and would trust no one else to succeed."
    ],
    "MissionSuccessStatements": [
        "Well done Commander. Know that the Clans recognize your service, and I have transferred the agreed payment to your account."
    ],
    "GoodFaithFailureStatements": [
        "We expect all the tasks assigned to be completed freeborn.  However, we recognize your attempt, and provide a partial payment for your partial completion of the tasks."
    ],
    "BadFaithFailureStatements": [
        "You have failed, and this failure sets back our plans.  Don't expect payment, as none will be provided."
   ],
    "Description": "The Clans were originally descended from the self-exiled remnants of the Star League Defense Force (SLDF), who had departed the Inner Sphere after Stefan Amaris brought about the downfall of the Star League. General Aleksandr Kerensky led his forces to a hidden destination far from the Great Houses.  Aleksandr's son Nicholas Kerensky took command of the exiles, reorganizing them into twenty Clans of warriors leading and protecting their attendant civilian castes",
    "factionID": "ClansGeneric",
    "icon": "uixTxrLogo_ClansGeneric",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(220,20,60,1.0)"
}