{
    "ID": "faction_ClanJadeFalcon",
    "Name": "Clan Jade Falcon",
    "ShortName": "Jade Falcon",
    "Demonym": "Jade Falcon",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanJadeFalcon",
    "DefaultRepresentativeCastDefId": "castDef_ClanJadeFalcon",
    "HeraldryDefId": "heraldrydef_ClanJadeFalcon",
    "ReputationStatements": [
        "Inner Sphere barbarian, if I had so much as a sibko unit nearby, I'd have them perform this task instead of you.  However, if you value your c-bills so highly, take this batchall quickly before I change my mind.",
        "Barbarian, your presence offends me as you have fought against the Jade Falcons on many occasions.  If I had a solahama unit available, I would call upon them for this task, but as they are busy, take this batchall if you wish.",
        "Barbarian, the Jade Falcons have faced you in battle before, and you are a competent, if dishonorable warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Barbarian, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Inner Sphere Freeborn, you have assisted the Jade Falcons in the past.  Continue to be useful by taking up this batchall and we might continue this relationship.",
        "Freeborn, I must admit I am surprised you have been so useful to the Jade Falcons.  We offer you this batchall in recognition of your service.",
        "Greetings my Freeborn friend.  You have helped me so often, I am beginning to change my views on those of the Inner Sphere.  I have this choice task for you that should benefit us both greatly."
    ],
    "MissionSuccessStatements": [
        "You have succeeded Commander.  The completion of this batchall pleases me, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "I should never have entrusted such a trivial task to one so incompetent!  However I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "Your cowardice is as much as I expect from Inner Sphere scum.  We have nothing further to discuss, unless you wish to make yourself my bondsman as payment for your failing!"
    ],
    "Description": "Staunch traditionalists and aggressive fighters, the Jade Falcons were central in the creation of the Crusader philosophy. They live by the mantra 'might makes right'",
    "factionID": "ClanJadeFalcon",
    "icon": "uixTxrLogo_ClanJadeFalcon",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(154,205,50,1.0)"
}