{
    "ID": "faction_Ives",
    "Name": "St. Ives Compact",
    "ShortName": "St. Ives",
    "Demonym": "St. Ives",
    "Government": "Compact",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Ives",
    "DefaultRepresentativeCastDefId": "castDef_Ives",
    "HeraldryDefId": "heraldrydef_Ives",
    "ReputationStatements": [
        "You have done more to undermine the existence of the St Ives Compact than the Capellan Federation has since we left!  Please reverse this trend by agreeing to this contract.",
        "Commander, I am curious as to why you have fought so often against us in the past.  If it was just for money, I can assure you that the St Ives Compact is equally capable of paying for your services, such as for this task.",
        "Commander, the St Ives Compact is a friendly place, and I wonder how we got off on the wrong foot.  Let us put the past behind us, and agree to suitable terms for this contract.",
        "Welcome Commander.  The St Ives Compact requires the services of a competent lance of 'mechs, shall we discuss how you wish to be paid?",
        "Hello again Commander.  Our past dealings have been successful, so I have another contract for your consideration.",
        "Greetings my friend.  The St Ives Compact appreciates all the help you have given us, and we would like to offer you this contract by way of thanks.",
        "If it's not the Hero of the St Ives Compact!  I trust you like no other, and having said that I have a task I would entrust to no other.  Shall we discuss payment?"
    ],
    "MissionSuccessStatements": [
        "Thank you for your services Commander.  The St Ives Compact has transferred the agreed payment into your account, and we hope to have further work for you soon."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we really required the primary objective to be completed, but I suppose I can provide a partial payment for what you did achieve."
    ],
    "BadFaithFailureStatements": [
        "Commander, I don't know what happened, but we can't pay you when you completely fail the mission.  I hope this never happens again, for everyone's sake."
    ],
    "Description": "The St. Ives Compact was a minor Inner Sphere nation that existed from 3029 to 3063.",
    "factionID": "Ives",
    "icon": "uixTxrLogo_Ives",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,105,180,1.0)"
}