{
    "ID": "faction_ClanStarAdder",
    "Name": "Clan Star Adder",
    "ShortName": "Star Adder",
    "Demonym": "Star Adder",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanStarAdder",
    "DefaultRepresentativeCastDefId": "castDef_ClanStarAdder",
    "HeraldryDefId": "heraldrydef_ClanStarAdder",
    "ReputationStatements": [
        "Mercenary commander, your actions against the Star Adders has gone against our strategic plans numerous times in the past.  Let us reverse this trend by you taking up this batchall.",
        "Commander, you have fought well against us in the past.  Perhaps you can work with us towards our strategic goals instead, by taking up this batchall?",
        "Freeborn, the Star Adders have faced you in battle before, and you are a competent warrior.  Let us work together instead, take up this batchall and we can both benefit.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Star Adders adequately in the past.  Let us continue this partnership, by you performing this task towards our long term strategic goals.",
        "Commander, you have served us admirably in the past.  I offer you this batchall knowing you will perform as well as any of our Trueborn commanders.",
        "Commander, the Star Adders regard you as one of our own. I have kept this task for you, and would trust no one else to succeed."
    ],
    "MissionSuccessStatements": [
        "Well done Commander. Know that the Star Adders recognize your service, and I have transferred the agreed payment to your account."
    ],
    "GoodFaithFailureStatements": [
        "We expect all the tasks assigned to be completed freeborn.  However, we recognize your attempt, and provide a partial payment for your partial completion of the tasks."
    ],
    "BadFaithFailureStatements": [
        "You have failed, and this failure sets back our strategic plans for this system.  Don't expect payment, as none will be provided."
    ],
    "Description": "A conservative Clan, the Star Adders are known for their pragmatism and their strategic (rather than tactical) view towards battle, as well as treating freeborns that proved themselves as equals. ",
    "factionID": "ClanStarAdder",
    "icon": "uixTxrLogo_ClanStarAdder",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,0,255,1.0)"
}