{
    "ID": "faction_Chainelane",
    "Name": "Chainelane Isles",
    "ShortName": "Chainelane",
    "Demonym": "Chainelanian",
    "Government": "TODO",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "factionID": "Chainelane",
    "icon": "uixTxrLogo_Chainelane",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(50,205,50,1.0)",
    "DefaultCombatLeaderCastDefId": "castDef_Chainelane",
    "DefaultRepresentativeCastDefId": "castDef_Chainelane",
    "HeraldryDefId": "heraldrydef_Chainelane",
    "ReputationStatements": [
        "Commander, you have already crushed our armed forces beneath the feet of your 'Mechs.  Please, if you want credits, we are quite capable of paying for you to fight for us instead of against!",
        "Commander, we are unable to compete against your mighty 'Mechs.  Please, take on this contract and spare us further damage!",
        "Commander, you have proven we are no match for your 'Mechs.  Please help us to regain power in this area by taking up this task for us, and we will pay you well.",
        "Commander, I hear you have 'Mechs in your dropship?  If so, we would like to contract you to undertake a task for us, one we will both find profit in.",
        "Commander, you have assisted us in the past, and I hope that we can come to an arrangement regarding another task we would like you to perform.",
        "Hello again Commander.  Your 'Mechs are a force to be reckoned with, and we would like to contract you to perform another task for us.",
        "Greetings my dear friend.  You and your 'Mechs have aided us so often in the past, when this highly profitable contract came up I saved it just for you."
    ],
    "MissionSuccessStatements": [
        "Thank you Commander, you have crushed the enemy with your mighty 'Mechs.  Payment for your help has already been transferred to your account."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we expected more from you seeing as you had a full lance of 'Mechs.  However, you did complete some of the tasks required, so I have transferred a partial payment."
    ],
    "BadFaithFailureStatements": [
        "Seriously Commander, my armies perform tasks like this all the time, with nothing but tanks and infantry; and you and your 'Mechs failed!  You must not have tried, and I won;t pay you anything!"
    ],
    "Description": "The Chainelane Isles is not a unified realm, but rather a collection of waring planet-states and minor principalities fighting with mostly pre-mech tech."
}