{
    "ID": "faction_ClanDiamondShark",
    "Name": "Clan Diamond Shark",
    "ShortName": "Diamond Shark",
    "Demonym": "Diamond Shark",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanDiamondShark",
    "DefaultRepresentativeCastDefId": "castDef_ClanDiamondShark",
    "HeraldryDefId": "heraldrydef_ClanDiamondShark",
    "ReputationStatements": [
        "Freeborn, you have constantly been a thorn in the side of Clan Diamond Shark's desire for mutually profitable trade.  However, if you desire C-Bills so badly, perhaps we could allow you to take up this minor task.",
        "Freeborn, the basic premise of trade requires at least a modest level of trust.  So far, you have done little to engender that trust; perhaps this batchall will reverse this.",
        "Freeborn, we have met in combat before, and you have proved yourself a moderately competent warrior, if somewhat blind to the concept of mutual profit.  We have a batchall for you that would allow us to move towards a better relationship.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, we have both profited from our dealings in the past, let us continue this with this batchall.",
        "Hello again, friend to the Diamond Sharks.  We offer you this choice batchall in recognition of our friendship, and mutual profitability.",
        "Greetings my trusted friend.  We have both benefited greatly from our association, and I offer this batchall to you as I would a fellow Warrior-Trader, in the spirit of our brotherhood."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit us greatly, and we have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "You are aware that successful trade requires both sides to honour the terms of the batchall?  We are disappointed that you could not complete the objectives, however we offer this partial payment for your partial completion."
    ],
    "BadFaithFailureStatements": [
        "You have failed to honour the terms of the batchall in any significant way.  You receive nothing from us, and know that your failure will affect our trade relationship in future."
    ],
    "Description": "Originally known as Clan Sea Fox, and often referred to as the Merchant Clan, the Diamond Sharks were among the most powerful and progressive of the Warden Clans.",
    "factionID": "ClanDiamondShark",
    "icon": "uixTxrLogo_ClanDiamondShark",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,255,255,1.0)"
}