{
    "ID": "faction_ClanIceHellion",
    "Name": "Clan Ice Hellion",
    "ShortName": "Ice Hellion",
    "Demonym": "Ice Hellion",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanIceHellion",
    "DefaultRepresentativeCastDefId": "castDef_ClanIceHellion",
    "HeraldryDefId": "heraldrydef_ClanIceHellion",
    "ReputationStatements": [
        "Sadly I don't have Hellions nearby for this trivial batchall, so I am forced to rely on scum like you.  Take this task, or I will find another.",
        "Freeborn, your presence offends me as you have fought against the Ice Hellions on many occasions.  If I had a solahama unit available, I would call upon them for this task, but as they are busy, take this batchall if you wish.",
        "Freeborn, the Ice Hellions have faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Ice Hellions in the past.  Continue to be useful by taking up this batchall and we might continue this relationship.",
        "Freeborn, I must admit I am surprised you have been so useful to the Ice Hellions.  We offer you this batchall in recognition of your service.",
        "Greetings my Freeborn friend.  You have helped me so often, I am beginning to change my views on those of the Inner Sphere.  I have this choice task for you that should benefit us both greatly."
    ],
    "MissionSuccessStatements": [
        "You have succeeded Commander.  The completion of this batchall pleases me, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "I should never have entrusted such a trivial task to one so incompetent!  However I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "Your cowardice is as much as I expect from a Freeborn, for you have failed to honour the terms of the batchall in any significant way.  One day the Ice Hellions will strike you down for this."
    ],
    "Description": "A fierce, quick-handed Clan bordering on reckless, the Ice Hellion Clan often grasped for prizes beyond their reach and could be their own worst enemy. Ice Hellion warriors prized the ability to strike first above other considerations.",
    "factionID": "ClanIceHellion",
    "icon": "uixTxrLogo_ClanIceHellion",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(176,196,222,1.0)"
}