{
    "ID": "faction_ClanHellsHorses",
    "Name": "Clan Hell's Horses",
    "ShortName": "Hell's Horses",
    "Demonym": "Hell's Horses",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanHellsHorses",
    "DefaultRepresentativeCastDefId": "castDef_ClanHellsHorses",
    "HeraldryDefId": "heraldrydef_ClanHellsHorses",
    "ReputationStatements": [
        "I normally don't look down on Freeborn such as you, but your repeated actions against Hell's Horses have made me question whether I should hold you all in disdain.  Take up this batchall and prove to me that Freeborn such as you are useful.",
        "Freeborn, you have fought against Hell's Horses on many occasions.  Prove you can assist as well as cause harm by performing this task, and we might have further use for you.",
        "Freeborn, my Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Hell's Horses in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to the Hell's Horses clan.  We offer you this batchall in recognition of our friendship, and in the hopes that we can benefit each other in future.",
        "Greetings my friend.  You have helped me so often, I feel we should discuss the possibility of you joining the Horses yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit us both, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "While Hell's Horses value swiftness, we don't value those who run from battle!  However I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "Your cowardice dishonors you, and you have failed to honour the terms of the batchall in any significant way.  You receive nothing from me, other than my disdain."
    ],
    "Description": "Known for their prominent use of combat vehicles in front-line forces, the Hell's Horses lived by the motto that man came before machine and all members were valued as being part of a greater whole, including freebirths.",
    "factionID": "ClanHellsHorses",
    "icon": "uixTxrLogo_ClanHellsHorses",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(139,0,0,1.0)"
}