{
  "ID": "faction_Marik",
  "Name": "the Free Worlds League",
  "ShortName": "Marik",
  "Description": "The Free Worlds League is one of the five Successor States of the Star League, located rimward and anti-spinward of Terra. Ruled by House Marik, the League was, with the Capellan Confederation, one of the original signatories of the treaties that would eventually form the Star League. After the fall of the Star League, the Free Worlds League granted broad control over its economy and government to the commander of its military, the Captain-General. The League is known for being a powerful mercantile state, but the Succession Wars have nearly destroyed its economy. The current ruler of the League is Captain-General Janos Marik.",
  "Demonym": "Marik",
  "Government": "League",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake"
  ],
  "Presence": 1,
  "ReputationStatements": [
    "I don't know why we bother offering you contracts, to be perfectly honest. It's obvious you're not a friend to the Free Worlds League. Regardless, we find ourselves in desperate times, so we have to scrape the bottom of the barrel.",
    "Greetings, mercenary. Lowly and despicable though you may be, you may yet serve our interests. Finish this job, and we may look upon you with more favor than you likely deserve.",
    "The Free Worlds League has a use for mercenaries like you, Commander. I think you'll be interested in the attached contract. Hopefully we can come to a mutually beneficial agreement.",
    "The Free Worlds League would like to offer you a choice contract, Commander. As the leader of a respected mercenary company, you should find the terms both fair and equitable, I think.",
    "Commander, I hope this message finds you well. The people of the Free Worlds League would like to extend a contract to you, owing to our respect for your skills. Please consider it carefully.",
    "Greetings, my friend. This contract is not one we would offer to a lesser mercenary, but you've proven your loyalty, prowess, and dedication to the ideals of the Free Worlds League. I hope you'll accept our offer.",
    "We both know the score, Commander. House Marik relies on you like you're one of our own, and you've always been happy to help us out. I hope you can see fit to agree this time as well—this is a job too important for lesser warriors."
  ],
  "MissionSuccessStatements": [
    "Top-tier work, Commander—House Marik is very happy with your performance. Keep it up, and I'll make sure a lot more work comes your way."
  ],
  "GoodFaithFailureStatements": [
    "The Free Worlds League understands that sacrifice on the battlefield doesn't always translate to victory. You've made a fine effort, even if it failed. Just another lesson for the next battle."
  ],
  "BadFaithFailureStatements": [
    "We are deeply disappointed in your performance, Commander. Your efforts on the battlefield were those of a raw cadet, not the leader of a mercenary company."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_MarikDefaultCommander",
  "DefaultRepresentativeCastDefId": "castDef_MarikRepDefault",
  "DataManager": null,
  "factionID": "Marik",
  "icon": "uixTxrLogo_Marik",
  "heraldryDefId": "heraldrydef_marik",
  "storePanelImage": "uixTxrSpot_Store-Marik",
  "factionStorePlanetTag": "planet_other_factionhq_marik",
  "factionStoreColor": "rgba(35,24,37,1.0)",
  "factionMapColor": "rgba(200,146,255,1.0)",
  "StartingReputationValues": [
    -5,
    -10,
    0
  ],
  "StartingReputationModes": [
    "KAMEA_CAMPAIGN",
    "CAREER",
    "NONE"
  ],
  "MissionSuccessStatement": "Top-tier work, Commander—House Marik is very happy with your performance. Keep it up, and I'll make sure a lot more work comes your way.",
  "GoodFaithFailureStatement": "The Free Worlds League understands that sacrifice on the battlefield doesn't always translate to victory. You've made a fine effort, even if it failed. Just another lesson for the next battle.",
  "BadFaithFailureStatement": "We are deeply disappointed in your performance, Commander. Your efforts on the battlefield were those of a raw cadet, not the leader of a mercenary company."
}