{
    "ID": "faction_ClanSteelViper",
    "Name": "Clan Steel Viper",
    "ShortName": "Steel Viper",
    "Demonym": "Steel Viper",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanSteelViper",
    "DefaultRepresentativeCastDefId": "castDef_ClanSteelViper",
    "HeraldryDefId": "heraldrydef_ClanSteelViper",
    "ReputationStatements": [
        "Inner Sphere lowlife, your stupid and dishonorable actions in the past are well known.  I have a trivial task for you if you wish to find a place in the universe after the Steel Vipers conquer it.",
        "Freeborn scum, you have used your dishonorable ways to defeat us in the past.  If you wish to be something other than a slave after the Steel Vipers take over the Inner Sphere, you will take up this batchall, and succeed.",
        "Freeborn mercenary, the Steel Vipers have faced you in battle before.  Learn from your mistake and take up this batchall if you wish to serve us in the future.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Steel Vipers in the past.  Continue to be useful by taking up this batchall and you may find a place in our forces once the Inner Sphere is ours.",
        "Freeborn warrior, you have served us adequately in the past.  I offer you this batchall so that you may continue to serve as you should.",
        "Freeborn commander, your skill in martial matters is unusual for a non-trueblood. I have kept this task for you, and would trust no one else outside of the Steel Vipers to succeed."
    ],
    "MissionSuccessStatements": [
        "I am pleasantly surprised that you completed all the tasks assigned to you.  Know that the Steel Vipers recognize your service, and I have transferred the agreed payment to your account."
    ],
    "GoodFaithFailureStatements": [
        "I should not have expected a freeborn to perform as well as a Trueborn warrior.  However, you did partially complete the tasks assigned, so under the terms of the bathcall I am honour bound to provide a partial payment."
    ],
    "BadFaithFailureStatements": [
        "Your cowardice is typical of a freeborn.  Leave now, before I kill you myself for your dishonor."
    ],
    "Description": "The Steel Vipers had the toughest training regime of any Clan save the Blood Spirits, graduating fewer but more elite warriors, and were more discriminating against freebirths than other Clans.",
    "factionID": "ClanSteelViper",
    "icon": "uixTxrLogo_ClanSteelViper",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,255,127,1.0)"
}