{
    "ID": "faction_Delphi",
    "Name": "New Delphi Compact",
    "ShortName": "New Delphi",
    "Demonym": "New Delphian",
    "Government": "Compact",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Delphi",
    "DefaultRepresentativeCastDefId": "castDef_Delphi",
    "HeraldryDefId": "heraldrydef_Delphi",
    "ReputationStatements": [
        "Commander, your constant desire to take up contracts against our poor nearly defenseless worlds is going to end up with the genocide of our society!  Please help us with this small task, and save our children from slavery.",
        "Commander, the New Delphi Compact are but a few small planets desperately wishing to remain independent.  Please stop fighting against us, and instead help us with this task.",
        "Commander, if you have been attacking the planets of the New Delphi Compact for money, we can offer you similar contracts that will preserve our independence, and I beg you to consider this one.",
        "Welcome to the New Delphi Compact, Commander.  I have a task for you to undertake, if you would like to help preserve our independence.  You will of course be adequately compensated for your efforts.",
        "Thank you again for your help in protecting the New Delphi Compact's independence, Commander.  We would like to employ you once more to defend our sovereignty and independence, if you are able?",
        "Welcome friend of the New Delphi Compact.  You have helped us many times in the past, and hope you can take on this contract to assist us in preserving our independence once more.",
        "The Oracle speaks highly of you, saviour of the New Delphi Compact.  You have done so much for us I feel embarrassed to ask for your help again, however I assure you that you will be well paid for your efforts."
    ],
    "MissionSuccessStatements": [
        "Thank you Commander, we would be lost without you.  Payment for your help has already been transferred to your account."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we appreciate all the help you can provide, but we are not wealthy enough to pay you in full for a partial completion of the contract."
    ],
    "BadFaithFailureStatements": [
        "Commander, the children of the New Delphi Compact are being enslaved as we speak due to your inability to complete this task.  Please don't harm our relationship further by seeking payment."
    ],
    "Description": "Little is known about the New Delphi Compact, apart from the capital being New Delphi.  This area will probably be quickly absorbed into a nearby faction anyway, so it's almost certainly not worth your trouble.",
    "factionID": "Delphi",
    "icon": "uixTxrLogo_Delphi",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,128,0,1.0)"
}