{
    "ID": "faction_Republic",
    "Name": "Republic of the Sphere",
    "ShortName": "Republic",
    "Demonym": "Republican",
    "Government": "Republic",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "Valkyrate",
		"WordOfBlake",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_LocalsDefault",
    "DefaultRepresentativeCastDefId": "castDef_LocalsDefault",
    "HeraldryDefId": "heraldrydef_Republic",
    "ReputationStatements": [
		"We have a job for you, Commander. Let's hope you're not as much of a disappointment this time.",
		"Even if you only work for profit and salvage, you seem effective enough. The Republic has need of your skills, Commander.",
		"The Council would like me to offer you a choice contract, Commander. As the leader of a respected mercenary company, you should find the terms both fair and equitable.",
		"Hello, Commander. We value this relationship, and so we would like to offer you first right of refusal on this contract. The job is simple, and the pay adequate. We know it to be within your capabilities as well.",
		"Maintaining the Republic requires Warriors of Skill and Honor, Commander, and you fit the bill nicely.",
		"Hail Commander.  You have proven to be quite a friend to the Republic. As a result the Council has saved this contract as reward for your services.",
		"Honored friend! The Exarch has not forgotten your contributions to the Republic. In light of this, we present you with this choice contract."
    ],
    "MissionSuccessStatements": [
        "Excellent work, Commander. You have our gratitude and your reward is on its way."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we understand the efforts you expended in attempting to achieve the goals of this mission. We're not upset, just disappointed."
    ],
    "BadFaithFailureStatements": [
        "Holding the Republic together is hard work, mercerary; we don't have time to hold your hand through contracts like this one. Don't fail us again."
    ],
    "Description": "The Republic of the Sphere is the buffer state created in the wake of the Word of Blake Jihad. Keeping the peace in the heart of the Inner Sphere is no small task.",
    "factionID": "Republic",
    "icon": "uixTxrLogo_Republic",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,187,71,1.0)"
}