{
    "ID": "faction_Lothian",
    "Name": "Lothian League",
    "ShortName": "Lothia",
    "Demonym": "Lothian",
    "Government": "League",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Lothian",
    "DefaultRepresentativeCastDefId": "castDef_Lothian",
    "HeraldryDefId": "heraldrydef_Lothian",
    "ReputationStatements": [
        "Why do you hunt the Lothian League so?  Do you want our furs?  Our minerals?  Instead of conquest, why don't you work for us and take on this contract?",
        "You do realise that the Lothian League also hires mercenary units?  Take on this contract and fight for us instead of against us.",
        "Commander, you have fought mercenary units working for us before, and have proved yourself competent.  Let us turn that to our mutual profit shall we?",
        "Welcome Commander.  The Lothian League would like to offer you a contract, if you are interested.",
        "Hello again Commander.  Our past dealings have been successful, so I have another contract for your consideration.",
        "Greetings my friend.  The Lothian League values your services, and I have another contract for you to consider.",
        "Commander, you are the most favoured of the Lothian League's Mercenaries.  I have saved this contract especially for you."
    ],
    "MissionSuccessStatements": [
        "You have completed the objectives required, and have our thanks.  Payment is being transferred to your account now."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we really required the primary objective to be completed, but I suppose I can provide a partial payment for what you did achieve."
    ],
    "BadFaithFailureStatements": [
        "We have a special place in the polar regions of Lothario for mercenaries who can't complete objectives.  Be thankful that all I am doing is not paying you!"
    ],
    "Description": "The Lothian League was a small Periphery realm composed by six ice-and-snow planets located beyond the outer reaches of the Free Worlds League near the Marian Hegemony.",
    "factionID": "Lothian",
    "icon": "uixTxrLogo_Lothian",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(50,205,50,1.0)"
}