{
  "ID": "faction_Liao",
  "Name": "the Capellan Confederation",
  "ShortName": "Liao",
  "Description": "The Capellan Confederation is one of the five Successor States of the Star League, located rimward of Terra. Ruled by House Liao, the Confederation is the smallest and newest of the Successor States and often the loser in conflicts against the other powers of the Inner Sphere. It is an authoritarian police state, with philosophical origins in a text known as the Korvin Doctrine, which argues for total subservience of the individual to the state. Citizens of the Confederation must earn their position and the benefits of citizenship through service to their community. The current ruler of the Confederation is Chancellor Maximilian Liao, a shrewd planner and master manipulator.",
  "Demonym": "Capellan",
  "Government": "Confederation",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "Marik",
    "Kurita",
    "Davion",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake"
  ],
  "Presence": 1.5,
  "ReputationStatements": [
    "In desperate times, even the mighty must resort to hiring those such as you. This is a kindness we do to you, mercenary: you serve your betters.",
    "We would not offer you this contract unless we had no other choice, mercenary. As it stands, this is simple: we have a task, and you need money. Accept or don't, it's your choice.",
    "The Capellan Confederation has need of your unit, mercenary. And you have need of our money, I assume. I think this will benefit both of us.",
    "There are few mercenaries House Liao trusts with tasks like this, Commander. Make certain our faith is not misplaced. We can both profit from this.",
    "Hello, Commander. The Capellan Confederation would like your assistance with a particular matter. In exchange, we will ensure you are well rewarded.",
    "I'm glad you're well, my friend. Once again, House Liao would like to call upon your prowess. Undertake this task for us, and we will pay you the highest possible rates. I assure you, this is not a contract for lesser warriors.",
    "My old friend, I hope this message finds you well. If you have the time, the Capellan Confederation would once again like to retain your services."
  ],
  "MissionSuccessStatements": [
    "House Liao has always believed in one thing, Commander: victory at any cost. It seems you also understand this vital lesson. We are pleased you've performed so well."
  ],
  "GoodFaithFailureStatements": [
    "Loss on the battlefield is not always failure. Losses teach us to improve and better ourselves. You fought well, Commander, even if you did not prevail. Learn from this lesson and do better next time."
  ],
  "BadFaithFailureStatements": [
    "If you cannot accomplish the missions we lay before you, Commander, we will find another mercenary who can! Consider this a warning to perform better—or be replaced."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_LiaoDefaultCommander",
  "DefaultRepresentativeCastDefId": "castDef_LiaoRepDefault",
  "DataManager": null,
  "factionID": "Liao",
  "icon": "uixTxrLogo_Liao",
  "heraldryDefId": "heraldrydef_liao",
  "storePanelImage": "uixTxrSpot_Store-Liao",
  "factionStorePlanetTag": "planet_other_factionhq_liao",
  "factionStoreColor": "rgba(30,39,27,1.0)",
  "factionMapColor": "rgba(208,255,144,1.0)",
  "StartingReputationValues": [
    -10,
    -10,
    0
  ],
  "StartingReputationModes": [
    "KAMEA_CAMPAIGN",
    "CAREER",
    "NONE"
  ],
  "MissionSuccessStatement": "House Liao has always believed in one thing, Commander: victory at any cost. It seems you also understand this vital lesson. We are pleased you've performed so well.",
  "GoodFaithFailureStatement": "Loss on the battlefield is not always failure. Losses teach us to improve and better ourselves. You fought well, Commander, even if you did not prevail. Learn from this lesson and do better next time.",
  "BadFaithFailureStatement": "If you cannot accomplish the missions we lay before you, Commander, we will find another mercenary who can! Consider this a warning to perform better—or be replaced."
}