{
    "ID": "faction_Rasalhague",
    "Name": "Free Rasalhague Republic",
    "ShortName": "Rasalhague",
    "Demonym": "Rasalhagueian",
    "Government": "Republic",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Rasalhague",
    "DefaultRepresentativeCastDefId": "castDef_Rasalhague",
    "HeraldryDefId": "heraldrydef_Rasalhague",
    "ReputationStatements": [
        "The FRR was established as a peaceful neutral nation, however your constant attacks have placed our very existence in jeopardy.  I beg you to reverse this trend and take this contract to promote our mutual interests.",
        "The Free Rasalhauge Republic has beed the target of your attacks on numerous occasions Commander.  If you seek simply profit, I can offer you a suitable contract that will provide the profits you seek.",
        "Commander, the FRR have faced you in combat before, and you are obviously a competent warrior.  I have a contract here for you, should you wish to profit from working with us, rather than against us.",
        "The Free Rasalhauge Republic welcomes you Commander.  I have a contract here that would suit someone of your ability if you are interested.",
        "Hello again Commander.  We have profited before from our dealings, and I hope to continue this by offering you this contract.",
        "Welcome Commander.  The FRR appreciates your continued efforts on our behalf, and I have a particularly profitable task for you if you would like it?",
        "Hello my friend.  You have done so much for us that even Prince Magnusson sings your praises.  I have saved this task for you, as I feel you are uniquely capable of completing it."
    ],
    "MissionSuccessStatements": [
        "On behalf of the FRR, I thank you for your services.  Full payment has been transferred to your nominated account."
    ],
    "GoodFaithFailureStatements": [
        "The FRR expects more of it's mercenaries Commander.  However, you did at least partially accomplish the objectives, so I have taken the liberty of making a partial payment of the contract."
    ],
    "BadFaithFailureStatements": [
        "You have failed the FRR, and you have not upheld your part of the contract in any significant way.  I hope you don't expect payment for this fiasco."
    ],
    "Description": "The Free Rasalhague Republic was a nation born in the wake of the Fourth Succession War, which enjoyed less than two decades of independence before finding themselves directly in the path of the Clan invasion.",
    "factionID": "Rasalhague",
    "icon": "uixTxrLogo_Rasalhague",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,255,255,1.0)"
}