{
    "ID": "faction_ClanFireMandrill",
    "Name": "Clan Fire Mandrill",
    "ShortName": "Fire Mandrill",
    "Demonym": "Fire Mandrill",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanFireMandrill",
    "DefaultRepresentativeCastDefId": "castDef_ClanFireMandrill",
    "HeraldryDefId": "heraldrydef_ClanFireMandrill",
    "ReputationStatements": [
        "Freeborn, you have been very consistent in your hatred of the Fire Mandrill Clan.  If my own kindraa were available I would use them for this task, but as they are occupied with more worthy opponents, you can take this batchall, or not.",
        "My kindraa have faced you in battle before Freeborn, and several lie dead by your hand.  Perhaps you can spill someone elses blood for a change with this batchall?",
        "Freeborn, I have heard from other kindraa you have battled before that you are a competent warrior.  Perhaps you can assist me in this small task?",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted other kindraa of the Fire Mandrill in the past, and I would like to offer you this batchall so that you can assist my kindraa as well.",
        "Hello again, friend to the Fire Mandrills.  We offer you this choice batchall in recognition of our friendship.",
        "Greetings my trusted friend.  You have helped me so often, I almost look at you as a member of my own kindraa.  I have this choice batchall for you, if you are interested?"
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit my kindraa, and I have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "You are aware that a batchall requires completion of all the objectives?   However I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "You have failed to honour the terms of the batchall in any significant way.  You receive nothing from me, and have insulted my kindraa."
    ],
    "Description": "Probably the most fractious of the Clans, the Fire Mandrill are as likely to fight each other as they are an enemy.",
    "factionID": "ClanFireMandrill",
    "icon": "uixTxrLogo_ClanFireMandrill",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,140,0,1.0)"
}