{
    "ID": "faction_ClanBurrock",
    "Name": "Clan Burrock",
    "ShortName": "Burrock",
    "Demonym": "Burrock",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "factionID": "ClanBurrock",
    "icon": "uixTxrLogo_ClanBurrock",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(218,165,32,1.0)",
    "DefaultCombatLeaderCastDefId": "castDef_ClanBurrock",
    "DefaultRepresentativeCastDefId": "castDef_ClanBurrock",
    "HeraldryDefId": "heraldrydef_ClanBurrock",
    "ReputationStatements": [
        "Freeborn, your lack of honour is well known, so we offer this trivial task that is beneath even our solahma units, so you might begin to redeem yourself.",
        "Freeborn, you value money above honour.  This is not our way, but we have a task for you that will allow you to obtain the credits you so desperately seek.",
        "Freeborn, we have met in combat before, and you have proved yourself moderately competent.  Perhaps you would like to prove yourself against one of our foes?",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have served us well enough in the past, and we would like to continue this relationship.  Perhaps this batchall will be to your liking?",
        "You fight with honour friend, and have shown yourself to be a capable warrior.  We have a task that we would normally not entrust to a freeborn, but it is yours if you wish.",
        "I am glad to see you, friend of Clan Burrock.  In different times I might suggest you undergo The Blooding so that you might become one with us, but for now, I offer you this batchall as an equal."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  You have achieved your objectives as well as any Burrock Commander, and we have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "Most Clans would simply kill you for your failure to honor your batchall, but I realise I asked to much of a mere freeborn.  Perhaps this partial payment will encourage you to do better next time."
    ],
    "BadFaithFailureStatements": [
        "Clearly the concept of honour is lost to you freeborn.  If I had a Star available, I would kill you myself for your failure.  I suggest you leave before one DOES become available."
    ],
    "Description": "Clan Burrock is one of the original 20 Clans founded by Nicholas Kerensky, and is regarded as one of the more enlightened of the Crusader Clans as far as their treatment of commoners and freeborn."
}