{
    "ID": "faction_Illyrian",
    "Name": "Illyrian Palatinate",
    "ShortName": "Illyria",
    "Demonym": "Illyrian",
    "Government": "Palatinate",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Illyrian",
    "DefaultRepresentativeCastDefId": "castDef_Illyrian",
    "HeraldryDefId": "heraldrydef_Illyrian",
    "ReputationStatements": [
        "Commander, the Illyrian Palatinate has always welcomed mercenaries; yet you constantly attack us. Is it just for money? If you desire C-Bills so badly, we have this contract you can undertake that's not against us for a change.",
        "Commander, I don't know what lies you have been told about the Illyrian Palatinate, but I can assure you that you have no reason to harm us.  Please accept this contract, and we can start working together.",
        "Commander, we of the Illyrian Palatinate don't want to involve embroil ourselves in conflict with you.  Rather than attack us, let us work together for mutual benefit.",
        "Greetings Commander.  The Illyrian Palatinate has a task requiring a competent lance of mercenaries, can we discuss the details?",
        "Greetings again Commander.  The Illyrian Palatinate once again have a small matter you can assist with, if you would care to help?",
        "Hello again, friend of the Illyrian Palatinate.  I have a task I would generally not entrust to a mercenary, but I am willing to pay you well to complete it.",
        "Greetings my trusted friend.  The Illyrian Palatinate is already indebted to you for your services in the past, so I have saved this choice contract for you if you want it?"
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this contract will benefit the Illyrian Palatinate, and we have transferred your c-bills to your account."
    ],
    "GoodFaithFailureStatements": [
        "Your contract with the Illyrian Palatinate required you to complete the primary objective, not just 'make an attempt'.  In the spirit of good faith, we will provide a partial payment this time, please don't let it happen again."
    ],
    "BadFaithFailureStatements": [
        "Factions push at our borders, Rasalhaguan refugees poor in to escape the conflicts, and now I get incompetent mercenary Commanders who can't complete any of the objectives required.  Go away, I have no time for your excuses."
    ],
    "Description": "The Illyrian Palatinate was founded in the mid 24th century by groups of Scandinavian colonists, however it currently faces pressure from both the Circinus Federation and the Marian Hegemony.",
    "factionID": "Illyrian",
    "icon": "uixTxrLogo_Illyrian",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(173,255,47,1.0)"
}