{
  "ID": "faction_Steiner",
  "Name": "the Lyran Commonwealth",
  "ShortName": "Steiner",
  "Description": "The Lyran Commonwealth is one of the five Successor States of the Star League, located coreward and anti-spinward of Terra. Ruled by House Steiner, the Commonwealth is the wealthiest of the five, with an entrenched and powerful noble class. The focus on pedigree and prestige among the nobility has often resulted in less-than-brilliant officers being elevated to high command, to the detriment of the Commonwealth's military strength. Much of the Commonwealth's success comes from the vast resources located within its borders. The current ruler of the Commonwealth is Archon Katrina Steiner, notable for her peace proposal that, in allying the Commonwealth with the Federated Suns, effectively ended the Third Succession War.",
  "Demonym": "Lyran",
  "Government": "Commonwealth",
  "Allies": [],
  "Enemies": [
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake"
  ],
  "Presence": 0.25,
  "ReputationStatements": [
    "You know the rule of war, don't you? 'Money can buy anything except honor.' While you have none of the latter, we have plenty of the former. Fight like the dog of war you are, and we may overlook your past transgressions.",
    "You know what I love best about mercenaries? You're willing to wade into battle when it's too dangerous for us to risk our own soldiers. So take the job, MechWarrior—fight and die for money, as is your role.",
    "Beggars can't be choosers, and neither can the frugal. This contract is a budget affair best suited to scoundrels such as yourself. No matter what your failings, you are willing to fight for money, yes? We can provide money.",
    "Hail, Commander. House Steiner has an operation we think you'll find interesting as well as lucrative. I'll be certain to recommend you to my superiors if you perform well.",
    "Your reputation precedes you, Commander. Your talents are always valued by the Lyran Commonwealth—and we reward those we value with money commensurate with their skills and loyalty.",
    "I hope you are in fine health, Commander. The Lyran Commonwealth has been pleased with your prior service, and we think this contract might be best suited for an expert like you. As always, we offer the highest rates.",
    "My friend! House Steiner sends you wishes of good health and full coffers. Once again, we would like to call upon your services—and as ever, we appreciate your loyalty and will show our gratitude in your pay."
  ],
  "MissionSuccessStatements": [
    "Large coffers pay for larger victories—and you have been instrumental in ensuring that our winning streak is intact. Excellent work, mercenary. House Steiner is pleased."
  ],
  "GoodFaithFailureStatements": [
    "The Lyran Commonwealth didn't get where it is by accepting victory or defeat as inevitable, but by continuing to fight after a loss. I hope you'll do the same, Commander. While you were defeated, you acquitted yourself well."
  ],
  "BadFaithFailureStatements": [
    "House Steiner has no place for cowards or failures, Commander. Ensure your future efforts are more robust, or the Lyran Commonwealth will be no friend to you."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_SteinerDefaultCommander",
  "DefaultRepresentativeCastDefId": "castDef_SteinerRepDefault",
  "DataManager": null,
  "factionID": "Steiner",
  "icon": "uixTxrLogo_Steiner",
  "heraldryDefId": "heraldrydef_steiner",
  "storePanelImage": "uixTxrSpot_Store-Steiner",
  "factionStorePlanetTag": "planet_other_factionhq_steiner",
  "factionStoreColor": "rgba(17,27,41,1.0)",
  "StartingReputationValues": [
    -5,
    -10,
    0
  ],
  "StartingReputationModes": [
    "KAMEA_CAMPAIGN",
    "CAREER",
    "NONE"
  ],
  "factionMapColor": "rgba(65,105,225,1.0)",
  "MissionSuccessStatement": "Large coffers pay for larger victories—and you have been instrumental in ensuring that our winning streak is intact. Excellent work, mercenary. House Steiner is pleased.",
  "GoodFaithFailureStatement": "The Lyran Commonwealth didn't get where it is by accepting victory or defeat as inevitable, but by continuing to fight after a loss. I hope you'll do the same, Commander. While you were defeated, you acquitted yourself well.",
  "BadFaithFailureStatement": "House Steiner has no place for cowards or failures, Commander. Ensure your future efforts are more robust, or the Lyran Commonwealth will be no friend to you."
}