{
    "ID": "faction_ClanSnowRaven",
    "Name": "Clan Snow Raven",
    "ShortName": "Snow Raven",
    "Demonym": "Snow Raven",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanSnowRaven",
    "DefaultRepresentativeCastDefId": "castDef_ClanSnowRaven",
    "HeraldryDefId": "heraldrydef_ClanSnowRaven",
    "ReputationStatements": [
        "Freeborn, I come to you seeking to reverse the distrust between us, by offering you this batchall.  I hope you will accept it.",
        "Freeborn, I wish this emnity between us to go away so that we can offer you more exclusive batchalls.  Please take this so that we can move towards a more trusting relationship.",
        "Freeborn, the Snow Ravens have faced you in battle before.  Take up this batchall so we can mutually profit from a closer relationship.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Snow Ravens in the past.  Continue to be useful by taking up this batchall and we will offer you more profitable tasks.",
        "Hello again my freeborn friend.  I have saved this batchall especially for you, in recognition of your fine service in the past.",
        "It is good to see you my friend.  I have a particularly profitable batchall for you this time, one I can give to no other."
    ],
    "MissionSuccessStatements": [
        "As expected, you have performed the tasks required admirably.  I have transferred the C-bills into your account and hope to work with you again."
    ],
    "GoodFaithFailureStatements": [
        "It is such a shame that you couldn't complete the tasks assigned to you.  Sadly, I can only offer you a partial payment for those tasks you did accomplish - strictly business, nothing personal."
    ],
    "BadFaithFailureStatements": [
        "Freeborn, you can't expect to enter into a batchall and then fail to fulfill any of it's conditions!  You will need to try much harder if you wish to have any further dealings with the Snow Raven Clan."
    ],
    "Description": "Masters of compromise and manipulation, Clan Snow Raven were opportunists of the highest order, possessing an almost un-Clanlike sense of self-preservation and a willingness to sell their services to the highest bidder.",
    "factionID": "ClanSnowRaven",
    "icon": "uixTxrLogo_ClanSnowRaven",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(102,205,170,1.0)"
}