{
    "ID": "faction_Circinus",
    "Name": "Circinus Federation",
    "ShortName": "Circinus",
    "Demonym": "Circinian",
    "Government": "Federation",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit"
    ],
    "Presence": 0.1,
    "factionID": "Circinus",
    "icon": "uixTxrLogo_Circinus",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(139,0,0,1.0)",
    "DefaultCombatLeaderCastDefId": "castDef_Circinus",
    "DefaultRepresentativeCastDefId": "castDef_Circinus",
    "HeraldryDefId": "heraldrydef_Circinus",
    "ReputationStatements": [
        "Please Commander, we are but poor farmers trying to survive, and we suffer greatly because of your past actions.  We beg of you to undertake this small task against those who would oppress us.",
        "Commander, we can offer you contracts that match our rivals.  We beg you, please don't prey on us any more, but instead work with us by accepting this contract.",
        "Commander, you have defeated us in combat before, so we know you are a competent mercenary unit.  Please take this contract on, and let us work together rather than against each other.",
        "The duly elected government of the Circinus Federation have a contract for a mercenary group of your calibre, if you are interested.",
        "You fight well Commander, and we've both benefited from our relationship in the past.  I have another contract for you, which will benefit us both.",
        "Ahoy Commander, it's good too see you again.  I've got another job for you, one where a good bit of loot, err I mean profit, can be had.",
        "Ahoy Matey!  It's good to see you again, and I have a really juicy job for you with plenty of loot to be had!"
    ],
    "MissionSuccessStatements": [
        "Well done matey!  You finished off that contract easily, and your share of the loot, err, I mean payment, is already in your account."
    ],
    "GoodFaithFailureStatements": [
        "You'd never make it in the Black Warriors with that sort of cowardly attitude!  I'll partially pay you this time, but complete the damn contract next time, or else!"
    ],
    "BadFaithFailureStatements": [
        "I should cut out your heart and feed it to my dog for failing... err, I mean you'll get no payment from us."
    ],
    "Description": "The Circinus Federation are effectively a highly organized pirate group that operates under the guise of being the legitimate armed forces of a democratically elected government."
}