{
    "ID": "faction_Marian",
    "Name": "Marian Hegemony",
    "ShortName": "the Hegemony",
    "Demonym": "Marian",
    "Government": "Hegemony",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
		"Republic",
		"Society"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Marian",
    "DefaultRepresentativeCastDefId": "castDef_Marian",
    "HeraldryDefId": "heraldrydef_Marian",
    "ReputationStatements": [
        "What is it that you have against the just rule of Caesar?  Before I unleash the full might of the Legions against you, I offer one last opportunity to work for us.  Your choice.",
        "Commander, instead of fighting the might of the Hegemony, would it not be more profitable to fight on the side of Caesar's Legions?  I have a contract for you if you are interested.",
        "Commander, you have fought the Legions before, and acquitted yourself well.  Rather than face the might of the Hegemony again, perhaps you would prefer to take up this task?",
        "Greetings Commander.  Our Legions are occupied at the moment, and as a result I have a task you can perform in the name of Caesar.",
        "Hello again Commander.  Caesar appreciates your past assistance, and I am authorized to offer you another contract.",
        "Hail Commander.  You have proved quite useful to the Marian Hegemony, and I have saved this contract as reward for your services.",
        "Hail Commander.  If all our Legions were as effective as you, we would have an empire to match any of the Successor Houses.  I have this contract that I would entrust to no other, for your consideration."
    ],
    "MissionSuccessStatements": [
        "Commander, you have completed the objectives required, and have our thanks.  Payment is being transferred to your account now."
    ],
    "GoodFaithFailureStatements": [
        "Commander, if you were a Legionnaire I would have you flogged for your incompetence.  However, the contract stipulates partial payment for partial completion, so it has been done."
    ],
    "BadFaithFailureStatements": [
        "I have half a mind to enslave you and your company for failing to complete any of the objectives.  Leave my presence before I change my mind."
    ],
    "Description": "The Marian Hegemony is an expansionist periphery faction who's government and military are based on the ancient Terran Roman Empire.",
    "factionID": "Marian",
    "icon": "uixTxrLogo_Marian",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,140,0,1.0)"
}