{
    "ID": "faction_ClanGoliathScorpion",
    "Name": "Clan Goliath Scorpion",
    "ShortName": "Goliath Scorpion",
    "Demonym": "Goliath Scorpion",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanGoliathScorpion",
    "DefaultRepresentativeCastDefId": "castDef_ClanGoliathScorpion",
    "HeraldryDefId": "heraldrydef_ClanGoliathScorpion",
    "ReputationStatements": [
        "Freeborn, if it were not for the fact that the necrosia has showed me you can be of service, I would not suffer your presence.  Here is a trivial task for you, to prove your worth.",
        "Your dishonorable ways are well known to the Goliath Scorpions Freeborn, however you might be of service.  Take this batchall, and show me that you can be of service.",
        "Freeborn, my Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Goliath Scorpions in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to the Goliath Scorpions.  While there is certainly trust between us, I would like you to take this batchall to show your sincerity before we share all our secrets with you.",
        "Greetings friend.  You have proven your value to the Goliath Scorpions many times.  I have a task I would entrust to no other, and perhaps afterwards we shall share some necrosa?"
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  I foresaw your success in this matter, and have already transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "You clearly lacked the strength to complete all the objectives, however your attempt was noted. I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "Your weakness is an embarrassment, and you have failed to honour the terms of the batchall in any significant way.  You receive nothing from me, other than my disdain."
    ],
    "Description": "The Goliath Scorpion Clan was obsessed with recovering any and all lost artifacts of the fallen Star League, sending Seekers fueled by necrosa visions far and wide to recover them.",
    "factionID": "ClanGoliathScorpion",
    "icon": "uixTxrLogo_ClanGoliathScorpion",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,100,0,1.0)"
}