{
    "ID": "faction_ClanGhostBear",
    "Name": "Clan Ghost Bear",
    "ShortName": "Ghost Bear",
    "Demonym": "Ghost Bear",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanGhostBear",
    "DefaultRepresentativeCastDefId": "castDef_ClanGhostBear",
    "HeraldryDefId": "heraldrydef_ClanGhostBear",
    "ReputationStatements": [
        "Freeborn, you need to learn that strength can be shown in ways other than killing my Clan before you end up impaled on our claws.  You can begin to make amends with this batchall.",
        "Your craving for battle is well known.  Perhaps this batchall will satiate your desire?",
        "Freeborn, my Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Ghost Bear clan in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to the Ghost Bears.  We offer you this batchall in recognition of our kinship.",
        "Greetings my brother.  You have helped me so often, I almost look at you as a member of my own family.  I have this choice batchall for you, if you are interested?"
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit the Ghost Bears, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "You clearly lacked the strength to complete all the objectives?   However I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "Your weakness is an embarrassment, and you have failed to honour the terms of the batchall in any significant way.  You receive nothing from me, other than my disdain."
    ],
    "Description": "Among the most powerful of the Clans, the Ghost Bears were defined by their conservative 'wait and see nature' and their deep familial relationship with each other.",
    "factionID": "ClanGhostBear",
    "icon": "uixTxrLogo_ClanGhostBear",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(192,255,255,1.0)"
}