{
    "ID": "faction_Society",
    "Name": "Society",
    "ShortName": "Society",
    "Demonym": "Societist",
    "Government": "Society",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "Valkyrate",
		"WordOfBlake",
		"Republic"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_Society",
    "DefaultRepresentativeCastDefId": "castDef_Society",
    "HeraldryDefId": "heraldrydef_Society",
    "ReputationStatements": [
        "Mercenary, our Intelligence has been watching you and the reports aren't quite favorable; perhaps this... opportunity will work towards redeeming yourself.",
        "Mercenary, it may be more profitbable for your venture to cease your attacks on our cells. May this contract draw your interests elsewhere.",
        "You've disrupted our activities in the past but we know prowess and opportunity when we see it; perhaps working with us may provide better fortunes for you and yours?",
        "Mercenary, our agents are actively engaged in other theatres of operations. We ask that you do this for us in the name of progress and reason.",
        "Mercenary, we may be different peoples but you have proven yourself capable of working with us for the greater good of humanity. Would you be interested in furthering our cause?",
        "Greetings, Friend, your history of working with our Agents has not gone unnoticed. We have an excellent opportunity that would be perfect for you. Would you like to know more?",
        "Greetings, Brother, thanks to your noble efforts, we are making strides in overthrowing the chains of the Warrior Caste. Alas, there is still work to do; will you help us?"
    ],
    "MissionSuccessStatements": [
        "Well done, Commander, we look forward to your detailed reports."
    ],
    "GoodFaithFailureStatements": [
        "You may drop some beakers before making progress."
    ],
    "BadFaithFailureStatements": [
        "You may drop some beakers before making progress; just remember whose beakers you are breaking."
    ],
    "Description": "The Society is a secret cabal of Clan Scientists spread across most of the homeworld clans; they are not pleased with the Warrior caste being in control.",
    "factionID": "Society",
    "icon": "uixTxrLogo_Society",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(205,39,183,1.0)"
}