{
  "ID": "faction_Axumite",
  "Name": "Axumite Providence",
  "ShortName": "Axumite",
  "Demonym": "Axumitian",
  "Government": "Providence",
  "Allies": [
  ],
  "Enemies": [
  "Steiner","Marik","Kurita","Davion","Liao","AuriganRestoration","ComStar",
            "MagistracyOfCanopus","TaurianConcordat","Outworld","Marian","Oberon","Lothian","Circinus", "Illyrian","Rasalhague","Ives",
            "Castile","Chainelane","ClanBurrock","ClanCloudCobra","ClanCoyote","ClanDiamondShark","ClanFireMandrill","ClanGhostBear","ClanGoliathScorpion",
            "ClanHellsHorses","ClanIceHellion","ClanJadeFalcon","ClanNovaCat","ClansGeneric","ClanSmokeJaguar","ClanSnowRaven","ClanStarAdder",
            "ClanSteelViper","ClanWolf","Delphi","Elysia","Hanse","JarnFolk","Tortuga","Valkyrate","NoFaction","Locals", "AuriganDirectorate", "AuriganPirates","WordOfBlake","Republic",
		"Society"
  ],
  "Presence": 0.1,
  "factionID": "Axumite",
    "icon": "uixTxrLogo_Axumite",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,102,153,0.6)",
  "DefaultCombatLeaderCastDefId": "castDef_LocalsDefault",
  "DefaultRepresentativeCastDefId": "castDef_LocalsDefault",
  "HeraldryDefId": "heraldrydef_Axumite",
  "ReputationStatements": [
    "As much as the Axumite Providence is loath to deal with infidel, we have need of mercenaries, and you are here.",
	"The Axumite Providence has a contract that you may be competent enough to fulfill, insha'Allah.",
	"Hello Commander.  We hope you can assist us in a small matter that requires a suitable mercenary force.",
	"Peace be unto you Commander.  We have heard you are a competent mercenary, and we would like present this contract for your consideration.",
	"Peace be unto you and so may the mercy of Allah and his blessings, friend of the Axumites.  You have served us well in the past, and we offer this contract in the hopes this relationship will continue to grow.",
	"Allah's blessings upon you, my friend.  We have need of your services once again, and in consideration of your past services to the Axumite Providence, we have a profitable contract for you today.",
	"Allah bless you, and the Prophet Mohammad for guiding you back to us, my brother.  Once again we have a profitable contract for you, honoured friend, one we would entrust to no other."
  ],
  "MissionSuccessStatements":[ "Allah be praised, for it is by his will that you have completed this task for us.  Full payment has already been transferred to you for your services."
  ],"GoodFaithFailureStatements":[ "It is unfortunate that you were unable to complete the task, however as Allah is merciful, so are we.  Perhaps we expected too much of you this time, and we hope you are able to perform better if we call upon you again."
  ],"BadFaithFailureStatements":[ "Infidel, I hope you do not expect payment for your pathetic performance.  Know that you have insulted the Axumite Providence with your cowardice."
  ],"Description" : "The Axumite Providence is a primitive Islamic state in the Deep Periphery. The nearest system is located 1,000 light years anti-spinward of Terra, located at the trailing edge of Orion's Bow.  The Axumites have limited 20th century technology, and little else."
}
