{
    "ID" : "faction_ComStar",
    "Name" : "ComStar",
    "ShortName" : "ComStar",
    "Description" : "ComStar, the institution and religion, grew out of the Star League Department of Communications, as reenvisioned by Jerome Blake, Minister of Communications. ComStar is transnational, beholden to none of the Successor States, and its priesthood exclusively controls access to the only means of faster-than-light communications, the HyperPulse Generators. ComStar facilities and personnel are sacrosanct, a status enforced aggressively by the institution; offending states—even entire Successor States—can find themselves cut off from the rest of the Inner Sphere, unable to communicate or trade. The current head of ComStar is Primus Julian Tiepolo.",
    "Demonym" : "ComStar",
    "Government" : "Corporation",
    "Allies" : [
        "MercenaryReviewBoard"
    ],
    "Enemies" : [
        "Steiner","Marik","Kurita","Davion","Liao","AuriganRestoration","WordOfBlake",
            "MagistracyOfCanopus","TaurianConcordat","Outworld","Marian","Oberon","Lothian","Circinus", "Illyrian","Rasalhague","Ives","Axumite",
            "Castile","Chainelane","ClanBurrock","ClanCloudCobra","ClanCoyote","ClanDiamondShark","ClanFireMandrill","ClanGhostBear","ClanGoliathScorpion",
            "ClanHellsHorses","ClanIceHellion","ClanJadeFalcon","ClanNovaCat","ClansGeneric","ClanSmokeJaguar","ClanSnowRaven","ClanStarAdder",
            "ClanSteelViper","ClanWolf","Delphi","Elysia","Hanse","JarnFolk","Tortuga","NoFaction","Locals", "AuriganDirectorate", "AuriganPirates", "Valkyrate"
    ],
    "Presence" : 0.1,
    "ReputationStatements" : [
        "Blessed Greetings, We have a Task that requires attention.",
        "Be Blessed, We require outside Assets for a Task.",
        "Ahh Mercenary, Blessed be your Path, we have a Matter of some import.",
        "Welcome to our Halls, The Precentor has requested your Aid.",
        "Greetings Child, we have an Opportunity for you.",
        "The Precentor Martial has a unique Offer for you.",
        "Blake be Blessed Friend, for there is Work be had."
    ],
    "MissionSuccessStatements" : [ 
		"ComStar congratulates you on your successful mission, mercenary. We are pleased you've been able to assist us so thoroughly.",
    ], 
	"GoodFaithFailureStatements" : [ 
		"It seems apparent that while you failed to achieve our goals, you engaged the enemy for as long as you were able. Better luck next time, Commander. May the Spirit of Blake be with you.",
    ],
	"BadFaithFailureStatements" : [ 
		"Far be it from a simple organization like ComStar to reprimand you in matters of warfare, Commander, but… your performance on that operation was positively abysmal. We roundly condemn your inadequacies.",
    ],
	"DefaultCombatLeaderCastDefId" : "castDef_ComStarDefault",
    "DefaultRepresentativeCastDefId" : "castDef_ComStarDefault",
    "DataManager" : null,
    "Faction" : "ComStar",
    "heraldryDefId" : null,
    "storePanelImage" : null,
    "factionStoreColor" : null,
    "StartingReputationValues" : [
        0,
        0,
        0
    ],
    "StartingReputationModes" : [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}