{
  "Custom": {
    "BonusDescriptions": [
      "ROI"
    ],
    "Flags": [
      "not_broken"
    ],
    "IBLS": {
      "StorageSize": 1
    }
  },
  "Description": {
    "Cost": 1000,
    "Rarity": 4,
    "Purchasable": true,
    "Manufacturer": "",
    "Model": "",
    "UIName": "LAMcademy LAM Appointment",
    "Id": "Gear_LAMcademy_LAM_Appointment",
    "Name": "LAMcademy LAM Appointment",
    "Details": "Tired of piloting a sluggishly slow <i>grounded</i> 'Mech while everything else hurtles past you?  Well then, <i>Wham-Ba-LAM</i> has the perfect solution for you: [[DM.BaseDescriptionDefs[LoreLAM],LAM]] Pilot Training.  An appointment to <i>Wham-Ba-LAM</i>'s LAMcademy Piloting School will reward you with the knowledge of the skills needed to pilot a LAM.  This training course, supplemented by neurostimuli and training simulators, and taught by our very own Black Betty,  can be yours for no more than ¢500,000.  Your tuition fee covers all costs associated with your training including room and board for 6-12 months.  Stop letting your lethargic 'Mech affect your performance on the battlefield!\r\n\r\n<color=#39FF14>Training can be tailored for Pilots or Commanders.</color>\r\n\r\n<color=#FF0000>WARNING! Tuition costs ¢500,000 and the chosen pilot will not be available for 6-12 months.  Applicant MUST have prior 'Mech experience.  Slots are limited, so only ONE pilot may attend at a time.  Our reps are not responsible if you do not have the funds to pay the tuition.  Avoid buying until you have a proper bankroll.</color>\r\n\r\n<color=#FFFF00>NOT ALL APPLICANTS WILL BE ACCEPTED!  LAM Training is dangerous.  Accidents do happen and <i>Wham-Ba-LAM</i>'s LAMcademy Piloting School will not be held responsible for pilot injury or death.</color>",
    "Icon": "uixSvgIcon_equipment_Comms"
  },
  "BonusValueA": "",
  "BonusValueB": "",
  "ComponentType": "Upgrade",
  "ComponentSubType": "NotSet",
  "PrefabIdentifier": "",
  "RelativeModifier": 0,
  "AbsoluteModifier": 0,
  "BattleValue": 0,
  "InventorySize": 1,
  "Tonnage": 0,
  "AllowedLocations": "None",
  "DisallowedLocations": "All",
  "CriticalComponent": false,
  "ComponentTags": {
    "items": [
      "SquadIncompatible"
    ],
    "tagSetSourceFile": ""
  }
}
