{
  "All": [
    "Let's get out there and do this!",
    "Lets rock and roll!",
    "Wouldn't want any other Company by our side, Commander. It's an honour to fight here along side you.",
    "Go to {TGT_SYSTEM.name}, they said. See the world, they said. All I see are {TEAM_TAR.FactionDef.Demonym} Battlemechs. Lovely.",
    "{COMMANDER.Callsign}, I fought along side you years ago. It's an honour to do the same again today.",
    "Glad you could grace us with your presence. Lead the way, Merc.",
    "Only good {TEAM_TAR.FactionDef.Demonym} is a dead {TEAM_TAR.FactionDef.Demonym}."
  ],

  "AmbushConvoy": [
    "We must be close to the convoy by now. Let's push on.",
    "Those bastards are here somewhere. Let's get hunting, Commander",
    "You make the initial engagement, {COMMANDER.Callsign}. We'll support you."
  ],

  "Assassinate": ["Beat the bushes and bring me the target's head."],

  "CaptureBase": ["It's critical we take this base, Commander."],
  "CaptureBaseJointAssault": [
    "We need to capture this base intact. We're going to make sure you don't mess this up for us."
  ],
  "CaptureBaseAidAssault": [
    "Thanks for the assist, Commander. Get here as fast as you can!",
    "We're in mid-assault, {COMMANDER.Callsign}. Help would be much appreciated!"
  ],

  "CaptureEscort": [
    "Commander, we need to hurry and get to those vehicles. They won't last long",
    "It's critical we get these guys off {TGT_SYSTEM.name}. Let's do this!"
  ],

  "DefendBase": [
    "Commander, I'm glad we got here in time. We're forces from the next base along. Looks like we're in for a hell of a fight.",

    "Oh man. This base was meant to be an easy assignment. Why does this always happen to me?",

    "Great, just our luck to be stuck defending this hellhole with mercs. You no doubt caused this all to happen."
  ],

  "DestroyBase": ["Gotta destroy this base, Commander."],
  "DestroyBaseJointAssault": [
    "We've been attached to your company for this assault, Commander. I hope you know what you're doing."
  ],
  "DestroyBaseAidAssault": [
    "Couldn't have arrived any sooner, Comma<b>***STATIC***</b>. Shit. We need help!"
  ],

  "Rescue": [
    "Think we can get in and out without anyone noticing?",
    "Let's just get the thing and get out fast!"
  ],

  "SimpleBattle": [
    "So this is it. Finally.",
    "This is it. We either get through this together... or not."
  ],

  "Blackout": [
    "We're not sure what's going on here but we better be ready for anything.",
    "This situation just doesn't feel right, Commander",
    "I have some friends here. I hope they're ok",
    "Why would we lose contact? You don't just lose contact without something bad happening."
  ]
}
