{
    "Description" : {
        "Id" : "forceevent_co_LetterofMarque_4YEnd",
        "Name" : "Letter of Marque Expired",
        "Details" : "The steady hum of the <i>Argo</i>'s CIC fills the room as you pore over the latest contract offers, sifting through the endless requests for mercenary muscle. The MRB terminal flickers, updating as new listings come in—some promising, most not. You're half-lost in thought when Darius clears his throat from behind you.\r\n\r\n\"Commander, got a minute?\"\r\n\r\nYou glance up. Darius isn't carrying a datapad or a mission brief, which means this isn't about the next job. His expression is neutral, but you know him well enough to spot the slight hesitation. He's about to tell you something you won't like.\r\n\r\n\"Go ahead,\" you say, leaning back in your chair.\r\n\r\nDarius folds his arms. \"MiG's contract is up.\"\r\n\r\nYou blink. The words settle in, but they don't feel right. \"Already?\"\r\n\r\n\"Yeah. Just ran the numbers.\" He nods toward your terminal. \"Four years on the dot. Their Letter of Marque is officially completed as of today.\"\r\n\r\nYou exhale, running a hand through your hair. Four years. It felt like less. Maybe because MiG had been one of the most consistent pilots in your outfit—never the loudest, never the most reckless, just cold efficiency wrapped in a pilot's suit. And that trigger finger. No one on the team could pick off an OpFor cockpit like MiG. If the enemy mech was standing still for even a second too long, they might as well have already ejected.\r\n\r\n\"They say anything?\" you ask.\r\n\r\nDarius shakes his head. \"Not yet. Haven't even asked if they want to extend or walk.\" He pauses, then smirks. \"I figured I'd let you have that conversation.\"\r\n\r\nYou sigh, but there's a faint grin behind it. MiG wasn't one for speeches. They'd probably just shrug and give you a straight answer—yes or no, no theatrics. Either way, it was their choice now.\r\n\r\n\"Alright,\" you say, pushing yourself up from the chair. \"Guess I better find out if we're losing our best headhunter.\"\r\n\r\nDarius claps you on the shoulder. \"Hey, if they leave, at least the OpFor might finally catch a break.\"\r\n\r\nYou snort. \"Not my problem.\"\r\n\r\nBut as you step out of the CIC, heading toward the barracks, you already know what you're hoping to hear.",
        "Icon" : "uixTxrSpot_LetterofMarque_End.png"
    },
    "Scope" : "Company",
    "Weight" : 10,
    "Requirements" : {
        "Scope" : "Company",
        "RequirementTags" : {
            "tagSetSourceFile" : "Tags/CompanyTags",
            "items" : []
        },
        "ExclusionTags" : {
            "tagSetSourceFile" : "Tags/CompanyTags",
            "items" : []
        },
        "RequirementComparisons" : []
    },
    "AdditionalRequirements" : [],
    "AdditionalObjects" : [
        {
            "Scope" : "SecondaryMechWarrior",
            "Requirements" : {
                "Scope" : "SecondaryMechWarrior",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : [
                        "name_MiG"
                    ]
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "Tags/PilotTags",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        }
    ],
    "Options" : [
        {
            "Description" : {
                "Id" : "outcome_0",
                "Name" : "Ask MiG to Renew",
                "Details" : "End of Contract",
                "Icon" : null
            },
            "RequirementList" : [],
            "ResultSets" : [
                {
                    "Description" : {
                        "Id" : "outcome_0_0",
                        "Name" : "Goodbye for now...",
                        "Details" : "You find MiG exactly where you expect—sitting alone in the barracks, quietly cleaning the targeting lenses on his neurohelmet. The overhead lights cast a dull glow over the room, reflecting faintly in the visor's glass. He doesn't look up as you approach, but you know he's already aware you're there.\r\n\r\n\"MiG,\" you start, leaning against the bulkhead. \"Your contract's up.\"\r\n\rHe nods once, still focused on his work. \"Figured.\"\r\n\r\nYou watch him for a moment, then get to the point. \"I want to renew it. Same terms. Four to five years. You'd have a spot here as long as you want it.\"\r\n\r\nMiG finally sets the helmet down and looks at you, his expression unreadable. \"Commander, you know how I work.\" His tone is flat, matter-of-fact. \"I only take properly sanctioned Letters of Marque. No off-the-books extensions, no handshakes. If you want me in the company, you do it through the MRB.\"\r\n\r\nYou cross your arms. \"We both know how this outfit runs. You've been with us for four years. Do we really need to jump through bureaucracy?\"\r\n\r\n\"Yeah,\" he says simply. \"We do.\"\r\n\r\nSilence stretches between you. He's not being difficult—this is just how he operates. Professional to a fault. You exhale through your nose and nod. \"Alright. No shortcuts.\"\r\n\r\n \"Good,\" MiG replies as he picks up his helmet and starts clearing out his locker.",
                        "Icon" : null
                    },
                    "Weight" : 100,
                    "Results" : [
                        {
                            "Scope" : "SecondaryMechWarrior",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : []
                            },
                            "Stats" : null,
                            "Actions" : [
                                {
                                    "Type" : "MechWarrior_Fire",
                                    "value" : "1",
                                    "valueConstant" : null,
                                    "additionalValues" : null
                                }
                            ],
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        },
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : []
                            },
                            "Stats" : [
                                {
                                    "typeString" : "System.Int32",
                                    "name" : "LetterofMarque_MiG4Y",
                                    "value" : "0",
                                    "set" : true,
                                    "valueConstant" : 0
                                }
                            ],
                            "Actions" : null,
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        }
                    ]
                }
            ],
            "Requirements" : {
                "Scope" : "Company",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        },
        {
            "Description" : {
                "Id" : "outcome_1",
                "Name" : "Say farewell to MiG",
                "Details" : "End of Contract",
                "Icon" : null
            },
            "RequirementList" : [],
            "ResultSets" : [
                {
                    "Description" : {
                        "Id" : "outcome_0_0",
                        "Name" : "Goodbye for now...",
                        "Details" : "A few hours later, you find him near the mech bay, standing in front of his now-empty locker. His duffel is already packed, slung over one shoulder. The sound of welding and hydraulic presses hums in the background as the tech crews work, but here, near the exit ramp, it's quiet.\r\n\r\nYou step up beside him. \"Well, MiG, looks like this is it.\"\r\n\r\nHe nods. \"Looks like it.\"\r\n\r\nYou glance at his duffel, then back at him. \"You planning on sticking around Steiner space?\"\r\n\r\n\"For now.\" He adjusts the strap on his shoulder. \"You know where to find me.\"\r\n\r\nYou smirk. \"Yeah. Through the MRB.\"\r\n\r\n\"The only way that counts,\" he replies.\r\n\r\nYou let a beat pass before offering your hand. \"You're a damn good pilot, MiG. If the day comes when I need you again, I'll make the call.\"\r\n\r\nMiG grips your hand firmly, his grip as steady as his aim. \"And if the contract's right, I'll answer.\"\r\n\r\nWith that, he turns and walks toward the exit ramp. No fanfare, no goodbyes—just another mercenary moving on to the next job. You watch him go, already knowing this won't be the last time your paths cross.",
                        "Icon" : null
                    },
                    "Weight" : 100,
                    "Results" : [
                        {
                            "Scope" : "SecondaryMechWarrior",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : []
                            },
                            "Stats" : null,
                            "Actions" : [
                                {
                                    "Type" : "MechWarrior_Fire",
                                    "value" : "1",
                                    "valueConstant" : null,
                                    "additionalValues" : null
                                }
                            ],
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        },
                        {
                            "Scope" : "Company",
                            "Requirements" : null,
                            "AddedTags" : {
                                "tagSetSourceFile" : "",
                                "items" : []
                            },
                            "RemovedTags" : {
                                "tagSetSourceFile" : "Tags/CompanyTags",
                                "items" : []
                            },
                            "Stats" : [
                                {
                                    "typeString" : "System.Int32",
                                    "name" : "LetterofMarque_MiG4Y",
                                    "value" : "0",
                                    "set" : true,
                                    "valueConstant" : 0
                                }
                            ],
                            "Actions" : null,
                            "ForceEvents" : null,
                            "TemporaryResult" : false,
                            "ResultDuration" : 0
                        }
                    ]
                }
            ],
            "Requirements" : {
                "Scope" : "Company",
                "RequirementTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "ExclusionTags" : {
                    "tagSetSourceFile" : "",
                    "items" : []
                },
                "RequirementComparisons" : []
            }
        }
    ],
    "PublishState" : "PUBLISHED",
    "ValidationState" : "UNTESTED",
    "EventType" : "UNSELECTABLE",
    "OneTimeEvent" : false,
    "Tags" : {
        "tagSetSourceFile" : "tags/EventTags",
        "items" : []
    }
}