{
  "ID": "faction_ArcRoyalLibertyCoalition",
  "Name": "Arc Royal Liberty Coalition",
  "ShortName": "ARLC",
  "Description": "The Arc-Royal Liberty Coalition (ARLC) is a breakaway state formed in the mid-32nd century after the collapse of the Wolf Empire and Clan Wolf's occupation of the Lyran Commonwealth's Arc-Royal region. Centered on the planet Arc-Royal, the ARLC was established under the leadership of Clan Wolf-in-Exile. It represents an alliance of local systems seeking autonomy, rejecting external domination while embracing both the Clan and Inner Sphere traditions. Known for its strong military capability, the Coalition is characterized by its hybrid culture and pragmatic governance, embodying a unique blend of freedom and security within a turbulent Inner Sphere.",
  "Demonym": "Coalition",
  "Government": "Monarchy",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "ShadowDivisions",
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanSeaFox3150",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake",
    "Republic",
    "Society",
    "ClanBloodSpirit",
    "DarkCaste",
    "MarikStewart",
    "Rim",
    "GhostBearDominion",
    "RegulanFiefs",
    "TamarindAbbey",
    "DuchyOfAndurien",
    "RavenAlliance",
    "FiltveltCoalition",
    "OrienteProtectorate",
    "RimCommonality",
    "CalderonProtectorate",
    "ClanStoneLion",
    "ClanWolfInExile",
    "EscorpionImperio",
    "GreenGhosts",
    "Outworld",
    "AmarisEmpire",
    "RimWorldsRepublic",
    "SLDF",
    "TerranHegemony",
    "ClanMongoose",
    "ClanSeaFox",
    "ClanWidowmaker",
    "ClanWolverine",
    "MinnesotaTribe",
    "UmayyadCaliphate",
    "FinmarkFreeRepublic",
    "KitteryPrefecture",
    "SLDFinExile",
    "RoguePirates",
    "CalderonProtectorate3150",
    "ClanHellsHorses3150",
    "ClanJadeFalcon3150",
    "Davion3150",
    "DuchyOfAndurien3150",
    "FiltveltCoalition3150",
    "FroncReaches3150",
    "Kurita3150",
    "Liao3150",
    "Lothian3150",
    "MagistracyOfCanopus3150",
    "Marian3150",
    "Marik3150",
    "RavenAlliance3150",
    "Steiner3150",
    "TaurianConcordat3150",
    "AlyinaMercantileLeague",
    "ClanProtectorate",
    "FerrisCollective",
    "GalateanLeague",
    "Havens",
    "NewOberonConfederation",
    "RagnarokUnion",
    "RepublicoftheBarrens",
    "RasalhagueDominion",
    "RimTerritories",
    "ScorpionEmpire",
    "TamarPact",
    "TimbuktuCollective",
    "VesperMarches",
    "WolfEmpire",
    "FroncReaches"
  ],
  "Presence": 0.25,
  "ReputationStatements": [
    "In the Arc-Royal Liberty Coalition, we value honor above all. While your past may lack this virtue, we offer you a chance to earn both honor and payment. Prove your worth on the battlefield, and past misdeeds may be forgiven.",
    "Mercenaries like you have the courage to face dangers that others might avoid. Join our cause, MechWarrior—fight alongside us, and be rewarded for your bravery and skill.",
    "Opportunities arise for those willing to seize them. This contract may suit your current standing, offering both challenge and reward. If you're prepared to fight for compensation, the Coalition is prepared to engage your services.",
    "Greetings, Commander. The Arc-Royal Liberty Coalition has a mission that aligns with your expertise and promises substantial reward. Success in this endeavor will not go unnoticed by our leadership",
    "Commander, your esteemed reputation has reached us. The Coalition values such talent and compensates skill and loyalty generously. We invite you to join our efforts.",
    "Commander, I trust this message finds you well. The Arc-Royal Liberty Coalition has noted your exemplary service and believes this mission aligns with your expertise. We continue to offer competitive compensation for your skills.",
    "Esteemed ally, the Arc-Royal Liberty Coalition extends warm regards. We seek your valued services once more and assure you that your loyalty and expertise will be rewarded accordingly."
  ],
  "MissionSuccessStatements": [
    "Success breeds strength, and today you have contributed meaningfully to the Coalition's enduring resilience. Excellent work, Commander. The Arc-Royal Liberty Coalition recognizes and values your efforts."
  ],
  "GoodFaithFailureStatements": [
    "In the Coalition, setbacks are opportunities to learn and rise stronger. While the mission did not succeed, your resolve and effort are noted, Commander. We trust you will regroup and return to prove your mettle."
  ],
  "BadFaithFailureStatements": [
    "Failure is an unacceptable outcome, but a lack of discipline is worse. Commander, your performance fell short of Coalition standards, undermining our trust. Reflect on this and ensure future actions demonstrate both competence and commitment."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_ArcRoyalLibertyCoalition",
  "DefaultRepresentativeCastDefId": "castDef_ArcRoyalLibertyCoalition",
  "factionID": "ArcRoyalLibertyCoalition",
  "icon": "uixTxrLogo_ArcRoyalLibertyCoalition",
  "heraldryDefId": "heraldrydef_ArcRoyalLibertyCoalition",
  "factionMapColor": "rgba(102,0,153,1.0)",
  "StartingReputationValues": [],
  "StartingReputationModes": []
}
