{
    "ID": "faction_ClanWolverine",
    "Name": "Clan Wolverine",
    "ShortName": "Wolverine",
    "Description": "One of the original twenty Clans, Clan Wolverine was Annihilated in the years after Operation KLONDIKE, officially for having detonated nuclear devices to destroy a genetic repository of Clan Snow Raven and for opposing Nicholas Kerensky and the Clans as a whole. \r\n\r\nThe Clans subsequently went to great lengths to purge Clan Wolverine from their history. They refer to the former Clan Wolverine only as the \"Not-Named Clan\". Instead of properly referring the \"IIC\"-style evolution of the Wolverine BattleMech as the Wolverine IIC, it was renamed the Conjurer (Hellhound). More than two hundred years after Clan Wolverine's annihilation, the mere comparison of a Clan warrior to an animal identified as wolverine, in a completely unrelated situation and by a person not accustomed to Clan society, was still considered a shocking insult that might elicit a violent response.",
    "Demonym": "Wolverine",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "Marik",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "RimCommonality",
        "RimWorldsRepublic",
        "AmarisEmpire",
        "TerranHegemony",
        "ClanMongoose",
        "ClanWidowmaker",
        "ClanSeaFox",
        "MinnesotaTribe",
        "UmayyadCaliphate",
        "SLDF"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanWolverine",
    "DefaultRepresentativeCastDefId": "castDef_ClanWolverine",
    "heraldryDefId": "heraldrydef_ClanWolverine",
    "ReputationStatements": [
        "I normally don't look down on Freeborn such as you, but your repeated actions against Clan Wolverine have made me question whether I should hold you all in disdain.  Take up this batchall and prove to me that Freeborn such as you are useful.",
        "Freeborn, you have fought against Clan Wolverine on many occasions.  Prove you can assist as well as cause harm by performing this task, and we might have further use for you.",
        "Freeborn, my Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Wolverines in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to Clan Wolverine.  We offer you this batchall in recognition of our friendship, and in the hopes that we can benefit each other in future.",
        "Greetings my friend.  You have helped me so often, I feel we should discuss the possibility of you joining Clan Wolverine yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit us both, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "Clan Wolverine understands that sacrifice on the battlefield doesn't always translate to victory. You've made a valiant, yet ineffective effort. We trust you will do better for the next battle."
    ],
    "BadFaithFailureStatements": [
        "Your performance was appalling, Commander. Your tactics on the battlefield were pathetic and ineffectual."
    ],
    "DataManager": null,
    "factionID": "ClanWolverine",
    "icon": "uixTxrLogo_ClanWolverine",
    "storePanelImage": "uixTxrSpot_Store-Marik",
    "factionStoreColor": "rgba(35,24,37,1.0)",
    "factionMapColor": "rgba(204,255,255,1.0)",
    "StartingReputationValues": [
        0,
        0,
        0
    ],
    "StartingReputationModes": [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}