{
    "ID": "faction_FederatedCommonwealth",
    "Name": "the Federated Commonwealth",
    "ShortName": "FedCom",
    "Description": "The Federated Commonwealth was the union of the Lyran Commonwealth and Federated Suns. The accession of Archon-Prince Victor Steiner-Davion in 3055 formally brought the nation into being, though in practice it had existed as the Federated Commonwealth Alliance since 3028. Katherine Steiner-Davion seceded the Lyran half of the nation in 3057, creating the Lyran Alliance, which would lead to the FedCom Civil War in 3062. Victor abdicated the throne in 3067 and his successor, Prince-Regent Yvonne Steiner-Davion, reverted to the \"Federated Suns\". In 3084 the Lyran Alliance reverted to the Lyran Commonwealth. ",
    "Demonym": "FedCom",
    "Government": "Federation",
    "Allies": [],
    "Enemies": [
        "TikonovFreeRepublic",
        "Marik",
        "Kurita",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "GreenGhosts",
        "Outworld",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony",
        "ClanMongoose",
        "ClanSeaFox",
        "ClanWidowmaker",
        "ClanWolverine",
        "MinnesotaTribe",
        "UmayyadCaliphate",
        "FinmarkFreeRepublic",
        "KitteryPrefecture",
        "SLDFinExile",
        "RoguePirates",
        "RimTerritories",
        "TimbuktuCollective",
        "VesperMarches",
        "FroncReaches"
    ],
    "Presence": 1,
    "ReputationStatements": [
        "Commander, {COMPANY.CompanyName} has never served the Federated Commonwealth before, so we have no record of your reliability. Take this contract and show us you can uphold the standards of FedCom forces.",
        "Your exploits are known across neighboring realms, even if you haven't fought for the Commonwealth yet. We see potential utility in your skills; examine this contract and demonstrate your worth.",
        "Though we have had limited dealings, your performance elsewhere suggests competence and discipline. The Federated Commonwealth will consider further engagements should you complete this mission satisfactorily.",
        "Commander, your past service alongside FedCom assets was effective and contributed to our objectives. We extend this contract in confidence of your continued effectiveness.",
        "Greetings again, Commander. Your reliability and battlefield performance have earned the Commonwealth's respect. We present this contract in recognition of your proven capabilities.",
        "Commander, {COMPANY.CompanyName} stands among the more dependable mercenary groups the Federated Commonwealth has enlisted. We trust your execution and value your contributions to our joint goals.",
        "Commander, you are one of the top mercenary companies the Commonwealth prefers to hire—proven, disciplined, and formidable. Here is another critical contract, and we expect excellence as always."
    ],
    "MissionSuccessStatements": [
        "Exceptional work, Commander. Your success directly furthers the Federated Commonwealth's strategic aims, and your payment has been authorized with commendations to your company."
    ],
    "GoodFaithFailureStatements": [
        "Commander, the Federated Commonwealth understands that even capable warriors face unforeseen challenges. Though the objectives weren't all met, we acknowledge your effort and will provide partial payment."
    ],
    "BadFaithFailureStatements": [
        "Commander, this outcome falls far below the Federated Commonwealth's standards. Your conduct on the field was negligent, and as a result, no payment will be issued. Rebuild your discipline before engaging FedCom interests again."
    ],
    "DefaultCombatLeaderCastDefId": "castDef_FederatedCommonwealth",
    "DefaultRepresentativeCastDefId": "castDef_FederatedCommonwealth",
    "factionID": "FederatedCommonwealth",
    "icon": "uixTxrLogo_FederatedCommonwealth",
    "heraldryDefId": "heraldrydef_FederatedCommonwealth",
    "factionMapColor": "rgba(255,255,0,1.0)"
}