{
    "ID": "faction_TikonovFreeRepublic",
    "Name": "Tikonov Free Republic",
    "ShortName": "Republic",
    "Description": "The Tikonov Free Republic was a short-lived state formed during the Fourth Succession War. Following his defection to the Federated Suns in early 3029, Capellan Confederation Colonel Pavel Ridzik established his own fiefdom from Tikonov Commonality worlds as yet unconquered by the Suns. After his death the statelet voted to merge with the Lyran Commonwealth's Sarna March in 3031",
    "Demonym": "Tikonov",
    "Government": "Republic",
    "Allies": [],
    "Enemies": [
        "FederatedCommonwealth",
        "Marik",
        "Kurita",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "GreenGhosts",
        "Outworld",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony",
        "ClanMongoose",
        "ClanSeaFox",
        "ClanWidowmaker",
        "ClanWolverine",
        "MinnesotaTribe",
        "UmayyadCaliphate",
        "FinmarkFreeRepublic",
        "KitteryPrefecture",
        "SLDFinExile",
        "RoguePirates",
        "RimTerritories",
        "TimbuktuCollective",
        "VesperMarches",
        "FroncReaches"
    ],
    "Presence": 0.1,
    "ReputationStatements": [
        "Commander, you've never served the Republic before, so let's be frank — we're unsure what to expect. Take this contract and show us you're worth the c-bills we'd pay.",
        "Your reputation precedes you across these systems, Commander, even if we haven't worked together yet. The Republic has need of skilled blade-for-hire talent — prove yourself with this job.",
        "You've taken contracts elsewhere with notable results, and while the Republic is cautious, we think you might be of service. Review this contract and let's see if we can benefit one another.",
        "Commander, we've worked with you before and your performance was satisfactory. The Republic extends this new contract with confidence in your abilities — deliver, and our respect grows.",
        "Greetings, Commander. Your prior service to the Republic impressed our Council. We offer you this mission in recognition of proven skill and dependability — another success will further strengthen our ties.",
        "Commander, you've proven yourself among the most reliable mercenaries the Republic has ever hired. We trust you with important contracts and value your continued support of our cause.",
        "Commander, you are among the premier blades we look to in troubled times. The Republic prefers your company above all others — take this critical mission and uphold your outstanding reputation."
    ],
    "MissionSuccessStatements": [
        "Well done, Commander. Your actions have directly strengthened the security and legitimacy of the Tikonov Free Republic. Payment has been authorized, and your standing with us has improved considerably."
    ],
    "GoodFaithFailureStatements": [
        "Commander, the mission objectives were not fully achieved, but your effort and discipline were evident. The Republic recognizes honest failure in difficult circumstances, and partial payment will be issued accordingly."
    ],
    "BadFaithFailureStatements": [
        "Commander, this outcome is unacceptable. Your conduct and performance failed to meet the Republic's expectations, and such negligence undermines our survival. No payment will be issued, and your reputation here has suffered greatly."
    ],
    "factionID": "TikonovFreeRepublic",
    "icon": "uixTxrLogo_TikonovFreeRepublic",
    "DefaultCombatLeaderCastDefId": "castDef_TikonovFreeRepublic",
    "DefaultRepresentativeCastDefId": "castDef_TikonovFreeRepublic",
    "HeraldryDefId": "heraldrydef_TikonovFreeRepublic",
    "factionMapColor": "rgba(0,0,204,0.4)"
}