{
    "ID": "faction_RimWorldsRepublic",
    "Name": "Rim Worlds Republic",
    "ShortName": "Rim Worlds Republic",
    "Description": "The Rim Worlds Republic, 2250-2769, was born of Hector Worthington Rowe and his five-hundred-strong Theban Legion at the end of their own Second Exodus. Journeying for six years through the Dark Nebula, the men who would create the Republic were anti-Alliance veterans on the run aboard blackmailed JumpShips, plunder from slain garrisons, and a limited number of provisions and women they'd taken as slaves. Simply put - pirates.",
    "Demonym": "Rim Worlder",
    "Government": "Republic",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "Marik",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "RimCommonality",
        "AmarisEmpire",
        "TerranHegemony",
        "SLDF"
    ],
    "Presence": 1,
    "ReputationStatements": [
        "I don't know why we bother offering you contracts, to be perfectly honest. It's obvious you're not a friend to the Rim Worlds Republic. Regardless, we find ourselves in desperate times, so we have to scrape the bottom of the barrel.",
        "Greetings, mercenary. Lowly and despicable though you may be, you may yet serve our interests. Finish this job, and we may look upon you with more favor than you likely deserve.",
        "The Rim Worlds Republic has a use for mercenaries like you, Commander. I think you'll be interested in the attached contract. Hopefully we can come to a mutually beneficial agreement.",
        "The Rim Worlds Republic would like to offer you a choice contract, Commander. As the leader of a respected mercenary company, you should find the terms both fair and equitable, I think.",
        "Commander, I hope this message finds you well. The people of the Rim Worlds Republic would like to extend a contract to you, owing to our respect for your skills. Please consider it carefully.",
        "Greetings, my friend. This contract is not one we would offer to a lesser mercenary, but you've proven your loyalty, prowess, and dedication to the ideals of the Rim Worlds Republic. I hope you'll accept our offer.",
        "We both know the score, Commander. The Republic relies on you like you're one of our own, and you've always been happy to help us out. I hope you can see fit to agree this time as well—this is a job too important for lesser warriors."
    ],
    "MissionSuccessStatements": [
        "Top-tier work, Commander — The Republic is very happy with your performance. Keep it up, and I'll make sure a lot more work comes your way."
    ],
    "GoodFaithFailureStatements": [
        "The Rim Worlds Republic understands that sacrifice on the battlefield doesn't always translate to victory. You've made a fine effort, even if it failed. Just another lesson for the next battle."
    ],
    "BadFaithFailureStatements": [
        "We are deeply disappointed in your performance, Commander. Your efforts on the battlefield were those of a raw cadet, not the leader of a mercenary company."
    ],
    "DefaultCombatLeaderCastDefId": "castDef_RimWorldsRepublic",
    "DefaultRepresentativeCastDefId": "castDef_RimWorldsRepublic",
    "DataManager": null,
    "factionID": "RimWorldsRepublic",
    "icon": "uixTxrLogo_RimWorldsRepublic",
    "heraldryDefId": "heraldrydef_RimWorldsRepublic",
    "storePanelImage": "uixTxrSpot_Store-Marik",
    "factionStoreColor": "rgba(35,24,37,1.0)",
    "factionMapColor": "rgba(0,204,255,1.0)",
    "StartingReputationValues": [
        0,
        0,
        0
    ],
    "StartingReputationModes": [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}