{
    "ID": "faction_FroncReaches",
    "Name": "Fronc Reaches",
    "ShortName": "Fronc",
    "Demonym": "Fronc",
    "Government": "Alliance",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "GreenGhosts",
        "Outworld",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_FroncReaches",
    "DefaultRepresentativeCastDefId": "castDef_FroncReaches",
    "HeraldryDefId": "heraldrydef_FroncReaches",
    "ReputationStatements": [
        "Commander, clearly we are at your mercy here, so I of beg you to stop fighting us.  If you want money or salvage, I can offer you those with this contract.",
        "Please Commander, the Fronc Reaches desperately needs you to stop fighting against us.  I have been authorized to offer this contract in the hopes of a future together.",
        "Commander, the Fronc Reaches faces pressures from other factions, we would really appreciate you considering this contract to perform a task for us.",
        "The Fronc Reaches greets you Commander, and I can offer you this contract for your consideration.",
        "Commander, we acknowledge your assistance in the past, and offer you this contract in the hopes of continuing our beneficial relations.",
        "Greetings Commander.  You have assisted the Alliance against our numerous foes, and we ask you to do so again; adequately compensated of course.",
        "Hello my friend, it is good to see you. The Alliance has a task that I can't entrust to any other, and I hope you will accept this contract."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  You have completed the required objectives, and I am happy to remit the full contracted amount to your account."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we required the primary objective completed.  However, seeing as you did at least make an attempt, I will forward a partial payment to your account"
    ],
    "BadFaithFailureStatements": [
        "Seriously, how can you expect to be taken seriously as a mercenary if you can't even complete a simple contract?  I hope you don't expect payment, as none will be forthcoming."
    ],
    "Description": "The Fronc Reaches is a small Periphery state located in the Capellan Marches rimward of the Capellan Confederation, spinward of the Magistracy of Canopus, and anti-spinward of the Taurian Concordat. The Fronc Reaches formed from worlds jointly colonized by the Magistracy of Canopus and the Taurian Concordat, formerly known as the New Colony Region.",
    "factionID": "FroncReaches",
    "icon": "uixTxrLogo_FroncReaches",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(0,0,204,0.4)"
}