{
    "ID": "faction_AmarisEmpire",
    "Name": "Amaris Empire",
    "ShortName": "Amaris Empire",
    "Description": "The Amaris Empire was the realization of Stefan's great ambitions. Viewing all the Inner Sphere, and specifically the Star League, as oppressor states who were crushing the Periphery states, Stefan planned a military coup to overthrow the League leadership and take the power. The death of First Lord Simon Cameron in 2751 was his opportunity. The First Lord's death, apparently an accident, later was discovered to be a murder, but it remains unknown if it was the work of Stefan or not. In any case, Stefan approached Richard Cameron, the young successor of Simon, winning his trust, murdering him, all his family and anyone loyal to the Camerons. The Amaris Coup was a great initial success, conquering all worlds of the Terran Hegemony. ",
    "Demonym": "Amarian",
    "Government": "Empire",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "Marik",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "RimCommonality",
        "RimWorldsRepublic",
        "TerranHegemony",
        "SLDF"
    ],
    "Presence": 1,
    "ReputationStatements": [
        "I don't know why we bother offering you contracts, to be perfectly honest. It's obvious you're not a friend to the Amaris Empire and most likely an SLDF spy. Regardless, we find ourselves in desperate times, so we have to scrape the bottom of the barrel.",
        "Greetings, mercenary. Lowly and despicable though you may be, you may yet serve our interests. Finish this job, and we may look upon you with more favor than you likely deserve.",
        "The Amaris Empire has a use for mercenaries like you, Commander. I think you'll be interested in the attached contract. It would be in your best interests that we come to a mutually beneficial agreement.",
        "The Amaris Empire would like to offer you a choice contract, Commander. As the leader of a respected mercenary company, you should find the terms fair.",
        "Commander, I hope this message finds you well. The people of the Amaris Empire would like to extend a contract to you, as you have proven the value for your skills. Please consider it carefully.",
        "Greetings, my friend. This contract is not one we would offer to a lesser mercenary, but you've proven your loyalty, prowess, and dedication to the ideals of the Amaris Empire. I hope you'll accept our offer.",
        "We both know the score, Commander. The Empire relies on you like you're one of our own, and you've always been there to help us out. I hope you can see fit to agree this time as well — this is a job too important for lesser warriors."
    ],
    "MissionSuccessStatements": [
        "Top-tier work, Commander — The Empire is most pleased with your results. Keep it up, and I'll make sure a lot more work comes your way."
    ],
    "GoodFaithFailureStatements": [
        "The Amaris Empire understands that sacrifice on the battlefield doesn't always translate to victory. You've made a valiant, yet ineffective effort. We trust you will do better for the next battle."
    ],
    "BadFaithFailureStatements": [
        "Your performance was appalling, Commander. Your efforts on the battlefield were no better than a rural militia, and not indicative of the leader of a reknowned mercenary company."
    ],
    "DefaultCombatLeaderCastDefId": "castDef_AmarisEmpire",
    "DefaultRepresentativeCastDefId": "castDef_AmarisEmpire",
    "DataManager": null,
    "factionID": "AmarisEmpire",
    "icon": "uixTxrLogo_AmarisEmpire",
    "heraldryDefId": "heraldrydef_AmarisEmpire",
    "storePanelImage": "uixTxrSpot_Store-Marik",
    "factionStoreColor": "rgba(35,24,37,1.0)",
    "factionMapColor": "rgba(153,102,102,1.0)",
    "StartingReputationValues": [
        0,
        0,
        0
    ],
    "StartingReputationModes": [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}