{
  "ID": "faction_ClanHellsHorses3150",
  "Name": "Clan Hell's Horses",
  "ShortName": "Hell's Horses",
  "Description": "Angry at the Wolves for denying his Clan the opportunity to fight on Terra, Khan Amirault stated that he did not recognize Ward as ilKhan and claimed that the Wolves had unfairly denied the Hell's Horses a chance to become the ilClan, while at the same time 'inviting' Clan Jade Falcon to Terra to participate in the planet's conquest. Amirault then demanded a Trial of Refusal against Ward who responded by pointing out that the Wolves were under no obligation to invite the Hell's Horses to Terra, nor had the Horses earned the right to such a consideration.  Ward then stated that there would be no Circle of Equals between himself and Amirault because, as ilKhan and First Lord of the Star League, he had no equal. Amirault, in response, declared that the Hell's Horses would not stand for such an offence and the Horses' delegation publicly declared their nonrecognition of the new ilKhan's authority before the assembled Clan representatives during Ward's coronation as First Lord.  As a consequence of their failure to conquer the rest of the former Jade Falcon Occupation Zone, saKhan Lassenerra accused Khan Amirault of squandering the Hell's Horses position through his hesitancy and overcautiousness, and killed him in a Trial of Position, thereby becoming the new Khan. The Hell's Horses, the Clan was united again and back under the leadership of a true warrior. They began strengthening their military while considering making amends with Alaric.  Always known for their prominent use of combat vehicles in front-line forces, the Hell's Horses lived by the motto that man came before machine and all members were valued as being part of a greater whole, including freebirths.",
  "Demonym": "Hell's Horses",
  "Government": "Clan",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "ShadowDivisions",
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanSeaFox3150",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake",
    "Republic",
    "Society",
    "ClanBloodSpirit",
    "DarkCaste",
    "MarikStewart",
    "Rim",
    "GhostBearDominion",
    "RegulanFiefs",
    "TamarindAbbey",
    "DuchyOfAndurien",
    "RavenAlliance",
    "FiltveltCoalition",
    "OrienteProtectorate",
    "RimCommonality",
    "CalderonProtectorate",
    "ClanStoneLion",
    "ClanWolfInExile",
    "EscorpionImperio",
    "FroncReaches",
    "GreenGhosts",
    "AmarisEmpire",
    "RimWorldsRepublic",
    "SLDF",
    "TerranHegemony",
    "ClanMongoose",
    "ClanSeaFox",
    "ClanWidowmaker",
    "ClanWolverine",
    "MinnesotaTribe",
    "UmayyadCaliphate",
    "FinmarkFreeRepublic",
    "KitteryPrefecture",
    "SLDFinExile",
    "RoguePirates",
    "CalderonProtectorate3150",
    "ClanHellsHorses",
    "ClanJadeFalcon3150",
    "Davion3150",
    "DuchyOfAndurien3150",
    "FiltveltCoalition3150",
    "FroncReaches3150",
    "Kurita3150",
    "Liao3150",
    "Lothian3150",
    "MagistracyOfCanopus3150",
    "Marian3150",
    "Marik3150",
    "RavenAlliance3150",
    "Steiner3150",
    "TaurianConcordat3150",
    "AlyinaMercantileLeague",
    "ArcRoyalLibertyCoalition",
    "ClanProtectorate",
    "FerrisCollective",
    "GalateanLeague",
    "Havens",
    "NewOberonConfederation",
    "RagnarokUnion",
    "RasalhagueDominion",
    "RimTerritories",
    "ScorpionEmpire",
    "TamarPact",
    "TimbuktuCollective",
    "VesperMarches",
    "WolfEmpire",
    "RepublicoftheBarrens"
  ],
  "Presence": 0.1,
  "ReputationStatements": [
    "Your repeated actions against Hell's Horses have made me question whether I should hold you in disdain.  Take up this batchall and prove to me that mercenaries such as you are useful.",
    "You have fought against Hell's Horses on many occasions.  Prove you can assist as well as cause harm by performing this task, and we might have further use for you.",
    "My Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
    "You are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
    "You have assisted the Hell's Horses in the past, and I would like to offer you this batchall so that we can continue this relationship.",
    "Hello again, friend to the Hell's Horses Clan.  We offer you this batchall in recognition of our friendship, and in the hopes that we can benefit each other in future.",
    "Greetings, my friend.  You have helped me so often, I feel we should discuss the possibility of you joining the Horses yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
  ],
  "MissionSuccessStatements": [
    "Well done Commander.  The satisfactory completion of this batchall will benefit us both, and I have transferred your c-bills as agreed."
  ],
  "GoodFaithFailureStatements": [
    "While Hell's Horses value swiftness, we don't value those who run from battle!  However I will provide a partial payment for your partial completion, so long as you do better next time."
  ],
  "BadFaithFailureStatements": [
    "Your cowardice dishonors you, and you have failed to honour the terms of the batchall in any significant way.  You receive nothing from me, other than my disdain."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_ClanHellsHorses",
  "DefaultRepresentativeCastDefId": "castDef_ClanHellsHorses",
  "factionID": "ClanHellsHorses3150",
  "icon": "uixTxrLogo_ClanHellsHorses",
  "heraldryDefId": "heraldrydef_ClanHellsHorses",
  "factionMapColor": "rgba(102,0,0,1.0)",
  "StartingReputationValues": [],
  "StartingReputationModes": [],
  "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)"
}
