{
  "ID": "faction_TimbuktuCollective",
  "Name": "Timbuktu Collective",
  "ShortName": "Timbuktu Collective",
  "Description": "The Timbuktu Collective is a protective alliance formed in June 3148 through the merger of the Rim Collection and five worlds from the Lyran Commonwealth's Timbuktu Theater. This union was driven by secessionist sentiments and a desire for greater autonomy amid perceived neglect by the Commonwealth. The Collective's capital is Timbuktu II, and as of 3151, it controlled 17 systems. Its military, the Collective Armed Guards (CAG), was initially formed from defected units and has since expanded through local enlistment and the hiring of mercenaries. The Collective has steadily expanded its borders, incorporating additional worlds such as Pocologan, Viborg, and Sapienza. Despite economic challenges due to reduced interstellar trade, the Timbuktu Collective remains determined to restore its former territories and industrial might.",
  "Demonym": "Timbuktuan",
  "Government": "Democratic",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "ShadowDivisions",
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanSeaFox3150",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake",
    "Republic",
    "Society",
    "ClanBloodSpirit",
    "DarkCaste",
    "MarikStewart",
    "Rim",
    "GhostBearDominion",
    "RegulanFiefs",
    "TamarindAbbey",
    "DuchyOfAndurien",
    "RavenAlliance",
    "FiltveltCoalition",
    "OrienteProtectorate",
    "RimCommonality",
    "CalderonProtectorate",
    "ClanStoneLion",
    "ClanWolfInExile",
    "EscorpionImperio",
    "GreenGhosts",
    "Outworld",
    "AmarisEmpire",
    "RimWorldsRepublic",
    "SLDF",
    "TerranHegemony",
    "ClanMongoose",
    "ClanSeaFox",
    "ClanWidowmaker",
    "ClanWolverine",
    "MinnesotaTribe",
    "UmayyadCaliphate",
    "FinmarkFreeRepublic",
    "KitteryPrefecture",
    "SLDFinExile",
    "RoguePirates",
    "CalderonProtectorate3150",
    "ClanHellsHorses3150",
    "ClanJadeFalcon3150",
    "Davion3150",
    "DuchyOfAndurien3150",
    "FiltveltCoalition3150",
    "FroncReaches3150",
    "Kurita3150",
    "Liao3150",
    "Lothian3150",
    "MagistracyOfCanopus3150",
    "Marian3150",
    "Marik3150",
    "RavenAlliance3150",
    "Steiner3150",
    "TaurianConcordat3150",
    "ArcRoyalLibertyCoalition",
    "ClanProtectorate",
    "FerrisCollective",
    "GalateanLeague",
    "Havens",
    "NewOberonConfederation",
    "RagnarokUnion",
    "RepublicoftheBarrens",
    "RasalhagueDominion",
    "RimTerritories",
    "ScorpionEmpire",
    "TamarPact",
    "AlyinaMercantileLeague",
    "VesperMarches",
    "WolfEmpire",
    "FroncReaches"
  ],
  "Presence": 0.1,
  "ReputationStatements": [
    "Commander, your continual actions against the Timbuktu Collective jeopardize the future of our fragile society. Please, I implore you to take on this contract to assist us in protecting our worlds and safeguarding our children from oppression.",
    "Commander, the Timbuktu Collective is a coalition striving to maintain its independence and protect its people. Cease hostilities against us, and instead, consider helping with this task for the good of our shared humanity.",
    "Commander, if your actions against the Timbuktu Collective are motivated by payment, know that we can offer contracts equally lucrative while preserving our independence. Please, consider this task instead.",
    "Welcome to the Timbuktu Collective, Commander. I have a mission for you that supports our sovereignty and the protection of our people. Your efforts will be well-compensated.",
    "Commander, your assistance has been invaluable in the past. We humbly request your help once again to defend the sovereignty of the Timbuktu Collective through this contract.",
    "Welcome back, esteemed ally of the Timbuktu Collective. You have done so much to support us before; we hope you will accept this contract to continue our collaboration for mutual benefit.",
    "Commander, you are highly regarded as a savior of the Timbuktu Collective. Though I feel hesitant to ask for your aid again, I assure you this contract is of great importance, and your compensation will reflect that."
  ],
  "MissionSuccessStatements": [
    "Thank you, Commander. Your efforts have safeguarded our people and secured our independence. Payment has been transferred to your account as agreed."
  ],
  "GoodFaithFailureStatements": [
    "Commander, while the contract's main objectives were not fully met, your attempts are appreciated. However, our limited resources only allow for partial payment for partial completion."
  ],
  "BadFaithFailureStatements": [
    "Commander, your failure to complete this task has left the Timbuktu Collective vulnerable to further harm. No payment will be issued for this breach of trust."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_TimbuktuCollective",
  "DefaultRepresentativeCastDefId": "castDef_TimbuktuCollective",
  "factionID": "TimbuktuCollective",
  "icon": "uixTxrLogo_TimbuktuCollective",
  "heraldryDefId": "heraldrydef_TimbuktuCollective",
  "factionMapColor": "rgba(255,204,0,1.0)",
  "StartingReputationValues": [],
  "StartingReputationModes": []
}
