{
    "ID": "faction_AlyinaMercantileLeague",
    "Name": "Alyina Mercantile League",
    "ShortName": "Alyina Mercantile League",
    "Description": "The Alyina Mercantile League is an independent state formed in the wake of Clan Jade Falcon's collapse during the mid-32nd century. Centered on the planet Alyina, the League emerged as a coalition of mercantile interests and planetary governments seeking to establish stability and economic independence in a region long ravaged by Clan conflict. Blending pragmatic governance with a strong focus on commerce, the League fosters cooperation among its member worlds while actively defending its sovereignty through a combination of mercenaries and local forces. Positioned at a crossroads of trade and strategy, the Alyina Mercantile League has become a beacon of order and prosperity in a fractious era.",
    "Demonym": "ALM",
    "Government": "Syndic",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanSeaFox3150",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "GreenGhosts",
        "Outworld",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony",
        "ClanMongoose",
        "ClanSeaFox",
        "ClanWidowmaker",
        "ClanWolverine",
        "MinnesotaTribe",
        "UmayyadCaliphate",
        "FinmarkFreeRepublic",
        "KitteryPrefecture",
        "SLDFinExile",
        "RoguePirates",
        "CalderonProtectorate3150",
        "ClanHellsHorses3150",
        "ClanJadeFalcon3150",
        "Davion3150",
        "DuchyOfAndurien3150",
        "FiltveltCoalition3150",
        "FroncReaches3150",
        "Kurita3150",
        "Liao3150",
        "Lothian3150",
        "MagistracyOfCanopus3150",
        "Marian3150",
        "Marik3150",
        "RavenAlliance3150",
        "Steiner3150",
        "TaurianConcordat3150",
        "ArcRoyalLibertyCoalition",
        "ClanProtectorate",
        "FerrisCollective",
        "GalateanLeague",
        "Havens",
        "NewOberonConfederation",
        "RagnarokUnion",
        "RepublicoftheBarrens",
        "RasalhagueDominion",
        "RimTerritories",
        "ScorpionEmpire",
        "TamarPact",
        "TimbuktuCollective",
        "VesperMarches",
        "WolfEmpire",
        "FroncReaches"
    ],
    "Presence": 1,
    "ReputationStatements": [
        "Your company is relatively untested by the Alyina Mercantile League. While we are aware of your reputation elsewhere, we approach such contracts cautiously. Initial deployments will include a close evaluation period to ensure your reliability aligns with our standards.",
        "While your execution met acceptable standards, certain inefficiencies highlighted areas for improvement. We hope your next engagement will address these concerns, proving your adaptability and commitment.",
        "Your company has served us multiple times and your competence is evident, though minor setbacks in coordination and initiative have occasionally hindered operations. That said, your efforts have supported League goals, warranting continued engagement.",
        "Your company has demonstrated consistent dedication and skill during your tenure with the Alyina Mercantile League. Notable contributions in securing critical assets, coupled with your professionalism, have made you a valued resource in our operations.",
        "Commander, {COMPANY.CompanyName} has become a cornerstone of our military strategy. Your efforts have proven critical in thwarting pirate and other factions incursions and defending League interests. We rely on your expertise as an integral part of our defense network.",
        "Few mercenaries have achieved the level of success {COMPANY.CompanyName} has within the League. Your unwavering loyalty, superior tactics, and ability to train Militia personnel have significantly bolstered the AML's defensive capabilities. {COMPANY.CompanyName} is highly regarded.",
        "Commander, {COMPANY.CompanyName} represents the very best the MRBC has to offer. Your contributions have been instrumental in shaping the Alyina Mercantile League's security. We turn to you first when a critical mission arises, as your reliability is unmatched, and your successes speak for themselves."
    ],
    "MissionSuccessStatements": [
        "Commander, your team has exceeded expectations, securing our objectives with precision and professionalism. The Alyina Mercantile League is impressed by your performance, and we are eager to continue working with {COMPANY.CompanyName} on future operations."
    ],
    "GoodFaithFailureStatements": [
        "Commander, while the mission didn't succeed, your company's efforts were commendable. The League understands that unforeseen challenges played a significant role, and we appreciate your good-faith actions under difficult circumstances. This won't affect our consideration for future opportunities."
    ],
    "BadFaithFailureStatements": [
        "Commander, the Alyina Mercantile League cannot overlook the conduct of your company on this mission. Failures stemming from negligence or disregard for the contract have jeopardized League assets. You will need to undertake significant steps to address these shortcomings, or our partnership will be on hold."
    ],
    "DefaultCombatLeaderCastDefId": "castDef_AlyinaMercantileLeague",
    "DefaultRepresentativeCastDefId": "castDef_AlyinaMercantileLeague",
    "factionID": "AlyinaMercantileLeague",
    "icon": "uixTxrLogo_AlyinaMercantileLeague",
    "heraldryDefId": "heraldrydef_AlyinaMercantileLeague",
    "factionMapColor": "rgba(204,153,255,1.0)"
}