{
    "ID": "faction_MinnesotaTribe",
    "Name": "Minnesota Tribe",
    "ShortName": "331st",
    "Description": "Appearing without warning just prior to the Second Succession War, the so-called Minnesota Tribe were a mysterious warband who fought a line of engagements across the Inner Sphere and then vanished.\r\n\r\n  Though not realized until centuries later in the wake of the Clan Invasion, based on their use of combat tactics and equipment similar to the SLDF and coincidental timing of the Tribe's appearance in the very year of Clan Wolverine's Trial of Annihilation, many would openly suspect that the Minnesota Tribe were the unaccounted survivors of the Wolverines who escaped the Clan Homeworlds. The case was only reinforced after ComStar's public unveiling of much of its history in the wake of the Schism with the publication of a curious report penned by Emilio Travis on the clothing worn by a Minnesota Tribe MechWarrior killed in the fighting on Richmond. Piloting a pristine Lancelot, the warrior was clad in a more advanced version of the SLDF's full body coolant suits which displayed two patches, the Minnesota tribe's insignia with the numbers \"331\" stitched on it, appearing to be a revised version of the insignia of the 331st Royal BattleMech Division, and the other of a white Terran Wolverine with bloodied fangs.\r\n\r\n  When the Explorer Corps had found and superficially surveyed Barbados in 3041 they noted a 63% match of the dead MechWarrior's tattoo with an unknown crest found on an ancient wrecked 'Mech on Barbados—according to its description, this was the Clan Wolverine crest.\r\n\r\n  In 3095, explorers working with Interstellar Expeditions discovered a large, partly underground base on an otherwise uninhabited unnamed world 22.7 lightyears coreward from McEvedy's Folly. They retrieved substantial amounts of equipment and data from the abandoned facility, including what was referred to as the \"Rosetta Stone\" datapad of the Minnesota Tribe. However, a sleeper agent from within the team alerted the Word of Blake who sought to keep the world's secret at all costs. On 15 June 3095 a massive strike force destroyed the team's DropShips and attacked the dig site in what appeared to be either carpet bombing or a nuclear weapon. It is implied that all evidence was destroyed and the entire research team killed before they could inform anyone else of the find.",
    "Demonym": "331st",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "Marik",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "RimCommonality",
        "RimWorldsRepublic",
        "AmarisEmpire",
        "TerranHegemony",
        "ClanMongoose",
        "ClanWidowmaker",
        "ClanSeaFox",
        "ClanWolverine",
        "UmayyadCaliphate",
        "SLDF"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_MinnesotaTribe",
    "DefaultRepresentativeCastDefId": "castDef_MinnesotaTribe",
    "heraldryDefId": "heraldrydef_MinnesotaTribe",
    "ReputationStatements": [
        "I normally don't look down on Freeborn such as you, but your repeated actions against the 331st have made me question whether I should hold you all in disdain.  Take up this batchall and prove to me that Freeborn such as you are useful.",
        "Freeborn, you have fought against 331st on many occasions.  Prove you can assist as well as cause harm by performing this task, and we might have further use for you.",
        "Freeborn, my Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the 331st in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to the Minnesota Tribe.  We offer you this batchall in recognition of our friendship, and in the hopes that we can benefit each other in future.",
        "Greetings my friend.  You have helped me so often, I feel we should discuss the possibility of you joining the 331st yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit us both, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "The 331st understands that sacrifice on the battlefield doesn't always translate to victory. You've made a valiant, yet ineffective effort. We trust you will do better for the next battle."
    ],
    "BadFaithFailureStatements": [
        "Your performance was appalling, Commander. Your tactics on the battlefield were pathetic and ineffectual."
    ],
    "DataManager": null,
    "factionID": "MinnesotaTribe",
    "icon": "uixTxrLogo_MinnesotaTribe",
    "storePanelImage": "uixTxrSpot_Store-Marik",
    "factionStoreColor": "rgba(35,24,37,1.0)",
    "factionMapColor": "rgba(204,255,255,1.0)",
    "StartingReputationValues": [
        0,
        0,
        0
    ],
    "StartingReputationModes": [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}