{
  "ID": "faction_UmayyadCaliphate",
  "Name": "Umayyad Caliphate",
  "ShortName": "Caliphate",
  "Description": "The Umayyad Caliphate is a small state residing within the Deep Periphery. The Umayyads are in a region of space roughly seventy-five light years in diameter, situated 150 light years coreward from the Hanseatic League and 200 light years anti-spinward from the Clan Jade Falcon colony of St. Jean. Originally separate entities, more than 200 years of continuous warfare and shared history has inextricably bound the Umayyads to Nueva Castile, even resulting in the intermingling of some bloodlines.",
  "Demonym": "Caliphate",
  "Government": "Monarchy",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Outworld",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake",
    "Republic",
    "Society",
    "ClanBloodSpirit",
    "DarkCaste",
    "MarikStewart",
    "Rim",
    "GhostBearDominion",
    "RegulanFiefs",
    "TamarindAbbey",
    "DuchyOfAndurien",
    "RavenAlliance",
    "FiltveltCoalition",
    "OrienteProtectorate",
    "Marik",
    "CalderonProtectorate",
    "ClanStoneLion",
    "ClanWolfInExile",
    "EscorpionImperio",
    "FroncReaches",
    "GreenGhosts",
    "RimCommonality",
    "RimWorldsRepublic",
    "AmarisEmpire",
    "TerranHegemony",
    "ClanWolverine",
    "ClanSeaFox",
    "ClanMongoose",
    "MinnesotaTribe",
    "ClanWidowmaker"
  ],
  "Presence": 0.1,
  "DefaultCombatLeaderCastDefId": "castDef_UmayyadCaliphate",
  "DefaultRepresentativeCastDefId": "castDef_UmayyadCaliphate",
  "heraldryDefId": "heraldrydef_UmayyadCaliphate",
  "ReputationStatements": [
    "Your repeated actions against Umayyad Caliphate have made me question whether I should offer you this contract or not.  Take this contract and prove to me that someone of no standing such as you are actually useful.",
    "Commoner, you have fought against Umayyad Caliphate on many occasions.  Show us that you can direct your actions to benefit the Caliphate, and we might have further use for you.",
    "We have faced you in battle many times, commoner.  Complete this contract and perhaps we can elevate your standing.",
    "Commoner, you are an enigma to us.  You fight with the honor and bravery of a noble.  Continue to prove yourself on the field of battle with this contract, and we may have further use of you.",
    "You have assisted the Caliphate in the past, and I would like to offer you this contract so that we can continue this relationship.",
    "Hello again, friend to the Caliphate.  We offer you this contract in recognition of your bravery on the field of battle, and in the hopes that we can benefit each other in future.",
    "Greetings my friend.  You have helped me so often, I feel we should discuss the possibility of you joining the Umayyad Caliphate yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
  ],
  "MissionSuccessStatements": [
    "Well done Commander.  You unwavering loyalty protecting Caliphate ideals is impressive. I have transferred your c-bills as agreed."
  ],
  "GoodFaithFailureStatements": [
    "The Caliphate rewards loyal commanders.  You have shown merit, but still failed in acheiving all objectives. We trust you will see things our way next time."
  ],
  "BadFaithFailureStatements": [
    "Your cowardice justifies your commoner status.  If you cannot even fulfill a simple contract, perhaps you should stop meddling in our affairs and find work far away from here."
  ],
  "DataManager": null,
  "factionID": "UmayyadCaliphate",
  "icon": "uixTxrLogo_UmayyadCaliphate",
  "storePanelImage": "uixTxrSpot_Store-Marik",
  "factionStoreColor": "rgba(35,24,37,1.0)",
  "factionMapColor": "rgba(204,255,255,1.0)",
  "StartingReputationValues": [
    0,
    0,
    0
  ],
  "StartingReputationModes": [
    "KAMEA_CAMPAIGN",
    "CAREER",
    "NONE"
  ]
}
