{
    "ID": "faction_KitteryPrefecture",
    "Name": "Kittery Prefecture",
    "ShortName": "Prefecture",
    "Description": "In 3071, Devlin Stone escaped from a Word of Blake reeducation camp on Kittery - RBMU 105 - in the company of Professor David Lear. Together, they organized a local resistance against Word of Blake forces that was finally able to destroy the Blakist organization on Kittery by the end of that year. By 3072, Stone led a force that liberated a number of nearby worlds from the grip of the Jihad. These worlds eventually joined to form Kittery Prefecture.\r\n\r\nWhen word started spreading about this group of planets that were being liberated from the control of the Blakists, Victor Steiner-Davion believed that this idea of a prefecture was the work of a bandit-king looking to create their own power within the Inner Sphere. In October of 3073, Victor and Stone met on of Tukayyid, where Devlin told him what he was doing and how he was going to do it. Victor had to decide whether he was going to stop Stone or get out of his way. Victor decided to get out of his way, to let Stone restructure the Inner Sphere to allow for peace. Victor knew that society was going to collapse because of the Word of Blake attacks, and restructuring the way society had worked for hundreds of years was the only way to bring peace to the Inner Sphere.",
    "Demonym": "Prefecture",
    "Government": "Republic",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "Valkyrate",
        "WordOfBlake",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony",
        "ClanMongoose",
        "ClanSeaFox",
        "ClanWidowmaker",
        "MinnesotaTribe",
        "SLDFinExile",
        "UmayyadCaliphate",
        "FinmarkFreeRepublic",
        "ClanWolverine",
        "Republic"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_KitteryPrefecture",
    "DefaultRepresentativeCastDefId": "castDef_KitteryPrefecture",
    "HeraldryDefId": "heraldrydef_KitteryPrefecture",
    "ReputationStatements": [
        "We have a job for you, Commander. Let's hope you're not as much of a disappointment this time.",
        "Even if you only work for profit and salvage, you seem effective enough. The Prefecture has need of your skills, Commander.",
        "The Kittery Prefecture would like to offer you a choice contract, Commander. As the leader of a respected mercenary company, you should find the terms both fair and equitable.",
        "Hello, Commander. We value this relationship, and so we would like to offer you first right of refusal on this contract. The job is simple, and the pay adequate. We know it to be within your capabilities as well.",
        "Maintaining the Prefecture against its enemies requires warriors of skill and honor, Commander, and you appear to have both.",
        "Greetings Commander.  You have proven to be quite a friend to the Prefecture. We have saved this contract as reward for your services.",
        "Honored friend! The Prefecture has not forgotten your contributions to its continued existance. In light of this, we present you with this choice contract."
    ],
    "MissionSuccessStatements": [
        "Excellent work, Commander. You have our gratitude and your reward is on its way."
    ],
    "GoodFaithFailureStatements": [
        "Commander, we understand the efforts you expended in attempting to achieve the goals of this mission. We're not upset, just disappointed."
    ],
    "BadFaithFailureStatements": [
        "Removing Blakists is even more difficult when we have to hand-hold incompetent merceraries such as you!  Don't fail us again."
    ],
    "factionID": "KitteryPrefecture",
    "icon": "uixTxrLogo_KitteryPrefecture",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(255,102,0,1.0)"
}