{
    "ID": "faction_ClanSeaFox",
    "Name": "Clan Sea Fox",
    "ShortName": "Sea Fox",
    "Description": "Clan Sea Fox is the original name of Clan Diamond Shark. Clan Sea Fox and Clan Snow Raven had a falling out, and in response Clan Snow Raven created the Diamond Shark, a predator designed solely to hunt and kill the Sea Foxes who lived in Strana Mechty's oceans. After most of the Sea Foxes had been killed, Clan Sea Fox petitioned the Grand Council to change its name to Clan Diamond Shark. Several sea foxes were preserved by the Clan and placed on other worlds, where they flourished. As a result, Clan Diamond Shark changed its name back to Clan Sea Fox by 3100. The Diamond Shark/Sea Fox Clan has relied heavily on its Merchant Caste since its inception, giving them more power and freedom than most Clans. Though many believe them to be weak because of their democratic attitudes toward their lower castes, the Diamond Sharks maintained one of the largest and most elite toumans among the Clans.",
    "Demonym": "Sea Fox",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "Marik",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "RimCommonality",
        "RimWorldsRepublic",
        "AmarisEmpire",
        "TerranHegemony",
        "ClanWolverine",
        "ClanWidowmaker",
        "ClanMongoose",
        "MinnesotaTribe",
        "UmayyadCaliphate",
        "SLDF"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanSeaFox",
    "DefaultRepresentativeCastDefId": "castDef_ClanSeaFox",
    "heraldryDefId": "heraldrydef_ClanSeaFox",
    "ReputationStatements": [
        "I normally don't look down on Freeborn such as you, but your repeated actions against Clan Sea Fox have made me question whether I should hold you all in disdain.  Take up this batchall and prove to me that Freeborn such as you are useful.",
        "Freeborn, you have fought against Clan Sea Fox on many occasions.  Prove you can assist as well as cause harm by performing this task, and we might have further use for you.",
        "Freeborn, my Clan has faced you in battle before, and you are an aggressive warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "Freeborn, you are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "Freeborn, you have assisted the Sea Foxs in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to Clan Sea Fox.  We offer you this batchall in recognition of our friendship, and in the hopes that we can benefit each other in future.",
        "Greetings my friend.  You have helped me so often, I feel we should discuss the possibility of you joining Clan Sea Fox yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  Your efficiency in completing this batchall will benefit us both, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "Clan Sea Fox prefers more tactical commanders.  You've made a valiant, yet ineffective effort. We trust you will commit better assets for the next battle."
    ],
    "BadFaithFailureStatements": [
        "Your performance reeks, nearly as much as you do, Commander. We suggest you bathe before coming before us again."
    ],
    "DataManager": null,
    "factionID": "ClanSeaFox",
    "icon": "uixTxrLogo_ClanSeaFox",
    "storePanelImage": "uixTxrSpot_Store-Marik",
    "factionStoreColor": "rgba(35,24,37,1.0)",
    "factionMapColor": "rgba(204,255,255,1.0)",
    "StartingReputationValues": [
        0,
        0,
        0
    ],
    "StartingReputationModes": [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}