{
    "ID": "faction_SLDFinExile",
    "Name": "SLDF in Exile",
    "ShortName": "SLDF in Exile",
    "Description": "Alternately known as the Exodus Planetary Council, the so-called Star League-in Exile was a provisional government that oversaw the Pentagon and Kerensky Cluster worlds settled by the Exodus Fleet. The collapse of the Star League-in-Exile following the death of General Aleksandr Kerensky and the resulting Pentagon Civil War would trigger the formation of the Clans.\r\n\r\nOn 24 August 2786, the Exodus Fleet arrived in the Pentagon Worlds. Five systems were found in close proximity to one another: Arcadia, Babylon, Circe, Dagda, and Eden. Landing began on each of the worlds by 17 September that year, and colonies began to take shape. Each world was either marginally habitable or had some dangerous pathogen native to it.\r\n\r\nOf six million people, two million were SLDF personnel, a military far beyond what they would need or support. General Kerensky and General Aaron DeChavilier demobilized noncombat specialties and, for any combatants who wished to remain in uniform, held testing at every rank, reducing the SLDF to a half-million strong.\r\n\r\nExploration of the nearby Kerensky Cluster began, and more habitable worlds were found. Strana Mechty and six other worlds were colonized in the Cluster, though the bulk of the population remained in the Pentagon Worlds. The infrastructure and manufacturing to support the new nation were established.  New Moscva on Eden was established as the new capital.",
    "Demonym": "Star League-in Exile",
    "Government": "Military",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "Marik",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "RimCommonality",
        "RimWorldsRepublic",
        "AmarisEmpire",
        "TerranHegemony",
        "KitteryPrefecture",
        "FinmarkFreeRepublic",
        "SLDF",
        "ClanMongoose",
        "ClanSeaFox",
        "ClanWidowmaker",
        "MinnesotaTribe",
        "UmayyadCaliphate",
        "ClanWolverine"
    ],
    "Presence": 1,
    "ReputationStatements": [
        "I don't know why we bother offering you contracts, to be perfectly honest. It's obvious you do not share General Kerensky's vision. Regardless, we find ourselves in desperate times, so the wanna be warriors will have to do.",
        "Greetings, mercenary. Though you are not of the same calibre as the original SLDF, you may yet serve our interests. Finish this job, and we may change our mind.",
        "General Kerensky has a use for mercenaries like you, Commander. I think you'll be interested in the attached contract. An agreement would be most beneficial.",
        "The Star League-in Exile would like to offer you a prime contract, Commander. As the leader of a respected mercenary company, you should find the contract acceptable.",
        "Commander, I hope this message finds you well. The Star League-in Exile would like to extend a contract to you, as you have proven your worth. Please consider it carefully.",
        "Greetings, my friend. This contract is not one we would offer to a lesser mercenary, but you've proven your loyalty, prowess, and dedication to the ideals of General Kerensky. I hope you'll accept our offer.",
        "We both know the sitrep, Commander. The Star League-in Exile relies on you like you're one of our own, and you've always been there to help us out. I hope you can see fit to agree this time as well — this is a job too important for lesser warriors."
    ],
    "MissionSuccessStatements": [
        "Top-tier work, Commander — The General Kerensky himself is most pleased with your results. Keep it up, and I'll make sure a lot more work comes your way."
    ],
    "GoodFaithFailureStatements": [
        "The Star League-in Exile understands that sacrifice on the battlefield doesn't always translate to victory. You've made a valiant, yet ineffective effort. We trust you will do better for the next battle."
    ],
    "BadFaithFailureStatements": [
        "Your performance was appalling, Commander. Your efforts on the battlefield warrant a demotion, and are not indicative of the leader of a reknowned mercenary company."
    ],
    "DefaultCombatLeaderCastDefId": "castDef_SLDFinExile",
    "DefaultRepresentativeCastDefId": "castDef_SLDFinExile",
    "DataManager": null,
    "factionID": "SLDFinExile",
    "icon": "uixTxrLogo_SLDFinExile",
    "heraldryDefId": "heraldrydef_SLDFinExile",
    "storePanelImage": "uixTxrSpot_Store-Marik",
    "factionStoreColor": "rgba(35,24,37,1.0)",
    "factionMapColor": "rgba(153,255,255,1.0)",
    "StartingReputationValues": [
        0,
        0,
        0
    ],
    "StartingReputationModes": [
        "KAMEA_CAMPAIGN",
        "CAREER",
        "NONE"
    ]
}