{
    "ID": "faction_RavenAlliance",
    "Name": "Raven Alliance",
    "ShortName": "Raven Alliance",
    "Demonym": "Raven Alliance",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanHellsHorses",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "ClanSnowRaven",
        "DuchyOfAndurien",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanStoneLion",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_RavenAlliance",
    "DefaultRepresentativeCastDefId": "castDef_RavenAlliance",
    "HeraldryDefId": "heraldrydef_RavenAlliance",
    "ReputationStatements": [
        "I come to you seeking to reverse the distrust between us, by offering you this batchall.  I hope you will accept it.",
        "I wish this emnity between us to go away so that we can offer you more exclusive batchalls.  Please take this so that we can move towards a more trusting relationship.",
        "The Raven Alliance has faced you in battle before.  Take up this batchall so we can mutually profit from a closer relationship.",
        "You are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "You have assisted the Raven Alliance in the past.  Continue to be useful by taking up this batchall and we will offer you more profitable tasks.",
        "Hello again, my mercenary friend.  I have saved this batchall especially for you, in recognition of your fine service in the past.",
        "It is good to see you, my friend.  I have a particularly profitable batchall for you this time, one I can give to no other."
    ],
    "MissionSuccessStatements": [
        "As expected, you have performed the tasks required admirably.  I have transferred the C-bills into your account and hope to work with you again."
    ],
    "GoodFaithFailureStatements": [
        "It is such a shame that you couldn't complete the tasks assigned to you.  Sadly, I can only offer you a partial payment for those tasks you did accomplish - strictly business, nothing personal."
    ],
    "BadFaithFailureStatements": [
        "Commander, you can't expect to enter into a batchall and then fail to fulfill any of the conditions!  You will need to try much harder if you wish to have any further dealings with the Raven Alliance."
    ],
    "Description": "After Clan Snow Raven lost their holdings and was abjured from Clan Space during the Wars of Reaving, they would seek refuge with their allies in the Outworlds Alliance. Seeing the similarities and benefits between both factions, they would bore a fruitful relationship that would result in the merging of the Raven Alliance after the Jihad ended.",
    "factionID": "RavenAlliance",
    "icon": "uixTxrLogo_SnowRavenAlliance",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(102,153,153,1.0)"
}