{
    "ID": "faction_ClanStoneLion",
    "Name": "Clan Stone Lion",
    "ShortName": "Stone Lion",
    "Demonym": "Stone Lion",
    "Government": "Clan",
    "Allies": [],
    "Enemies": [
        "Steiner",
        "Marik",
        "Kurita",
        "Davion",
        "Liao",
        "AuriganRestoration",
        "ComStar",
        "MagistracyOfCanopus",
        "TaurianConcordat",
        "Outworld",
        "Marian",
        "Oberon",
        "Lothian",
        "Circinus",
        "Illyrian",
        "Rasalhague",
        "Ives",
        "Axumite",
        "Castile",
        "Chainelane",
        "ClanBurrock",
        "ClanCloudCobra",
        "ClanCoyote",
        "ClanDiamondShark",
        "ClanFireMandrill",
        "ClanGhostBear",
        "ClanGoliathScorpion",
        "ClanIceHellion",
        "ClanJadeFalcon",
        "ClanNovaCat",
        "ClansGeneric",
        "ClanSmokeJaguar",
        "ClanSnowRaven",
        "ClanStarAdder",
        "ClanSteelViper",
        "ClanWolf",
        "Delphi",
        "Elysia",
        "Hanse",
        "JarnFolk",
        "Tortuga",
        "Valkyrate",
        "NoFaction",
        "Locals",
        "AuriganDirectorate",
        "AuriganPirates",
        "WordOfBlake",
        "Republic",
        "Society",
        "ClanBloodSpirit",
        "DarkCaste",
        "MarikStewart",
        "Rim",
        "GhostBearDominion",
        "RegulanFiefs",
        "TamarindAbbey",
        "DuchyOfAndurien",
        "RavenAlliance",
        "FiltveltCoalition",
        "OrienteProtectorate",
        "RimCommonality",
        "CalderonProtectorate",
        "ClanHellsHorses",
        "ClanWolfInExile",
        "EscorpionImperio",
        "FroncReaches",
        "GreenGhosts",
        "AmarisEmpire",
        "RimWorldsRepublic",
        "SLDF",
        "TerranHegemony"
    ],
    "Presence": 0.1,
    "DefaultCombatLeaderCastDefId": "castDef_ClanStoneLion",
    "DefaultRepresentativeCastDefId": "castDef_ClanStoneLion",
    "HeraldryDefId": "heraldrydef_ClanStoneLion",
    "ReputationStatements": [
        "I normally don't look down on mercenaries such as you, but your repeated actions against Stone Lion have made me question whether I should hold you all in disdain.  Take up this batchall and prove to me that mercenaries such as you are useful.",
        "You have fought against Clan Stone Lion on many occasions.  Prove you can assist as well as cause harm by performing this task, and we might have further use for you.",
        "My Clan has faced you in battle before, and you are a competent warrior.  Take up this batchall and perhaps we can find a more common purpose.",
        "You are an unknown to us.  Prove yourself on the field of battle with this batchall, and we may have further use of you.",
        "You have assisted Clan Stone Lion in the past, and I would like to offer you this batchall so that we can continue this relationship.",
        "Hello again, friend to the Clan.  We offer you this batchall in recognition of our friendship, and in the hopes that we can benefit each other in future.",
        "Greetings, my friend.  You have helped me so often, I feel we should discuss the possibility of you joining the Clan yourself.  Before we do however, there is a task I would entrust to no other that you might assist us with."
    ],
    "MissionSuccessStatements": [
        "Well done Commander.  The satisfactory completion of this batchall will benefit us both, and I have transferred your c-bills as agreed."
    ],
    "GoodFaithFailureStatements": [
        "While Stone Lion value swiftness, we don't value those who run from battle!  However I will provide a partial payment for your partial completion, so long as you do better next time."
    ],
    "BadFaithFailureStatements": [
        "Your cowardice dishonors you, and you have failed to honour the terms of the batchall in any significant way.  You receive nothing from me, other than my disdain."
    ],
    "Description": "Named from the feline inhabiting the northern mountains of Tokasha, Clan Stone Lion was created from the remaining Homeworld members of Clan Hell's Horses after the Abjuration of their Inner Sphere portion in 3075",
    "factionID": "ClanStoneLion",
    "icon": "uixTxrLogo_ClanStoneLion",
    "factionMapBorderOverrideColor": "rgba(0,0,0,1.0)",
    "factionMapColor": "rgba(102,102,153,1.0)"
}