{
  "ID": "faction_TamarPact",
  "Name": "Tamar Pact",
  "ShortName": "Tamar Pact",
  "Description": "In 3151, Hauptmann-General Sarah Regis led the resurrection of the Tamar Pact, following the collapse of the Republic of the Sphere and the Lyran Commonwealth. Acting independently, she freed her homeworld, Arcturus, from Falcon rule and began a campaign to reclaim abandoned systems like Kelenfold, Borghese, and Blue Diamond. On August 13, 3151, she declared the rebirth of the Tamar Pact, renounced her LCAF rank, and appointed herself Governor-General. Despite internal dissent, Regis reorganized her forces into the Armed Forces of Tamar, bolstering them with loyalists, mercenaries, and advanced supplies from Clan Sea Fox and the Alyina Mercantile League. Early successes, including the capture of Kerensky's Vision, established the Pact's position, and with her family's wealth, strategic alliances, and a growing military, Regis transformed the Tamar Pact into a powerful and independent nation determined to restore its former territories and industrial might.",
  "Demonym": "Tamar",
  "Government": "Governer-General",
  "Allies": [],
  "Enemies": [
    "Steiner",
    "Marik",
    "Kurita",
    "Davion",
    "Liao",
    "AuriganRestoration",
    "ComStar",
    "MagistracyOfCanopus",
    "TaurianConcordat",
    "Marian",
    "Oberon",
    "Lothian",
    "Circinus",
    "Illyrian",
    "Rasalhague",
    "Ives",
    "Axumite",
    "Castile",
    "Chainelane",
    "ClanBurrock",
    "ClanCloudCobra",
    "ClanCoyote",
    "ClanDiamondShark",
    "ClanSeaFox3150",
    "ClanFireMandrill",
    "ClanGhostBear",
    "ClanGoliathScorpion",
    "ClanHellsHorses",
    "ClanIceHellion",
    "ClanJadeFalcon",
    "ClanNovaCat",
    "ClansGeneric",
    "ClanSmokeJaguar",
    "ClanSnowRaven",
    "ClanStarAdder",
    "ClanSteelViper",
    "ClanWolf",
    "Delphi",
    "Elysia",
    "Hanse",
    "JarnFolk",
    "Tortuga",
    "Valkyrate",
    "NoFaction",
    "Locals",
    "AuriganDirectorate",
    "AuriganPirates",
    "WordOfBlake",
    "Republic",
    "Society",
    "ClanBloodSpirit",
    "DarkCaste",
    "MarikStewart",
    "Rim",
    "GhostBearDominion",
    "RegulanFiefs",
    "TamarindAbbey",
    "DuchyOfAndurien",
    "RavenAlliance",
    "FiltveltCoalition",
    "OrienteProtectorate",
    "RimCommonality",
    "CalderonProtectorate",
    "ClanStoneLion",
    "ClanWolfInExile",
    "EscorpionImperio",
    "GreenGhosts",
    "Outworld",
    "AmarisEmpire",
    "RimWorldsRepublic",
    "SLDF",
    "TerranHegemony",
    "ClanMongoose",
    "ClanSeaFox",
    "ClanWidowmaker",
    "ClanWolverine",
    "MinnesotaTribe",
    "UmayyadCaliphate",
    "FinmarkFreeRepublic",
    "KitteryPrefecture",
    "SLDFinExile",
    "RoguePirates",
    "CalderonProtectorate3150",
    "ClanHellsHorses3150",
    "ClanJadeFalcon3150",
    "Davion3150",
    "DuchyOfAndurien3150",
    "FiltveltCoalition3150",
    "FroncReaches3150",
    "Kurita3150",
    "Liao3150",
    "Lothian3150",
    "MagistracyOfCanopus3150",
    "Marian3150",
    "Marik3150",
    "RavenAlliance3150",
    "Steiner3150",
    "TaurianConcordat3150",
    "ArcRoyalLibertyCoalition",
    "ClanProtectorate",
    "FerrisCollective",
    "GalateanLeague",
    "Havens",
    "NewOberonConfederation",
    "RagnarokUnion",
    "RepublicoftheBarrens",
    "RasalhagueDominion",
    "RimTerritories",
    "ScorpionEmpire",
    "AlyinaMercantileLeague",
    "TimbuktuCollective",
    "VesperMarches",
    "WolfEmpire",
    "FroncReaches"
  ],
  "Presence": 0.1,
  "ReputationStatements": [
    "Commander, we respect your strength and skills, but this conflict must end. If wealth or salvage is what you seek, we can offer you a lucrative contract that will benefit us both.",
    "Commander, the Tamar Pact is focused on securing its future and reclaiming what was lost. I have been authorized to extend this contract, hoping we can unite in this crucial moment.",
    "Commander, as the Tamar Pact strengthens its resolve, we face pressure from outside forces. We urge you to consider this contract, as your abilities are essential to our success.",
    "The Tamar Pact greets you, Commander. Your talents are needed to ensure our expansion. This contract is offered to you in recognition of your worth.",
    "Commander, we recognize your previous contributions. The Tamar Pact stands stronger than ever, and we present this contract in hopes of solidifying a prosperous future together.",
    "Greetings, Commander. As the Tamar Pact rises to its full strength, your proven loyalty is invaluable. We call on you once more to aid us in expanding our vision, with ample compensation guaranteed.",
    "Commander, the Tamar Pact's resurgence requires only the best, and I believe you are that individual. We offer this contract in recognition of your unmatched expertise."
  ],
  "MissionSuccessStatements": [
    "Well done, Commander. Your success furthers the Tamar Pact's vision. I am pleased to fulfill the contract's terms and ensure the full amount is transferred to your account."
  ],
  "GoodFaithFailureStatements": [
    "Commander, while the primary objective was not completed, your efforts have not gone unnoticed. A partial payment will be sent to your account in recognition of your attempt."
  ],
  "BadFaithFailureStatements": [
    "Commander, your failure to deliver on a simple contract undermines the respect you once held. Understand that no payment will be forthcoming as a result of your failure."
  ],
  "DefaultCombatLeaderCastDefId": "castDef_TamarPact",
  "DefaultRepresentativeCastDefId": "castDef_TamarPact",
  "factionID": "TamarPact",
  "icon": "uixTxrLogo_TamarPact",
  "heraldryDefId": "heraldrydef_TamarPact",
  "factionMapColor": "rgba(0,0,204,0.4)",
  "StartingReputationValues": [],
  "StartingReputationModes": []
}
